{
  "path": "/documentation/foundation/urlsessionwebsockettask/closecode",
  "type": "Enumeration",
  "name": "URLSessionWebSocketTask.CloseCode",
  "desc": "A code that indicates why a WebSocket connection closed.",
  "items": [
    {
      "name": "case abnormalClosure",
      "desc": "A reserved code that indicates the connection closed without a close control frame."
    },
    {
      "name": "case goingAway",
      "desc": "A code that indicates an endpoint is going away."
    },
    {
      "name": "case internalServerError",
      "desc": "A code that indicates the server terminated the connection because it encountered an unexpected condition."
    },
    {
      "name": "case invalid",
      "desc": "A code that indicates the connection is still open."
    },
    {
      "name": "case invalidFramePayloadData",
      "desc": "A code that indicates the server terminated the connection because it received data inconsistent with the message’s type."
    },
    {
      "name": "case mandatoryExtensionMissing",
      "desc": "A code that indicates the client terminated the connection because the server didn’t negotiate a required extension."
    },
    {
      "name": "case messageTooBig",
      "desc": "A code that indicates an endpoint is terminating the connection because it received a message too big for it to process."
    },
    {
      "name": "case noStatusReceived",
      "desc": "A reserved code that indicates an endpoint expected a status code and didn’t receive one."
    },
    {
      "name": "case normalClosure",
      "desc": "A code that indicates normal connection closure."
    },
    {
      "name": "case policyViolation",
      "desc": "A code that indicates an endpoint terminated the connection because it received a message that violates its policy."
    },
    {
      "name": "case protocolError",
      "desc": "A code that indicates an endpoint terminated the connection due to a protocol error."
    },
    {
      "name": "case tlsHandshakeFailure",
      "desc": "A reserved code that indicates the connection closed due to the failure to perform a TLS handshake."
    },
    {
      "name": "case unsupportedData",
      "desc": "A code that indicates an endpoint terminated the connection after receiving a type of data it can’t accept."
    }
  ],
  "declaration": "enum CloseCode : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}