{
  "path": "/documentation/appkit/nssearchfield",
  "type": "Class",
  "name": "NSSearchField",
  "desc": "A text field optimized for performing text-based searches.",
  "items": [
    {
      "name": "var delegate: NSSearchFieldDelegate?",
      "desc": "The delegate for the search field, or nil if the search field doesn’t have a delegate."
    },
    {
      "name": "protocol NSSearchFieldDelegate",
      "desc": "A protocol that a search field delegate can use to determine when a search started or ended."
    },
    {
      "name": "var searchMenuTemplate: NSMenu?",
      "desc": "The menu object used to dynamically construct the search field’s pop-up icon menu."
    },
    {
      "name": "class let clearRecentsMenuItemTag: Int",
      "desc": "The menu item for clearing the current set of recent string searches in the menu."
    },
    {
      "name": "class let noRecentsMenuItemTag: Int",
      "desc": "The menu item that describes a lack of recent search strings."
    },
    {
      "name": "class let recentsMenuItemTag: Int",
      "desc": "The location of recent search strings in the “recents” menu group."
    },
    {
      "name": "class let recentsTitleMenuItemTag: Int",
      "desc": "The menu item that provides the title of the menu group for recent search strings."
    },
    {
      "name": "var sendsSearchStringImmediately: Bool",
      "desc": "A Boolean value indicating whether the cell calls its action method immediately when an appropriate action occurs."
    },
    {
      "name": "var sendsWholeSearchString: Bool",
      "desc": "A Boolean value indicating whether the cell calls its search action method when the user clicks the search button or presses Return, or after each keystroke."
    },
    {
      "name": "var recentSearches: [String]",
      "desc": "The list of recent search strings for the control."
    },
    {
      "name": "var maximumRecents: Int",
      "desc": "The maximum number of search strings that can appear in the search menu."
    },
    {
      "name": "var recentsAutosaveName: NSSearchField.RecentsAutosaveName?",
      "desc": "The name under which the search field automatically archives the list of recent search strings."
    },
    {
      "name": "typealias NSSearchField.RecentsAutosaveName",
      "desc": "The string that stores the name under which a search field automatically archives a list of recent search strings."
    },
    {
      "name": "var cancelButtonBounds: NSRect",
      "desc": "The rectangle for the cancel button within the bounds of the search field."
    },
    {
      "name": "var searchButtonBounds: NSRect",
      "desc": "The rectangle for the search button within the bounds of the search field."
    },
    {
      "name": "var searchTextBounds: NSRect",
      "desc": "The rectangle for the search text within the bounds of the search field."
    }
  ],
  "declaration": "class NSSearchField : NSTextField",
  "inheritsFrom": [
    "NSTextField"
  ]
}