{
  "path": "/documentation/apple_search_ads/budgetorder",
  "type": "Object",
  "name": "BudgetOrder",
  "desc": "The response to requests for budget order details.",
  "items": [
    {
      "name": "billingEmail",
      "desc": "The billing email."
    },
    {
      "name": "budget",
      "desc": "The total budget amount available for the budget order."
    },
    {
      "name": "clientName",
      "desc": "The advertiser or product. This is a requirement for agency-type accounts."
    },
    {
      "name": "endDate",
      "desc": "The scheduled end date and time for the budget order in the format of yyyy-mm-dd'T'HH:MM:SS.SSS."
    },
    {
      "name": "id",
      "desc": "A unique identifier for the budget order. When you create a budget order through the Apple Search Ads UI, the system returns a budget order ID (boId) that you can use with Get a Budget Order to return details of a specific budget order for an organization or campaign group."
    },
    {
      "name": "name",
      "desc": "The name of the budget order, which is unique within an organization."
    },
    {
      "name": "orderNumber",
      "desc": "A purchase order number. This is a requirement for agency-type accounts."
    },
    {
      "name": "parentOrgId",
      "desc": "The unique identifier of the organization that owns the budget order."
    },
    {
      "name": "primaryBuyerEmail",
      "desc": "The primary buyer's email address."
    },
    {
      "name": "primaryBuyerName",
      "desc": "The primary buyer’s name."
    },
    {
      "name": "startDate",
      "desc": "The scheduled start date and time for the budget order in the format of yyyy-mm-dd'T'HH:MM:SS.SSS."
    },
    {
      "name": "status",
      "desc": "The system-controlled status indicator for the budget order.ACTIVEThis status occurs when the budget order reaches its start date.CANCELEDThis status occurs when you cancel the budget order.COMPLETEDThis status occurs when the budget order reaches its end date.EXHAUSTEDThis status occurs when you exhaust the budget for the budget order before it reaches its end date. INACTIVEThis status occurs after you create the budget order and before it reaches its start date."
    },
    {
      "name": "supplySources",
      "desc": "The supply source of ads to use in a budget order and a campaign. Supply sourceDescriptionValidationsAPPSTORE_SEARCH_RESULTSThe campaign runs on the App Store search results page.When supplySources is APPSTORE_SEARCH_RESULTS, the billingEvent value must be TAPS.APPSTORE_SEARCH_TAB The campaign runs on the App Store landing page.Search Match (automatedKeywordsOptIn) can’t be true.You can’t add keywords, negative keywords, or Creative Sets.When supplySources is APPSTORE_SEARCH_TAB, the billingEvent value must be IMPRESSIONS."
    }
  ]
}