{
  "path": "/documentation/apple_search_ads/useracl",
  "type": "Object",
  "name": "UserAcl",
  "desc": "The response to ACL requests.",
  "items": [
    {
      "name": "currency",
      "desc": "The organization’s currency that you set up in the Search Ads UI."
    },
    {
      "name": "displayName",
      "desc": "The display name of the organization."
    },
    {
      "name": "orgId",
      "desc": "The identifier of the organization that owns the campaign. Your orgId is the same as your account in the Apple Search Ads UI."
    },
    {
      "name": "orgName",
      "desc": "The name of your organization."
    },
    {
      "name": "parentOrgId",
      "desc": "The account parent organization identifier."
    },
    {
      "name": "paymentModel",
      "desc": "The payment model that you set through the Search Ads UI. If you don’t set a payment model, campaigns can’t run.PAYGA pay-as-you-go payment model.LOCA line-of-credit payment model.<empty string>There is no set payment method.If you don’t select a payment model, you can still create campaigns. You must select a payment model before a campaign is eligible to run.See Budget Orders for details about setting up a payment model."
    },
    {
      "name": "roleNames",
      "desc": "Each role governs what a user can see and do within the account:API Account ManagerManage all campaigns within an account with read-and-write capabilities.View reporting across the organization.Create and edit an API public key.API Account Read OnlyView reporting across the account with read-only permission.Create and edit an API public key.Limited Access: API Read & WriteView reporting.Manage all campaigns and settings within a campaign group with read-and-write capabilities.Create and edit an API public key.Limited Access: API Read OnlyView reporting across the organization.Create and edit an API public key."
    },
    {
      "name": "timeZone",
      "desc": "The time zone you set during account creation through the Search Ads UI. ORTZ, the organization time zone, is the default."
    }
  ]
}