{
  "path": "/documentation/appkit/nsviewcontroller/transitionoptions",
  "type": "Structure",
  "name": "NSViewController.TransitionOptions",
  "desc": "Animation options for view transitions in a view controller.",
  "items": [
    {
      "name": "static var crossfade: NSViewController.TransitionOptions",
      "desc": "A transition animation that fades the new view in and simultaneously fades the old view out. You can combine this animation option with any of the “slide” options in this enumeration."
    },
    {
      "name": "static var slideUp: NSViewController.TransitionOptions",
      "desc": "A transition animation that slides the old view up while the new view comes into view from the bottom. In other words, both views slide up."
    },
    {
      "name": "static var slideDown: NSViewController.TransitionOptions",
      "desc": "A transition animation that slides the old view down while the new view slides into view from the top. In other words, both views slide down."
    },
    {
      "name": "static var slideLeft: NSViewController.TransitionOptions",
      "desc": "A transition animation that slides the old view to the left while the new view slides into view from the right. In other words, both views slide to the left."
    },
    {
      "name": "static var slideRight: NSViewController.TransitionOptions",
      "desc": "A transition animation that slides the old view to the right while the new view slides into view from the left. In other words, both views slide to the right."
    },
    {
      "name": "static var slideForward: NSViewController.TransitionOptions",
      "desc": "A transition animation that reflects the user interface layout direction (userInterfaceLayoutDirection) in a “forward” manner, as follows:"
    },
    {
      "name": "static var slideBackward: NSViewController.TransitionOptions",
      "desc": "A transition animation that reflects the user interface layout direction (userInterfaceLayoutDirection) in a “backward” manner, as follows"
    },
    {
      "name": "static var allowUserInteraction: NSViewController.TransitionOptions",
      "desc": "A transition animation that allows user interaction during the transition."
    },
    {
      "name": "init(rawValue: UInt)"
    }
  ],
  "declaration": "struct TransitionOptions, @unchecked Sendable",
  "conformsTo": [
    "OptionSet",
    "Sendable"
  ]
}