{
  "path": "/documentation/appkit/nscell/attribute",
  "type": "Enumeration",
  "name": "NSCell.Attribute",
  "desc": "Constants for specifying how a button behaves when pressed and how it displays its state.",
  "items": [
    {
      "name": "case cellAllowsMixedState",
      "desc": "Lets the cell’s state be NSMixedState, as well as NSOffState and NSOnState."
    },
    {
      "name": "case changeBackgroundCell",
      "desc": "If the cell’s state is NSMixedState or NSOnState, changes the cell’s background color from gray to white."
    },
    {
      "name": "case cellChangesContents",
      "desc": "If the cell’s state is NSMixedState or NSOnState, displays the cell’s alternate image."
    },
    {
      "name": "case changeGrayCell",
      "desc": "If the cell’s state is NSMixedState or NSOnState, displays the cell’s image as darkened."
    },
    {
      "name": "case cellDisabled",
      "desc": "Does not let the user manipulate the cell."
    },
    {
      "name": "case cellEditable",
      "desc": "Lets the user edit the cell’s contents."
    },
    {
      "name": "case cellHasImageHorizontal",
      "desc": "Controls the position of the cell’s image: places the image on the right of any text in the cell."
    },
    {
      "name": "case cellHasImageOnLeftOrBottom",
      "desc": "Controls the position of the cell’s image: places the image on the left of or below any text in the cell."
    },
    {
      "name": "case cellHasOverlappingImage",
      "desc": "Controls the position of the cell’s image: places the image over any text in the cell."
    },
    {
      "name": "case cellHighlighted",
      "desc": "Draws the cell with a highlighted appearance."
    },
    {
      "name": "case cellIsBordered",
      "desc": "Draws a border around the cell."
    },
    {
      "name": "case cellIsInsetButton",
      "desc": "Insets the cell’s contents from the border."
    },
    {
      "name": "case cellLightsByBackground",
      "desc": "If the cell is pushed in, changes the cell’s background color from gray to white."
    },
    {
      "name": "case cellLightsByContents",
      "desc": "If the cell is pushed in, displays the cell’s alternate image."
    },
    {
      "name": "case cellLightsByGray",
      "desc": "If the cell is pushed in, displays the cell’s image as darkened."
    },
    {
      "name": "case pushInCell",
      "desc": "Determines whether the cell’s image and text appear to be shifted down and to the right."
    },
    {
      "name": "case cellState",
      "desc": "The cell’s state."
    }
  ],
  "declaration": "enum Attribute : UInt, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}