{
  "path": "/documentation/uikit/uitextcontenttype",
  "type": "Structure",
  "name": "UITextContentType",
  "desc": "Constants that identify the semantic meaning for a text-entry area.",
  "items": [
    {
      "name": "init(rawValue: String)",
      "desc": "Creates a text content type with the specified raw value."
    },
    {
      "name": "static let URL: UITextContentType",
      "desc": "A property that defines the content in a text input area as a URL."
    },
    {
      "name": "static let namePrefix: UITextContentType",
      "desc": "A property that defines the content in a text input area as a prefix or title, such as Dr."
    },
    {
      "name": "static let name: UITextContentType",
      "desc": "A property that defines the content in a text input area as a name."
    },
    {
      "name": "static let nameSuffix: UITextContentType",
      "desc": "A property that defines the content in a text input area as a suffix, such as Jr."
    },
    {
      "name": "static let givenName: UITextContentType",
      "desc": "A property that defines the content in a text input area as a first name."
    },
    {
      "name": "static let middleName: UITextContentType",
      "desc": "A property that defines the content in a text input area as a middle name."
    },
    {
      "name": "static let familyName: UITextContentType",
      "desc": "A property that defines the content in a text input area as a family name, or last name."
    },
    {
      "name": "static let nickname: UITextContentType",
      "desc": "A property that defines the content in a text input area as a nickname."
    },
    {
      "name": "static let organizationName: UITextContentType",
      "desc": "A property that defines the content in a text input area as an organization name."
    },
    {
      "name": "static let jobTitle: UITextContentType",
      "desc": "A property that defines the content in a text input area as a job title."
    },
    {
      "name": "static let location: UITextContentType",
      "desc": "A property that defines the content in a text input area as a location, such as a point of interest, an address, or another identifier for a location."
    },
    {
      "name": "static let fullStreetAddress: UITextContentType",
      "desc": "A property that defines the content in a text input area as a street address that fully identifies a location."
    },
    {
      "name": "static let streetAddressLine1: UITextContentType",
      "desc": "A property that defines the content in a text input area as the first line of a street address."
    },
    {
      "name": "static let streetAddressLine2: UITextContentType",
      "desc": "A property that defines the content in a text input area as the second line of a street address."
    },
    {
      "name": "static let addressCity: UITextContentType",
      "desc": "A property that defines the content in a text input area as a city name."
    },
    {
      "name": "static let addressCityAndState: UITextContentType",
      "desc": "A property that defines the content in a text input area as a city name with a state name."
    },
    {
      "name": "static let addressState: UITextContentType",
      "desc": "A property that defines the content in a text input area as a state name."
    },
    {
      "name": "static let postalCode: UITextContentType",
      "desc": "A property that defines the content in a text input area as a postal code."
    },
    {
      "name": "static let sublocality: UITextContentType",
      "desc": "A property that defines the content in a text input area as a sublocality."
    },
    {
      "name": "static let countryName: UITextContentType",
      "desc": "A property that defines the content in a text input area as a country or region name."
    },
    {
      "name": "static let username: UITextContentType",
      "desc": "A property that defines the content in a text input area as an account or login name."
    },
    {
      "name": "static let password: UITextContentType",
      "desc": "A property that defines the content in a text input area as a password."
    },
    {
      "name": "static let newPassword: UITextContentType",
      "desc": "A property that defines the content in a text input area as a new password."
    },
    {
      "name": "static let oneTimeCode: UITextContentType",
      "desc": "A property that defines the content in a text-input area as a one-time code."
    },
    {
      "name": "static let emailAddress: UITextContentType",
      "desc": "A property that defines the content in a text input area as an email address."
    },
    {
      "name": "static let telephoneNumber: UITextContentType",
      "desc": "A property that defines the content in a text input area as a telephone number."
    },
    {
      "name": "static let creditCardNumber: UITextContentType",
      "desc": "A property that defines the content in a text input area as a credit card number."
    },
    {
      "name": "static let dateTime: UITextContentType",
      "desc": "A property that defines the content in a text input area as a date, time, or duration."
    },
    {
      "name": "static let flightNumber: UITextContentType",
      "desc": "A property that defines the content in a text input area as an airline flight number."
    },
    {
      "name": "static let shipmentTrackingNumber: UITextContentType",
      "desc": "A property that defines the content in a text input area as a parcel tracking number."
    }
  ],
  "declaration": "struct UITextContentType, @unchecked Sendable",
  "conformsTo": [
    "Equatable",
    "Hashable",
    "RawRepresentable",
    "Sendable"
  ]
}