{
  "path": "/documentation/modelio/mdlmaterialsemantic",
  "type": "Enumeration",
  "name": "MDLMaterialSemantic",
  "desc": "Options for the semantic use of a material property’s value in rendering a particular surface appearance; used by the semantic property.",
  "items": [
    {
      "name": "case baseColor",
      "desc": "The inherent color of a surface, to be used as a modulator during shading."
    },
    {
      "name": "case subsurface",
      "desc": "The degree to which light scatters under the surface of a material."
    },
    {
      "name": "case metallic",
      "desc": "The degree to which a material appears as a dielectric surface (lower values) or as a metal (higher values)."
    },
    {
      "name": "case specular",
      "desc": "The intensity of specular highlights that appear on the material’s surface."
    },
    {
      "name": "case specularExponent",
      "desc": "The exponent to be used in Blinn-Phong approximation of the material’s specular response."
    },
    {
      "name": "case specularTint",
      "desc": "The balance of color for specular highlights, between the light color (lower values) and the material’s base color (at higher values)."
    },
    {
      "name": "case roughness",
      "desc": "The degree to which a material appears smooth, affecting both diffuse and specular response."
    },
    {
      "name": "case anisotropic",
      "desc": "The degree to which specular highlights elongate in the direction of the local tangent basis."
    },
    {
      "name": "case anisotropicRotation",
      "desc": "The angle at which anisotropic effects are rotated relative to the local tangent basis."
    },
    {
      "name": "case sheen",
      "desc": "The intensity of highlights that appear only at glancing angles on a material’s surface."
    },
    {
      "name": "case sheenTint",
      "desc": "The balance of color for highlights that appear only at glancing angles, between the light color (lower values) and the material’s base color (at higher values)."
    },
    {
      "name": "case clearcoat",
      "desc": "The intensity of a second specular highlight, similar to the gloss that results from a clear coat on an automotive finish."
    },
    {
      "name": "case clearcoatGloss",
      "desc": "The spread of a second specular highlight, similar to the gloss that results from a clear coat on an automotive finish."
    },
    {
      "name": "case emission",
      "desc": "The color emitted as radiance from a material’s surface."
    },
    {
      "name": "case bump",
      "desc": "The degree of perturbation in a material’s surface."
    },
    {
      "name": "case opacity",
      "desc": "The opacity of a material’s surface."
    },
    {
      "name": "case interfaceIndexOfRefraction",
      "desc": "The index of refraction for the medium surrounding a material."
    },
    {
      "name": "case materialIndexOfRefraction",
      "desc": "The index of refraction for a material itself."
    },
    {
      "name": "case objectSpaceNormal",
      "desc": "The variation in the surface normal vectors in a material, relative to model coordinate space."
    },
    {
      "name": "case tangentSpaceNormal",
      "desc": "The variation in the surface normal vectors in a material, relative to surface tangent coordinate space."
    },
    {
      "name": "case displacement",
      "desc": "The displacement of a material’s surface relative to the surface normal."
    },
    {
      "name": "case displacementScale",
      "desc": "The scaling factor for displacement of a material’s surface."
    },
    {
      "name": "case ambientOcclusion",
      "desc": "The attenuation of ambient light due to local geometry variations on a surface."
    },
    {
      "name": "case ambientOcclusionScale",
      "desc": "The scaling factor for ambient occlusion shading."
    },
    {
      "name": "case none",
      "desc": "The material property’s semantic property has not been initialized."
    },
    {
      "name": "case userDefined",
      "desc": "The meaning of the material property’s value is not one of the standard semantic uses recognized by Model I/O."
    }
  ],
  "declaration": "enum MDLMaterialSemantic : UInt, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}