{
  "path": "/documentation/tvmlkit/tvelementposition",
  "type": "Enumeration",
  "name": "TVElementPosition",
  "desc": "Location of an element relative to the screen or its containing element.",
  "items": [
    {
      "name": "case undefined",
      "desc": "The position has not been defined."
    },
    {
      "name": "case center",
      "desc": "Position the element in the center of its containing element."
    },
    {
      "name": "case top",
      "desc": "Position the element at the top of the containing element."
    },
    {
      "name": "case bottom",
      "desc": "Position the element at the bottom of the containing element."
    },
    {
      "name": "case left",
      "desc": "Position the element along the left side of the containing element."
    },
    {
      "name": "case right",
      "desc": "Position the element along the right side of the containing element."
    },
    {
      "name": "case topLeft",
      "desc": "Position the element in the top-left of the containing element."
    },
    {
      "name": "case topRight",
      "desc": "Position the element in the top-right of the containing element."
    },
    {
      "name": "case bottomLeft",
      "desc": "Position the element in the bottom-left of the containing element."
    },
    {
      "name": "case bottomRight",
      "desc": "Position the element in the bottom-right of the containing element."
    },
    {
      "name": "case header",
      "desc": "Position the element in the header area of the containing element."
    },
    {
      "name": "case footer",
      "desc": "Position the element in the footer area of the containing element."
    },
    {
      "name": "case leading",
      "desc": "Position the element in the leading edge of the containing element."
    },
    {
      "name": "case trailing",
      "desc": "Position the element in the trailing edge of the containing element."
    },
    {
      "name": "case topLeading",
      "desc": "Position the element in the top-leading edge of the containing element."
    },
    {
      "name": "case topTrailing",
      "desc": "Position the element in the top-trailing edge of the containing element."
    },
    {
      "name": "case bottomLeading",
      "desc": "Position the element in the bottom-leading edge of the containing element."
    },
    {
      "name": "case bottomTrailing",
      "desc": "Position the element in the bottom-trailing edge of the containing element."
    }
  ],
  "declaration": "enum TVElementPosition : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}