{
  "path": "/documentation/walletpasses/passfieldcontent",
  "type": "Object",
  "name": "PassFieldContent",
  "desc": "An object that represents the information to display in a field on a pass.",
  "items": [
    {
      "name": "attributedValue",
      "desc": "The value of the field, including HTML markup for links. The only supported tag is the <a> tag and its href attribute. The value of this key overrides that of the value key.For example, the following is a key-value pair that specifies a link with the text “Edit my profile”:”attributedValue”: “<a href=’http://example.com/customers/123’>Edit my profile</a>”The attributed value isn’t used for watchOS; use the value field instead."
    },
    {
      "name": "changeMessage",
      "desc": "A format string for the alert text to display when the pass is updated. The format string must contain the escape %@, which is replaced with the field’s new value. For example, “Gate changed to %@”.You must provide a value for the system to show a change notification.This field isn’t used for watchOS."
    },
    {
      "name": "currencyCode",
      "desc": "The currency code to use for the value of the field."
    },
    {
      "name": "dataDetectorTypes",
      "desc": "The data detectors to apply to the value of a field on the back of the pass. The default is to apply all data detectors. To use no data detectors, specify an empty array. You don’t use data detectors for fields on the front of the pass.This field isn’t used for watchOS."
    },
    {
      "name": "dateStyle",
      "desc": "The style of the date to display in the field."
    },
    {
      "name": "ignoresTimeZone",
      "desc": "A Boolean value that controls the time zone for the time and date to display in the field. The default value is false, which displays the time and date using the current device’s time zone. Otherwise, the time and date appear in the time zone associated with the date and time of value.This key doesn’t affect the pass relevance calculation."
    },
    {
      "name": "isRelative",
      "desc": "A Boolean value that controls whether the date appears as a relative date. The default value is false, which displays the date as an absolute date.This key doesn’t affect  the pass relevance calculation."
    },
    {
      "name": "key",
      "desc": "A unique key that identifies a field in the pass; for example, “departure-gate”."
    },
    {
      "name": "label",
      "desc": "The text for a field label."
    },
    {
      "name": "numberStyle",
      "desc": "The style of the number to display in the field. Formatter styles have the same meaning as the formats with corresponding names in NumberFormatter.Style."
    },
    {
      "name": "textAlignment",
      "desc": "The alignment for the content of a field. The default is natural alignment, which aligns the text based on its script direction. This key is invalid for primary and back fields."
    },
    {
      "name": "timeStyle",
      "desc": "The style of the time displayed in the field."
    },
    {
      "name": "value",
      "desc": "The value to use for the field; for example, 42. A date or time value must include a time zone."
    }
  ]
}