{
  "path": "/documentation/webkit/webeditingdelegate",
  "type": "Protocol",
  "name": "WebEditingDelegate",
  "desc": "No overview available.",
  "items": [
    {
      "name": "func undoManager(for: WebView!) -> UndoManager!",
      "desc": "Returns the undo manager to be used by a web view."
    },
    {
      "name": "func webView(WebView!, doCommandBy: Selector!) -> Bool",
      "desc": "Returns whether the receiver performs a command instead of the web view."
    },
    {
      "name": "func webView(WebView!, shouldApplyStyle: DOMCSSStyleDeclaration!, toElementsIn: DOMRange!) -> Bool",
      "desc": "Returns whether the user should be allowed to apply a style to a range of content."
    },
    {
      "name": "func webView(WebView!, shouldBeginEditingIn: DOMRange!) -> Bool",
      "desc": "Returns whether the user is allowed to edit a range of content in a web view."
    },
    {
      "name": "func webView(WebView!, shouldChangeSelectedDOMRange: DOMRange!, to: DOMRange!, affinity: NSSelectionAffinity, stillSelecting: Bool) -> Bool",
      "desc": "Returns whether the user should be allowed to change the selected range."
    },
    {
      "name": "func webView(WebView!, shouldChangeTypingStyle: DOMCSSStyleDeclaration!, toStyle: DOMCSSStyleDeclaration!) -> Bool",
      "desc": "Returns whether the user should be allowed to change the typing style in a web view."
    },
    {
      "name": "func webView(WebView!, shouldDelete: DOMRange!) -> Bool",
      "desc": "Returns whether the user should be allowed to delete a range of content."
    },
    {
      "name": "func webView(WebView!, shouldEndEditingIn: DOMRange!) -> Bool",
      "desc": "Returns whether the user should be allowed to end editing."
    },
    {
      "name": "func webView(WebView!, shouldInsert: DOMNode!, replacing: DOMRange!, given: WebViewInsertAction) -> Bool",
      "desc": "Returns whether the user should be allowed to insert a node in place of a range of content."
    },
    {
      "name": "func webView(WebView!, shouldInsertText: String!, replacing: DOMRange!, given: WebViewInsertAction) -> Bool",
      "desc": "Returns whether a user should be allowed to insert text in place of a range of content."
    },
    {
      "name": "func webViewDidBeginEditing(Notification!)",
      "desc": "Sent by the default notification center when the user begins editing the web view."
    },
    {
      "name": "func webViewDidChange(Notification!)",
      "desc": "Sent by the default notification center when the user changes content in the web view."
    },
    {
      "name": "func webViewDidChangeSelection(Notification!)",
      "desc": "Sent by the default notification center when the user changes the selection in the web view."
    },
    {
      "name": "func webViewDidChangeTypingStyle(Notification!)",
      "desc": "Sent by the default notification center when the user changes the typing style in the web view."
    },
    {
      "name": "func webViewDidEndEditing(Notification!)",
      "desc": "Sent by the default notification center when the user stops editing the web view."
    }
  ],
  "declaration": "protocol WebEditingDelegate",
  "inheritsFrom": [
    "NSObjectProtocol"
  ]
}