{
  "path": "/documentation/photokit/phphotoserror/code",
  "type": "Enumeration",
  "name": "PHPhotosError.Code",
  "desc": "Error codes for framework operations.",
  "items": [
    {
      "name": "case accessRestricted",
      "desc": "An error that indicates the system configuration restricts access to the asset."
    },
    {
      "name": "case accessUserDenied",
      "desc": "An error that indicates the user denies access."
    },
    {
      "name": "case changeNotSupported",
      "desc": "An error that indicates the system doesn’t support the change request as configured."
    },
    {
      "name": "case identifierNotFound",
      "desc": "An error that indicates an identifier doesn’t exist."
    },
    {
      "name": "case internalError",
      "desc": "An error that indicates an internal error occured."
    },
    {
      "name": "case invalidResource",
      "desc": "An error that indicates the asset resource validation fails."
    },
    {
      "name": "case libraryVolumeOffline",
      "desc": "An error that indicates the photo library isn’t available because the file system volume that stores it isn’t mounted."
    },
    {
      "name": "case missingResource",
      "desc": "An error that indicates a missing asset resource."
    },
    {
      "name": "case multipleIdentifiersFound",
      "desc": "An error that indicates that more than one identifiers exist."
    },
    {
      "name": "case networkAccessRequired",
      "desc": "An error that indicates the request for an asset resource fails because it requires network access."
    },
    {
      "name": "case notEnoughSpace",
      "desc": "An error that indicates there’s not enough space to perform the requested change."
    },
    {
      "name": "case operationInterrupted",
      "desc": "An error that indicates an interruption occured and couldn’t complete."
    },
    {
      "name": "case relinquishingLibraryBundleToWriter",
      "desc": "An error that indicates the photo library isn’t available because the user moved, renamed, or deleted the system’s photo library."
    },
    {
      "name": "case requestNotSupportedForAsset",
      "desc": "An error that indicates the system doesn’t support the request for the specified asset."
    },
    {
      "name": "case switchingSystemPhotoLibrary",
      "desc": "An error that indicates the photo library isn’t available because the user switches the system’s photo library."
    },
    {
      "name": "case userCancelled",
      "desc": "An error that indicates the user cancels the asset retrieval or editing request."
    },
    {
      "name": "case libraryInFileProviderSyncRoot"
    }
  ],
  "declaration": "enum PHPhotosError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}