{
  "path": "/documentation/uikit/uistackview/distribution",
  "type": "Enumeration",
  "name": "UIStackView.Distribution",
  "desc": "The layout that defines the size and position of the arranged views along the stack view’s axis.",
  "items": [
    {
      "name": "case fill",
      "desc": "A layout where the stack view resizes its arranged views so that they fill the available space along the stack view’s axis. When the arranged views do not fit within the stack view, it shrinks the views according to their compression resistance priority. If the arranged views do not fill the stack view, it stretches the views according to their hugging priority. If there is any ambiguity, the stack view resizes the arranged views based on their index in the arrangedSubviews array."
    },
    {
      "name": "case fillEqually",
      "desc": "A layout where the stack view resizes its arranged views so that they fill the available space along the stack view’s axis. The views are resized so that they are all the same size along the stack view’s axis."
    },
    {
      "name": "case fillProportionally",
      "desc": "A layout where the stack view resizes its arranged views so that they fill the available space along the stack view’s axis. Views are resized proportionally based on their intrinsic content size along the stack view’s axis."
    },
    {
      "name": "case equalSpacing",
      "desc": "A layout where the stack view positions its arranged views so that they fill the available space along the stack view’s axis. When the arranged views do not fill the stack view, it pads the spacing between the views evenly. If the arranged views do not fit within the stack view, it shrinks the views according to their compression resistance priority. If there is any ambiguity, the stack view shrinks the views based on their index in the arrangedSubviews array."
    },
    {
      "name": "case equalCentering",
      "desc": "A layout that attempts to position the arranged views so that they have an equal center-to-center spacing along the stack view’s axis, while maintaining the spacing property’s distance between views. If the arranged views do not fit within the stack view, it shrinks the spacing until it reaches the minimum spacing defined by its spacing property. If the views still do not fit, the stack view shrinks the arranged views according to their compression resistance priority. If there is any ambiguity, the stack view shrinks the views based on their index in the arrangedSubviews array."
    }
  ],
  "declaration": "enum Distribution : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}