{
  "path": "/documentation/apple_news/tablecellstyle",
  "type": "Object",
  "name": "TableCellStyle",
  "desc": "The object for applying styles to cells in a table.",
  "items": [
    {
      "name": "backgroundColor",
      "desc": "The background color for the cell.If this property is omitted, the background is transparent.The cell background color is highest priority, followed by the column, and finally the row. All three colors are applied, meaning that non-opaque values can cause combined colors. For example, using a red row together with a blue cell, both with 50% opacity, creates a purple cell."
    },
    {
      "name": "border",
      "desc": "The border for the cell. Because the border is drawn inside the cell, it affects the size of the content within the cell. The bigger the border, the less available space for content."
    },
    {
      "name": "conditional",
      "desc": "An array of styles to be applied only to cells that meet specified conditions. This can be used to change the appearance of specific table cells."
    },
    {
      "name": "height",
      "desc": "The height of the cell and its row, as a number in points, or using one of the units of measure for components.See Specifying Measurements for Components.By default, the height of each row is determined by the height of the content in that row."
    },
    {
      "name": "horizontalAlignment",
      "desc": "Defines the horizontal alignment of content inside cells."
    },
    {
      "name": "minimumWidth",
      "desc": "The minimum width of the cell and its column, as a number in points or in one of the available units of measure for components. See Specifying Measurements for Components."
    },
    {
      "name": "padding",
      "desc": "The space around the content in a table cell in points, supported units, or a Padding object that specifies padding for each side separately."
    },
    {
      "name": "textStyle",
      "desc": "The name string of one of your styles in the Article ArticleDocument.componentTextStyles object."
    },
    {
      "name": "verticalAlignment",
      "desc": "Defines the vertical alignment of content inside cells."
    },
    {
      "name": "width",
      "desc": "The column width, as a percentage only. This property only indicates proportionate width and cannot be used to control exact width. See minimumWidth."
    }
  ]
}