{
  "path": "/documentation/xctest/xctperformancemeasurement",
  "type": "Class",
  "name": "XCTPerformanceMeasurement",
  "desc": "A measurement from a single iteration of a performance test.",
  "items": [
    {
      "name": "init(identifier: String, displayName: String, doubleValue: Double, unitSymbol: String)",
      "desc": "Initializes a performance measurement for a single iteration with the value and unit of measurement."
    },
    {
      "name": "init(identifier: String, displayName: String, doubleValue: Double, unitSymbol: String, polarity: XCTPerformanceMeasurement.Polarity)",
      "desc": "Initializes a performance measurement for a single iteration with the value, unit of measurement, and polarity."
    },
    {
      "name": "init(identifier: String, displayName: String, value: Measurement<Unit>)",
      "desc": "Initializes a performance measurement for a single iteration with the value."
    },
    {
      "name": "init(identifier: String, displayName: String, value: Measurement<Unit>, polarity: XCTPerformanceMeasurement.Polarity)",
      "desc": "Initializes a performance measurement for a single iteration with the value and polarity."
    },
    {
      "name": "var displayName: String",
      "desc": "A human-readable name for a measurement."
    },
    {
      "name": "var identifier: String",
      "desc": "A unique identifier for a measurement."
    },
    {
      "name": "var doubleValue: Double",
      "desc": "The measured value."
    },
    {
      "name": "var unitSymbol: String",
      "desc": "A string that represents the unit of measurement."
    },
    {
      "name": "var value: Measurement<Unit>",
      "desc": "The measured value, including the unit of measure."
    },
    {
      "name": "var polarity: XCTPerformanceMeasurement.Polarity",
      "desc": "A constant that states whether larger or smaller measurements, relative to a set baseline, indicate better performance."
    },
    {
      "name": "enum XCTPerformanceMeasurement.Polarity",
      "desc": "Constants that state whether larger or smaller measurements, relative to a set baseline, indicate better performance."
    }
  ],
  "declaration": "class XCTPerformanceMeasurement : NSObject",
  "inheritsFrom": [
    "NSObject"
  ]
}