{
  "path": "/documentation/storekit/skerror/code",
  "type": "Enumeration",
  "name": "SKError.Code",
  "desc": "Error codes for StoreKit errors.",
  "items": [
    {
      "name": "case unknown",
      "desc": "Error code indicating that an unknown or unexpected error occurred."
    },
    {
      "name": "case clientInvalid",
      "desc": "Error code indicating that the client is not allowed to perform the attempted action."
    },
    {
      "name": "case paymentCancelled",
      "desc": "Error code indicating that the user canceled a payment request."
    },
    {
      "name": "case paymentInvalid",
      "desc": "Error code indicating that one of the payment parameters wasn’t recognized by the App Store."
    },
    {
      "name": "case paymentNotAllowed",
      "desc": "Error code indicating that the user is not allowed to authorize payments."
    },
    {
      "name": "case storeProductNotAvailable",
      "desc": "Error code indicating that the requested product is not available in the store."
    },
    {
      "name": "case cloudServicePermissionDenied",
      "desc": "Error code indicating that the user has not allowed access to Cloud service information."
    },
    {
      "name": "case cloudServiceNetworkConnectionFailed",
      "desc": "Error code indicating that the device could not connect to the network."
    },
    {
      "name": "case cloudServiceRevoked",
      "desc": "Error code indicating that the user has revoked permission to use this cloud service."
    },
    {
      "name": "case privacyAcknowledgementRequired",
      "desc": "Error code indicating that the user has not yet acknowledged Apple’s privacy policy for Apple Music."
    },
    {
      "name": "case unauthorizedRequestData",
      "desc": "Error code indicating that the app is attempting to use a property for which it does not have the required entitlement."
    },
    {
      "name": "case invalidOfferIdentifier",
      "desc": "Error code indicating that the offer identifier is invalid."
    },
    {
      "name": "case invalidOfferPrice",
      "desc": "Error code indicating that the price you specified in App Store Connect is no longer valid."
    },
    {
      "name": "case invalidSignature",
      "desc": "Error code indicating that the signature in a payment discount isn’t valid."
    },
    {
      "name": "case missingOfferParams",
      "desc": "Error code indicating that parameters are missing in a payment discount."
    },
    {
      "name": "case ineligibleForOffer",
      "desc": "An error code that indicates the user is ineligible for the subscription offer."
    },
    {
      "name": "case overlayCancelled",
      "desc": "An error code that indicates the cancellation of an overlay."
    },
    {
      "name": "case overlayInvalidConfiguration",
      "desc": "An error code that indicates the overlay’s configuration is invalid."
    },
    {
      "name": "case overlayPresentedInBackgroundScene"
    },
    {
      "name": "case overlayTimeout"
    },
    {
      "name": "case unsupportedPlatform",
      "desc": "An error code that indicates the current platform doesn’t support overlays."
    }
  ],
  "declaration": "enum SKError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}