{
  "path": "/documentation/gamekit/gkgamesessionerror/code",
  "type": "Enumeration",
  "name": "GKGameSessionError.Code",
  "desc": "Error codes for the GKGameSession domain.",
  "items": [
    {
      "name": "case unknown",
      "desc": "The requested operation could not be completed due to an unknown error."
    },
    {
      "name": "case notAuthenticated",
      "desc": "The requested operation could not be completed because you are not signed in to iCloud."
    },
    {
      "name": "case sessionConflict",
      "desc": "The requested operation could not be completed because the session has been updated on the server, causing a conflict."
    },
    {
      "name": "case sessionNotShared",
      "desc": "The requested operation could not be completed because this session has not been shared with other players."
    },
    {
      "name": "case connectionCancelledByUser",
      "desc": "The requested operation could not be completed because the connection to the session was cancelled."
    },
    {
      "name": "case connectionFailed",
      "desc": "The requested operation could not be completed because the session could not find other players to connect to."
    },
    {
      "name": "case sessionHasMaxConnectedPlayers",
      "desc": "The requested operation could not be completed because the session has reached the maximum number of connected players."
    },
    {
      "name": "case sendDataNotConnected",
      "desc": "The requested operation could not be completed because you are not connected to the session."
    },
    {
      "name": "case sendDataNoRecipients",
      "desc": "The requested operation could not be completed because there are no recipients connected to session."
    },
    {
      "name": "case sendDataNotReachable",
      "desc": "The requested operation could not be completed because one or more players is not reachable."
    },
    {
      "name": "case sendRateLimitReached",
      "desc": "The requested operation could not be completed because you have reached the limits for save data request."
    },
    {
      "name": "case badContainer",
      "desc": "The requested operation could not be completed because the iCloud container is invalid."
    },
    {
      "name": "case cloudQuotaExceeded",
      "desc": "The requested operation could not be completed because the user's iCloud quota would be exceeded."
    },
    {
      "name": "case networkFailure",
      "desc": "The requested operation could not be completed due to an error communicating with the server."
    },
    {
      "name": "case cloudDriveDisabled",
      "desc": "The requested operation could not be completed because iCloud Drive has been disabled for the application."
    },
    {
      "name": "case invalidSession",
      "desc": "The requested operation could not be completed because the Game Session does not exist or the player is not part of the game session."
    }
  ],
  "declaration": "enum GKGameSessionError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}