{
  "path": "/documentation/sirikit/insetclimatesettingsincarintent",
  "type": "Class",
  "name": "INSetClimateSettingsInCarIntent",
  "desc": "A request to change the climate settings in a CarPlay-enabled vehicle.DeprecatedThis intent is no longer available. You may define a custom intent instead. For more information, see Deprecated SiriKit Intent Domains.",
  "items": [
    {
      "name": "init(enableFan: Bool?, enableAirConditioner: Bool?, enableClimateControl: Bool?, enableAutoMode: Bool?, airCirculationMode: INCarAirCirculationMode, fanSpeedIndex: Int?, fanSpeedPercentage: Double?, relativeFanSpeedSetting: INRelativeSetting, temperature: Measurement<UnitTemperature>?, relativeTemperatureSetting: INRelativeSetting, climateZone: INCarSeat, carName: INSpeakableString?)",
      "desc": "Creates the intent object with the specified climate settings information."
    },
    {
      "name": "var carName: INSpeakableString?",
      "desc": "A name that identifies the user’s car."
    },
    {
      "name": "var enableClimateControl: Bool?",
      "desc": "A Boolean value indicating whether to turn on the climate control system."
    },
    {
      "name": "var enableAutoMode: Bool?",
      "desc": "A Boolean value indicating whether to enable automatic mode for the climate control system."
    },
    {
      "name": "var airCirculationMode: INCarAirCirculationMode",
      "desc": "The air circulation mode for the climate control system."
    },
    {
      "name": "var temperature: Measurement<UnitTemperature>?",
      "desc": "The specific temperature to set for the climate control system."
    },
    {
      "name": "var relativeTemperatureSetting: INRelativeSetting",
      "desc": "A relative temperature setting."
    },
    {
      "name": "var climateZone: INCarSeat",
      "desc": "The seat position to have its climate settings modified."
    },
    {
      "name": "var enableFan: Bool?",
      "desc": "A Boolean value indicating whether to turn on the cabin fan system."
    },
    {
      "name": "var fanSpeedIndex: Int?",
      "desc": "An integer value indicating the desired fan speed position."
    },
    {
      "name": "var fanSpeedPercentage: Double?",
      "desc": "A floating-point value indicating the requested fan speed specified as a percentage of the maximum speed."
    },
    {
      "name": "var relativeFanSpeedSetting: INRelativeSetting",
      "desc": "A relative fan speed setting."
    },
    {
      "name": "var enableAirConditioner: Bool?",
      "desc": "A Boolean value indicating whether to turn on the air conditioner system."
    }
  ],
  "declaration": "class INSetClimateSettingsInCarIntent : INIntent",
  "inheritsFrom": [
    "INIntent"
  ]
}