{
  "path": "/documentation/corelocation/clerror/code",
  "type": "Enumeration",
  "name": "CLError.Code",
  "desc": "Error codes returned by the location manager object.",
  "items": [
    {
      "name": "case locationUnknown",
      "desc": "A constant that indicates the location manager was unable to obtain a location value right now."
    },
    {
      "name": "case denied",
      "desc": "A constant that indicates the user denied access to the location service."
    },
    {
      "name": "case promptDeclined",
      "desc": "A constant that indicates the user didn’t grant the requested temporary authorization."
    },
    {
      "name": "case network",
      "desc": "A constant that indicates the network was unavailable or a network error occurred."
    },
    {
      "name": "case headingFailure",
      "desc": "A constant that indicates the location manager can’t determine the heading."
    },
    {
      "name": "case rangingUnavailable",
      "desc": "A constant that indicates ranging is disabled."
    },
    {
      "name": "case rangingFailure",
      "desc": "A constant that indicates a general ranging error occurred."
    },
    {
      "name": "case regionMonitoringDenied",
      "desc": "A constant that indicates the user denied access to the region monitoring service."
    },
    {
      "name": "case regionMonitoringFailure",
      "desc": "A constant that indicates the location manager failed to monitor a registered region."
    },
    {
      "name": "case regionMonitoringSetupDelayed",
      "desc": "A constant that indicates Core Location failed to initialize the region monitoring feature."
    },
    {
      "name": "case regionMonitoringResponseDelayed",
      "desc": "A constant that indicates Core Location will deliver events but they may be delayed."
    },
    {
      "name": "case geocodeCanceled",
      "desc": "A constant that indicates the geocode request was canceled."
    },
    {
      "name": "case geocodeFoundNoResult",
      "desc": "A constant that indicates the geocode request yielded no result."
    },
    {
      "name": "case geocodeFoundPartialResult",
      "desc": "A constant that indicates the geocode request yielded a partial result."
    },
    {
      "name": "case deferredFailed",
      "desc": "A constant that indicates the location manager didn’t enter deferred mode for an unknown reason."
    },
    {
      "name": "case deferredCanceled",
      "desc": "A constant that indicates your app or the location manager canceled the request for deferred updates."
    },
    {
      "name": "case deferredAccuracyTooLow",
      "desc": "A constant that indicates deferred mode isn’t supported for the requested accuracy."
    },
    {
      "name": "case deferredDistanceFiltered",
      "desc": "A constant that indicates deferred mode doesn’t support distance filters."
    },
    {
      "name": "case deferredNotUpdatingLocation",
      "desc": "A constant that indicates the location manager didn’t enter deferred mode because location updates were already disabled or paused."
    }
  ],
  "declaration": "enum CLError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}