{
  "path": "/documentation/appstoreservernotifications/responsebodyv1",
  "type": "Object",
  "name": "responseBodyV1",
  "desc": "The response body containing JSON data that the App Store sends in a version 1 server notification.",
  "items": [
    {
      "name": "auto_renew_adam_id",
      "desc": "An identifier that App Store Connect generates and the App Store uses to uniquely identify the auto-renewable subscription that the user’s subscription renews. Treat this value as a 64-bit integer."
    },
    {
      "name": "auto_renew_product_id",
      "desc": "The product identifier of the auto-renewable subscription that the user’s subscription renews."
    },
    {
      "name": "auto_renew_status",
      "desc": "The current renewal status for an auto-renewable subscription product. Note that these values are the strings “true” and “false”, and not the strings “0” or “1” that appear in auto_renew_status in the receipt."
    },
    {
      "name": "auto_renew_status_change_date",
      "desc": "The time at which the user turned on or off the renewal status for an auto-renewable subscription, in a date-time format similar to the ISO 8601 standard."
    },
    {
      "name": "auto_renew_status_change_date_ms",
      "desc": "The time at which the user turned on or off the renewal status for an auto-renewable subscription, in UNIX epoch time format, in milliseconds. Use this time format to process dates."
    },
    {
      "name": "auto_renew_status_change_date_pst",
      "desc": "The time at which the user turned on or off the renewal status for an auto-renewable subscription, in Pacific Standard Time."
    },
    {
      "name": "bid",
      "desc": "A string that contains the app bundle ID."
    },
    {
      "name": "bvrs",
      "desc": "A string that contains the app bundle version."
    },
    {
      "name": "environment",
      "desc": "The environment for which the App Store generated the receipt."
    },
    {
      "name": "expiration_intent",
      "desc": "The reason a subscription expired. This field is only present for an expired auto-renewable subscription. See expiration_intent for more information."
    },
    {
      "name": "notification_type",
      "desc": "The subscription event that triggered the notification. See notification_type for the complete list of version 1 notification types."
    },
    {
      "name": "original_transaction_id",
      "desc": "The original transaction identifier for which App Store Server Notifications sends the notification."
    },
    {
      "name": "password",
      "desc": "The same value as the shared secret you submit in the password field of the App Store Receipt requestBody when validating receipts."
    },
    {
      "name": "unified_receipt",
      "desc": "An object that contains information about the most recent in-app purchase transactions for the app."
    }
  ]
}