{
  "path": "/documentation/clockkit/clkcomplicationtemplatemodularlargecolumns",
  "type": "Class",
  "name": "CLKComplicationTemplateModularLargeColumns",
  "desc": "A template for displaying multiple columns of data.",
  "items": [
    {
      "name": "init(row1Column1TextProvider: CLKTextProvider, row1Column2TextProvider: CLKTextProvider, row2Column1TextProvider: CLKTextProvider, row2Column2TextProvider: CLKTextProvider, row3Column1TextProvider: CLKTextProvider, row3Column2TextProvider: CLKTextProvider)",
      "desc": "Creates a template that has two columns of text."
    },
    {
      "name": "init(row1ImageProvider: CLKImageProvider?, row1Column1TextProvider: CLKTextProvider, row1Column2TextProvider: CLKTextProvider, row2ImageProvider: CLKImageProvider?, row2Column1TextProvider: CLKTextProvider, row2Column2TextProvider: CLKTextProvider, row3ImageProvider: CLKImageProvider?, row3Column1TextProvider: CLKTextProvider, row3Column2TextProvider: CLKTextProvider)",
      "desc": "Creates a template that has a column of images and two columns of text."
    },
    {
      "name": "var row1ImageProvider: CLKImageProvider?",
      "desc": "An optional image to display at the beginning of the first row."
    },
    {
      "name": "var row1Column1TextProvider: CLKTextProvider",
      "desc": "The text to display in the first column of the first row."
    },
    {
      "name": "var row1Column2TextProvider: CLKTextProvider",
      "desc": "The text to display in the second column of the first row."
    },
    {
      "name": "var row2ImageProvider: CLKImageProvider?",
      "desc": "An optional image to display at the beginning of the second row."
    },
    {
      "name": "var row2Column1TextProvider: CLKTextProvider",
      "desc": "The text to display in the first column of the second row."
    },
    {
      "name": "var row2Column2TextProvider: CLKTextProvider",
      "desc": "The text to display in the second column of the second row."
    },
    {
      "name": "var row3ImageProvider: CLKImageProvider?",
      "desc": "An optional image to display at the beginning of the third row."
    },
    {
      "name": "var row3Column1TextProvider: CLKTextProvider",
      "desc": "The text to display in the first column of the third row."
    },
    {
      "name": "var row3Column2TextProvider: CLKTextProvider",
      "desc": "The text to display in the second column of the third row."
    },
    {
      "name": "var column2Alignment: CLKComplicationColumnAlignment",
      "desc": "The alignment of the text in the second column."
    }
  ],
  "declaration": "class CLKComplicationTemplateModularLargeColumns : CLKComplicationTemplate",
  "inheritsFrom": [
    "CLKComplicationTemplate"
  ]
}