{
  "path": "/documentation/uikit/uilocalnotification",
  "type": "Class",
  "name": "UILocalNotification",
  "desc": "Important:UILocalNotification is deprecated in iOS 10. Use UNNotificationRequest instead. A UILocalNotification object specifies a notification that an app can schedule for presentation at a specific date and time.",
  "items": [
    {
      "name": "var fireDate: Date?",
      "desc": "The date and time when the system should deliver the notification."
    },
    {
      "name": "var timeZone: TimeZone?",
      "desc": "The time zone of the notification’s fire date."
    },
    {
      "name": "var repeatInterval: NSCalendar.Unit",
      "desc": "The calendar interval at which to reschedule the notification."
    },
    {
      "name": "var repeatCalendar: Calendar?",
      "desc": "The calendar the system should refer to when it reschedules a repeating notification."
    },
    {
      "name": "var region: CLRegion?",
      "desc": "The geographic region that triggers the notification."
    },
    {
      "name": "var regionTriggersOnce: Bool",
      "desc": "A Boolean value indicating whether crossing a geographic region boundary delivers only one notification."
    },
    {
      "name": "var alertBody: String?",
      "desc": "The message displayed in the notification alert."
    },
    {
      "name": "var alertAction: String?",
      "desc": "The title of the action button or slider."
    },
    {
      "name": "var alertTitle: String?",
      "desc": "A short description of the reason for the alert."
    },
    {
      "name": "var hasAction: Bool",
      "desc": "A Boolean value that controls whether the notification shows or hides the alert action."
    },
    {
      "name": "var alertLaunchImage: String?",
      "desc": "Identifies the image used as the launch image when the user taps (or slides) the action button (or slider)."
    },
    {
      "name": "var category: String?",
      "desc": "The name of a group of actions to display in the alert."
    },
    {
      "name": "var applicationIconBadgeNumber: Int",
      "desc": "The number to display as the app’s icon badge."
    },
    {
      "name": "var soundName: String?",
      "desc": "The name of the file containing the sound to play when an alert is displayed."
    },
    {
      "name": "var userInfo: [AnyHashable : Any]?",
      "desc": "A dictionary for passing custom information to the notified app."
    },
    {
      "name": "init()"
    },
    {
      "name": "init?(coder: NSCoder)"
    }
  ],
  "declaration": "@MainActor class UILocalNotification : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCoding",
    "NSCopying"
  ]
}