{
  "path": "/documentation/apple_news/condition",
  "type": "Object",
  "name": "Condition",
  "desc": "The object for defining a condition that, when met, causes conditional properties to go into effect.",
  "items": [
    {
      "name": "horizontalSizeClass",
      "desc": "A string describing the width at which the article is displayed. The value indicates whether the article width is considered constrained (compact) or expansive (regular) by iOS. When the article is displayed at the specified size class, the conditional properties are in effect. The horizontal size class is always regular in macOS."
    },
    {
      "name": "maxColumns",
      "desc": "The maximum number of columns in which the article is displayed. When the article is viewed with the specified number of columns or fewer, the conditional properties are in effect. For more information about the column system, see Planning the Layout for Your Article."
    },
    {
      "name": "maxContentSizeCategory",
      "desc": "A string indicating a dynamic type size at which text in the article is displayed. When the article is displayed at the specified size or smaller, the conditional properties are in effect. The default content size category in iOS and macOS is L."
    },
    {
      "name": "maxSpecVersion",
      "desc": "An Apple News Format version that can be used by an Apple News client that is displaying an article. When the Apple News Format version is equal to or less than the specified value, the conditional properties are in effect."
    },
    {
      "name": "maxViewportAspectRatio",
      "desc": "A number indicating a width divided by a height. When the aspect ratio of the user’s viewport is the specified value or smaller, the conditional properties are in effect."
    },
    {
      "name": "maxViewportWidth",
      "desc": "A number indicating width in points. When the width of the user’s viewport is the specified value or smaller, the conditional properties are in effect."
    },
    {
      "name": "minColumns",
      "desc": "The minimum number of columns in which the article is displayed. When the article is viewed with the specified number of columns or more, the conditional properties are in effect. For more information about the column system, see Planning the Layout for Your Article."
    },
    {
      "name": "minContentSizeCategory",
      "desc": "A string indicating a dynamic type size at which text in the article is displayed. When the article is displayed at the specified dynamic type size or greater, the conditional properties are in effect. The default content size category in iOS and macOS is L."
    },
    {
      "name": "minSpecVersion",
      "desc": "An Apple News Format version that can be used by an Apple News client that is displaying an article. When the Apple News Format version is equal to or greater than the specified value, the conditional properties are in effect."
    },
    {
      "name": "minViewportAspectRatio",
      "desc": "A number indicating a width divided by a height. When the aspect ratio of the user’s viewport is the specified value or greater, the conditional properties are in effect."
    },
    {
      "name": "minViewportWidth",
      "desc": "A number indicating the width in points. When the width of the user’s viewport is the specified value or greater, the conditional properties are in effect."
    },
    {
      "name": "platform",
      "desc": "A platform on which an article can be viewed. When the article is viewed on the specified platform, the conditional properties are in effect."
    },
    {
      "name": "preferredColorScheme",
      "desc": "NoteAvailable in iOS 13 and macOS 10.15.A string describing the user's preferred color theme for the system. Valid values:any. The user has no preference.light. The user has not enabled Dark Mode.dark. The user has enabled Dark Mode."
    },
    {
      "name": "subscriptionStatus",
      "desc": "The type of subscription the user has. When the subscription is of the specified type, the conditional properties are in effect."
    },
    {
      "name": "verticalSizeClass",
      "desc": "A string describing the height at which the article is displayed. The value indicates whether the article width is considered constrained (compact) or expansive (regular) by iOS. When the article is displayed at the specified size class, the conditional properties are in effect. The vertical size class is always regular in macOS."
    },
    {
      "name": "territory",
      "desc": "The territory of the user. When the value is specified, the conditional properties are in effect."
    },
    {
      "name": "viewLocation",
      "desc": "The context of the article. When the context is of the specified type, the conditional properties are in effect."
    }
  ]
}