{
  "path": "/documentation/appkit/nsview/layercontentsplacement",
  "type": "Enumeration",
  "name": "NSView.LayerContentsPlacement",
  "desc": "These constants specify the location of the layer content when the content is not rerendered in response to view resizing. For more information, see the layerContentsPlacement property.",
  "items": [
    {
      "name": "case scaleAxesIndependently",
      "desc": "The content is resized to fit the entire bounds rectangle."
    },
    {
      "name": "case scaleProportionallyToFit",
      "desc": "The content is resized to fit the bounds rectangle, preserving the aspect of the content. If the content does not completely fill the bounds rectangle, the content is centered in the partial axis."
    },
    {
      "name": "case scaleProportionallyToFill",
      "desc": "The content is resized to completely fill the bounds rectangle, while still preserving the aspect of the content. The content is centered in the axis it exceeds."
    },
    {
      "name": "case center",
      "desc": "The content is horizontally and vertically centered in the bounds rectangle."
    },
    {
      "name": "case top",
      "desc": "The content is horizontally centered at the top-edge of the bounds rectangle."
    },
    {
      "name": "case topRight",
      "desc": "The content is positioned in the top-right corner of the bounds rectangle."
    },
    {
      "name": "case right",
      "desc": "The content is vertically centered at the right-edge of the bounds rectangle."
    },
    {
      "name": "case bottomRight",
      "desc": "The content is positioned in the bottom-right corner of the bounds rectangle."
    },
    {
      "name": "case bottom",
      "desc": "The content is horizontally centered at the bottom-edge of the bounds rectangle."
    },
    {
      "name": "case bottomLeft",
      "desc": "The content is positioned in the bottom-left corner of the bounds rectangle."
    },
    {
      "name": "case left",
      "desc": "The content is vertically centered at the left-edge of the bounds rectangle."
    },
    {
      "name": "case topLeft",
      "desc": "The content is positioned in the top-left corner of the bounds rectangle."
    }
  ],
  "declaration": "enum LayerContentsPlacement : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}