{
  "path": "/documentation/apple_news/articlethumbnail",
  "type": "Object",
  "name": "ArticleThumbnail",
  "desc": "The component for displaying a thumbnail image with an article link.",
  "items": [
    {
      "name": "role",
      "desc": "Always article_thumbnail for this component."
    },
    {
      "name": "accessibilityCaption",
      "desc": "A caption that describes the image. The text is used for VoiceOver for iOS, VoiceOver for iPadOS, and VoiceOver for macOS. If accessibilityCaption is not provided, the caption value is used instead."
    },
    {
      "name": "additions",
      "desc": "Ignored for all children of ArticleLink."
    },
    {
      "name": "anchor",
      "desc": "An object that defines vertical alignment with another component."
    },
    {
      "name": "animation",
      "desc": "An object that defines an animation to be applied to the component.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "articleIdentifier",
      "desc": "The identifier of the article that this component displays the thumbnail of. By default the articleIdentifier value is inherited from the parent ArticleLink component."
    },
    {
      "name": "aspectRatio",
      "desc": "The aspect ratio of the component in which the article thumbnail is displayed."
    },
    {
      "name": "behavior",
      "desc": "An object that defines behavior for a component, like Parallax or Springy.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "caption",
      "desc": "A caption that describes the image. The text is seen when the image is in full screen. This text is also used by VoiceOver for iOS, VoiceOver for iPadOS, and VoiceOver for macOS, if accessibilityCaption text is not provided. The caption text does not appear in the main article view. To display a caption in the main article view, use the Caption component."
    },
    {
      "name": "conditional",
      "desc": "An instance or array of component properties that can be applied conditionally, and the conditions that cause them to be applied."
    },
    {
      "name": "explicitContent",
      "desc": "A Boolean that indicates that the image may contain explicit content."
    },
    {
      "name": "fillMode",
      "desc": "A string that indicates how to display the image fill.Valid values:cover (default). Scales the image by aspect ratio to completely fill the component. fit. Scales the image by aspect ratio to fit the component."
    },
    {
      "name": "hidden",
      "desc": "A Boolean that indicates whether the component is hidden."
    },
    {
      "name": "horizontalAlignment",
      "desc": "A string that sets the horizontal alignment of the image fill within its component. Valid values:left. Aligns the left edge of the fill with the left edge of the component. center (default). Aligns the horizontal center of the fill with the center of the component. right. Aligns the right edge of the fill with the right edge of the component. You can use fillMode with horizontalAlignment to achieve the effect you want. For example, set fillMode to fit and horizontalAlignment to left to fit the image based on its aspect ratio and align the left edge of the fill with the left edge of the component. Or set fillMode to cover and horizontalAlignment to right to scale the image horizontally and align the right edge of the fill with the right edge of the component."
    },
    {
      "name": "identifier",
      "desc": "A unique identifier for this component. If used, the identifier must be unique across the entire document. An identifier is required if you want to anchor other components to this component. See Anchor."
    },
    {
      "name": "layout",
      "desc": "An inline ComponentLayout object that contains layout information, or a string reference to a ComponentLayout object that is defined at the top level of the document. If layout is not defined, size and position are based on various factors, such as the device type, the length of the content, and the role of this component."
    },
    {
      "name": "style",
      "desc": "An inline ComponentStyle object that defines the appearance of this component, or a string reference to a ComponentStyle object that is defined at the top level of the document.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "URL",
      "desc": "The URL of an image file.If omitted, the thumbnail of the article referenced in the ArticleLink component is used. Images should be high-resolution so they can be smoothly scaled down. Image URLs can begin with http://, https://, or bundle://. If the image URL begins with bundle://, the image file must be in the same directory as the document.Image filenames should be properly encoded as URLs.  See Preparing Image, Video, Audio, Music, and ARKit Assets."
    },
    {
      "name": "verticalAlignment",
      "desc": "A string that defines the vertical alignment of the article thumbnail within the component."
    }
  ],
  "inheritsFrom": [
    "Component"
  ]
}