{
  "path": "/documentation/coretext/ctfontmanagererror",
  "type": "Enumeration",
  "name": "CTFontManagerError",
  "desc": "Errors that prevent unregistration of fonts for a specified font file URL.",
  "items": [
    {
      "name": "case fileNotFound",
      "desc": "An error that indicates the file doesn't exist at the specified URL."
    },
    {
      "name": "case insufficientPermissions",
      "desc": "An error that indicates insufficient permissions to access the file."
    },
    {
      "name": "case unrecognizedFormat",
      "desc": "An error that indicates the file's format is unrecognized or unsupported."
    },
    {
      "name": "case invalidFontData",
      "desc": "An error that indicates the file contains invalid font data that could cause system problems."
    },
    {
      "name": "case alreadyRegistered",
      "desc": "An error that indicates the file is already registered in the specified scope."
    },
    {
      "name": "case exceededResourceLimit",
      "desc": "An error that indicates an operation failure due to a system limitation."
    },
    {
      "name": "case assetNotFound",
      "desc": "An error that indicates the asset isn't found."
    },
    {
      "name": "case notRegistered",
      "desc": "An error that indicates the file isn't registered in the specified scope."
    },
    {
      "name": "case inUse",
      "desc": "An error that indicates the font file is actively in use and can't be unregistered."
    },
    {
      "name": "case systemRequired",
      "desc": "An error that indicates the file is required by the system and can't be unregistered."
    },
    {
      "name": "case registrationFailed",
      "desc": "An error that indicates the file can't be processed due to an unexpected FontProvider error."
    },
    {
      "name": "case missingEntitlement",
      "desc": "An error that indicates the file can't be processed because the provider doesn't have a necessary entitlement."
    },
    {
      "name": "case insufficientInfo",
      "desc": "An error that indicates the font descriptor doesn't have the necessary information to specify a font file."
    },
    {
      "name": "case cancelledByUser",
      "desc": "An error that indicates the user cancelled the operation."
    },
    {
      "name": "case duplicatedName",
      "desc": "An error that indicates the file can't register because of a duplicate font name."
    },
    {
      "name": "case invalidFilePath",
      "desc": "An error that indicates the file isn't in an allowed location, which must be either in the app's bundle or an on-demand resource."
    },
    {
      "name": "case unsupportedScope",
      "desc": "An error that indicates the specified scope isn't supported."
    }
  ],
  "declaration": "enum CTFontManagerError, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}