{
  "path": "/documentation/coregraphics/cgeventflags",
  "type": "Structure",
  "name": "CGEventFlags",
  "desc": "Constants that indicate the modifier key state at the time an event is created, as well as other event-related states.",
  "items": [
    {
      "name": "static var maskAlphaShift: CGEventFlags",
      "desc": "Indicates that the Caps Lock key is down for a keyboard, mouse, or flag-changed event."
    },
    {
      "name": "static var maskShift: CGEventFlags",
      "desc": "Indicates that the Shift key is down for a keyboard, mouse, or flag-changed event."
    },
    {
      "name": "static var maskControl: CGEventFlags",
      "desc": "Indicates that the Control key is down for a keyboard, mouse, or flag-changed event."
    },
    {
      "name": "static var maskAlternate: CGEventFlags",
      "desc": "Indicates that the Alt or Option key is down for a keyboard, mouse, or flag-changed event."
    },
    {
      "name": "static var maskCommand: CGEventFlags",
      "desc": "Indicates that the Command key is down for a keyboard, mouse, or flag-changed event."
    },
    {
      "name": "static var maskHelp: CGEventFlags",
      "desc": "Indicates that the Help modifier key is down for a keyboard, mouse, or flag-changed event. This key is not present on most keyboards, and is different than the Help key found in the same row as Home and Page Up."
    },
    {
      "name": "static var maskSecondaryFn: CGEventFlags",
      "desc": "Indicates that the Fn (Function) key is down for a keyboard, mouse, or flag-changed event. This key is found primarily on laptop keyboards."
    },
    {
      "name": "static var maskNumericPad: CGEventFlags",
      "desc": "Identifies key events from the numeric keypad area on extended keyboards."
    },
    {
      "name": "static var maskNonCoalesced: CGEventFlags",
      "desc": "Indicates that mouse and pen movement events are not being coalesced."
    },
    {
      "name": "init(rawValue: UInt64)"
    }
  ],
  "declaration": "struct CGEventFlags, @unchecked Sendable",
  "conformsTo": [
    "OptionSet",
    "Sendable"
  ]
}