{
  "path": "/documentation/coreml/mlparameterkey",
  "type": "Class",
  "name": "MLParameterKey",
  "desc": "The keys for the parameter dictionary in a model configuration or a model update context.",
  "items": [
    {
      "name": "func scoped(to: String) -> MLParameterKey",
      "desc": "Creates a copy of a parameter key and adds the scope to it."
    },
    {
      "name": "class var numberOfNeighbors: MLParameterKey",
      "desc": "The key you use to access the number of neighbors that adjusts the affinity of a k-nearest-neighbor model."
    },
    {
      "name": "class var linkedModelFileName: MLParameterKey",
      "desc": "The key you use to access the linked model’s filename."
    },
    {
      "name": "class var linkedModelSearchPath: MLParameterKey",
      "desc": "The key you use to access the linked model’s search path."
    },
    {
      "name": "class var weights: MLParameterKey",
      "desc": "The key you use to access the weights of a layer in a neural network model."
    },
    {
      "name": "class var biases: MLParameterKey",
      "desc": "The key you use to access the biases of a layer in a neural network model."
    },
    {
      "name": "class var learningRate: MLParameterKey",
      "desc": "The key you use to access the optimizer’s learning rate parameter."
    },
    {
      "name": "class var momentum: MLParameterKey",
      "desc": "The key you use to access the stochastic gradient descent (SGD) optimizer’s momentum parameter."
    },
    {
      "name": "class var miniBatchSize: MLParameterKey",
      "desc": "The key you use to access the optimizer’s mini batch-size parameter."
    },
    {
      "name": "class var beta1: MLParameterKey",
      "desc": "The key you use to access the Adam optimizer’s first beta parameter."
    },
    {
      "name": "class var beta2: MLParameterKey",
      "desc": "The key you use to access the Adam optimizer’s second beta parameter."
    },
    {
      "name": "class var eps: MLParameterKey",
      "desc": "The key you use to access the Adam optimizer’s epsilon parameter."
    },
    {
      "name": "class var epochs: MLParameterKey",
      "desc": "The key you use to access the optimizer’s epochs parameter."
    },
    {
      "name": "class var shuffle: MLParameterKey",
      "desc": "The key you use to access the shuffle parameter, a Boolean value that determines whether the model randomizes the data between epochs."
    },
    {
      "name": "class var seed: MLParameterKey",
      "desc": "The key you use to access the seed parameter that initializes the random number generator for the shuffle option."
    }
  ],
  "declaration": "class MLParameterKey : MLKey",
  "inheritsFrom": [
    "MLKey"
  ]
}