{
  "path": "/documentation/apple_news/podcast",
  "type": "Object",
  "name": "Podcast",
  "desc": "The component for adding a Podcast show or episode.",
  "items": [
    {
      "name": "role",
      "desc": "Always podcast for this component."
    },
    {
      "name": "URL",
      "desc": "The URL of the podcast show or episode you want to embed. The show or episode must be available on Apple Podcasts. Note that a user cannot play the show or episode directly in the article. For more information, see Apple Podcasts.The URL determines whether it is a show or an episode. The following is an example of a podcast show link: https://podcasts.apple.com/us/podcast/apple-events/id1473854035The following is an example of a podcast episode link:https://podcasts.apple.com/us/podcast/apple-events/id1473854035?i=1000479125753"
    },
    {
      "name": "anchor",
      "desc": "An object that defines vertical alignment with another component."
    },
    {
      "name": "animation",
      "desc": "An object that defines an animation to apply to the component.The none value is for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "behavior",
      "desc": "An object that defines behavior for a component, like Parallax or Springy.The none value is for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "conditional",
      "desc": "An instance or array of component properties that can be applied conditionally, and the conditions that cause them to be applied."
    },
    {
      "name": "hidden",
      "desc": "A Boolean value that determines whether the component is hidden."
    },
    {
      "name": "identifier",
      "desc": "An optional unique identifier for this component. If used, this identifier must be unique across the entire document. You will need an identifier for your component if you want to anchor other components to it."
    },
    {
      "name": "layout",
      "desc": "An inline ComponentLayout object that contains layout information, or a string reference to a ComponentLayout object that is defined at the top level of the document.If layout is not defined, size and position will be based on various factors, such as the device type, the length of the content, and the role of this component."
    },
    {
      "name": "orientation",
      "desc": "The viewport layout of the component. Valid values:horizontal. Creates a horizontal layout regardless of the viewport width. On screens with viewport width less than 600 points, the artwork and podcast information appear side by side, and the Listen on Apple Podcasts button appears at the bottom. On screens with viewport width greater than 600 points, the Listen on Apple Podcasts button appears below the podcast information.automatic (default).  Automatically switches orientation from vertical to horizontal when the viewport width is 600 points or greater."
    },
    {
      "name": "style",
      "desc": "An inline ComponentStyle object that defines the appearance of this component, or a string reference to a ComponentStyle object that is defined at the top level of the document.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "theme",
      "desc": "The color theme of the component. Valid Values:light. Displays light theme regardless of the device’s color mode.dark. Displays dark theme regardless of the device’s color mode.automatic (default). Switches automatically from light to dark when the user turns on Dark Mode."
    }
  ],
  "inheritsFrom": [
    "Component"
  ]
}