{
  "path": "/documentation/storekittest/skadtestpostback",
  "type": "Class",
  "name": "SKAdTestPostback",
  "desc": "A test postback that contains ad conversion information in the testing environment.",
  "items": [
    {
      "name": "init?(version: SKAdTestPostbackVersion, adNetworkIdentifier: String, adCampaignIdentifier: Int, appStoreItemIdentifier: Int, sourceAppStoreItemIdentifier: Int, conversionValue: Int, fidelityType: Int, isRedownload: Bool, didWin: Bool, postbackURL: String)",
      "desc": "Creates a test postback with the provided postback parameters."
    },
    {
      "name": "var postbackURL: String",
      "desc": "A URL on your server where the testing environment sends test postbacks."
    },
    {
      "name": "var version: NSString",
      "desc": "The SKAdNetwork version that the postback uses."
    },
    {
      "name": "var isRegistered: Bool",
      "desc": "A Boolean value that indicates whether the postback is registered in the testing environment."
    },
    {
      "name": "var adNetworkIdentifier: String",
      "desc": "A string that represents the advertising network’s unique identifier."
    },
    {
      "name": "var transactionIdentifier: String",
      "desc": "A unique transaction identifier that the system generates."
    },
    {
      "name": "var adCampaignIdentifier: Int",
      "desc": "A number that represents the advertising network’s campaign."
    },
    {
      "name": "var appStoreItemIdentifier: Int",
      "desc": "The item identifier of the app that this ad impression advertises."
    },
    {
      "name": "var sourceAppStoreItemIdentifier: Int",
      "desc": "The item identifier of the app that displays the ad."
    },
    {
      "name": "var isRedownload: Bool",
      "desc": "A Boolean value that indicates whether the user redownloaded and reinstalled the app."
    },
    {
      "name": "var fidelityType: Int",
      "desc": "An integer that indicates the type of ad impression, StoreKit-rendered or view-through."
    },
    {
      "name": "var conversionValue: Int",
      "desc": "An unsigned 6-bit value that the app or ad network control."
    },
    {
      "name": "var didWin: Bool",
      "desc": "A Boolean value that indicates whether the postback won the attribution."
    }
  ],
  "declaration": "class SKAdTestPostback : NSObject",
  "inheritsFrom": [
    "NSObject"
  ]
}