{
  "path": "/documentation/apple_news/componentstyle",
  "type": "Object",
  "name": "ComponentStyle",
  "desc": "The object for setting style properties for components, including background color and fill, borders, and table styles.",
  "items": [
    {
      "name": "conditional",
      "desc": "An instance or array of component style properties that are applied conditionally, and the conditions that cause them to be applied."
    },
    {
      "name": "backgroundColor",
      "desc": "The component's background color. The value defaults to transparent. The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "border",
      "desc": "The border for the component. Because the border is drawn inside the component, it affects the size of the content within the component. The bigger the border, the less available space for content.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "fill",
      "desc": "A Fill object, such as an ImageFill, that will be applied on top of the specified backgroundColor. By default, no fill is applied.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "mask",
      "desc": "The object that defines a mask that clips the contents of the component to the specified masking behavior.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "opacity",
      "desc": "The opacity of the component, set as a float value between 0 (completely transparent) and 1 (completely opaque). The effects of the component’s opacity are inherited by any child components. See Nesting Components in an Article."
    },
    {
      "name": "tableStyle",
      "desc": "The styling for the rows, columns, and cells of the component, if it is a DataTable or HTMLTable component.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "shadow",
      "desc": "The object that defines a component shadow."
    }
  ]
}