{
  "path": "/documentation/foundation/nsvalue",
  "type": "Class",
  "name": "NSValue",
  "desc": "A simple container for a single C or Objective-C data item.",
  "items": [
    {
      "name": "init(bytes: UnsafeRawPointer, objCType: UnsafePointer<CChar>)",
      "desc": "Initializes a value object to contain the specified value, interpreted with the specified Objective-C type."
    },
    {
      "name": "init(UnsafeRawPointer, withObjCType: UnsafePointer<CChar>)",
      "desc": "Creates a value object containing the specified value, interpreted with the specified Objective-C type."
    },
    {
      "name": "var objCType: UnsafePointer<CChar>",
      "desc": "A C string containing the Objective-C type of the data contained in the value object."
    },
    {
      "name": "init(pointer: UnsafeRawPointer?)",
      "desc": "Creates a value object containing the specified pointer."
    },
    {
      "name": "init(nonretainedObject: Any?)",
      "desc": "Creates a value object containing the specified object."
    },
    {
      "name": "var pointerValue: UnsafeMutableRawPointer?",
      "desc": "Returns the value as an untyped pointer."
    },
    {
      "name": "var nonretainedObjectValue: Any?",
      "desc": "The value as a non-retained pointer to an object."
    },
    {
      "name": "init(range: NSRange)",
      "desc": "Creates a new value object containing the specified Foundation range structure."
    },
    {
      "name": "var rangeValue: NSRange",
      "desc": "The Foundation range structure representation of the value."
    },
    {
      "name": "init(point: NSPoint)",
      "desc": "Creates a new value object containing the specified Foundation point structure."
    },
    {
      "name": "init(size: NSSize)",
      "desc": "Creates a new value object containing the specified Foundation size structure."
    },
    {
      "name": "init(rect: NSRect)",
      "desc": "Creates a new value object containing the specified Foundation rectangle structure."
    },
    {
      "name": "var pointValue: NSPoint",
      "desc": "The Foundation point structure representation of the value."
    },
    {
      "name": "var sizeValue: NSSize",
      "desc": "The Foundation size structure representation of the value."
    },
    {
      "name": "var rectValue: NSRect",
      "desc": "The Foundation rectangle structure representation of the value."
    },
    {
      "name": "init(cgPoint: CGPoint)",
      "desc": "Creates a new value object containing the specified CoreGraphics point structure."
    },
    {
      "name": "init(cgVector: CGVector)",
      "desc": "Creates a new value object containing the specified CoreGraphics vector structure."
    },
    {
      "name": "init(cgSize: CGSize)",
      "desc": "Creates a new value object containing the specified CoreGraphics size structure."
    },
    {
      "name": "init(cgRect: CGRect)",
      "desc": "Creates a new value object containing the specified CoreGraphics rectangle structure."
    },
    {
      "name": "init(cgAffineTransform: CGAffineTransform)",
      "desc": "Creates a new value object containing the specified CoreGraphics affine transform structure."
    },
    {
      "name": "var cgPointValue: CGPoint",
      "desc": "Returns the CoreGraphics point structure representation of the value."
    },
    {
      "name": "var cgVectorValue: CGVector",
      "desc": "Returns the CoreGraphics vector structure representation of the value."
    },
    {
      "name": "var cgSizeValue: CGSize",
      "desc": "Returns the CoreGraphics size structure representation of the value."
    },
    {
      "name": "var cgRectValue: CGRect",
      "desc": "Returns the CoreGraphics rectangle structure representation of the value."
    },
    {
      "name": "var cgAffineTransformValue: CGAffineTransform",
      "desc": "Returns the CoreGraphics affine transform representation of the value."
    },
    {
      "name": "init(uiEdgeInsets: UIEdgeInsets)",
      "desc": "Creates a new value object containing the specified UIKit edge insets structure."
    },
    {
      "name": "init(uiOffset: UIOffset)",
      "desc": "Creates a new value object containing the specified UIKit offset structure."
    },
    {
      "name": "var uiEdgeInsetsValue: UIEdgeInsets",
      "desc": "Returns the UIKit edge insets structure representation of the value."
    },
    {
      "name": "var uiOffsetValue: UIOffset",
      "desc": "Returns the UIKit offset structure representation of the value."
    },
    {
      "name": "init(caTransform3D: CATransform3D)",
      "desc": "Creates a new value object containing the specified CoreAnimation transform structure."
    },
    {
      "name": "var caTransform3DValue: CATransform3D",
      "desc": "The CoreAnimation transform structure representation of the value."
    },
    {
      "name": "init(time: CMTime)",
      "desc": "Creates a new value object containing the specified CoreMedia time structure."
    },
    {
      "name": "init(timeRange: CMTimeRange)",
      "desc": "Creates a new value object containing the specified CoreMedia time range structure."
    },
    {
      "name": "init(timeMapping: CMTimeMapping)",
      "desc": "Creates a new value object containing the specified CoreMedia time mapping structure."
    },
    {
      "name": "var timeValue: CMTime",
      "desc": "The CoreMedia time structure representation of the value."
    },
    {
      "name": "var timeRangeValue: CMTimeRange",
      "desc": "The CoreMedia time range structure representation of the value."
    },
    {
      "name": "var timeMappingValue: CMTimeMapping",
      "desc": "The CoreMedia time mapping structure representation of the value."
    },
    {
      "name": "init(mkCoordinate: CLLocationCoordinate2D)",
      "desc": "Creates a new value object containing the specified CoreLocation geographic coordinate structure."
    },
    {
      "name": "init(mkCoordinateSpan: MKCoordinateSpan)",
      "desc": "Creates a new value object containing the specified MapKit coordinate span structure."
    },
    {
      "name": "var mkCoordinateValue: CLLocationCoordinate2D",
      "desc": "The CoreLocation geographic coordinate structure representation of the value."
    },
    {
      "name": "var mkCoordinateSpanValue: MKCoordinateSpan",
      "desc": "The MapKit coordinate span structure representation of the value."
    },
    {
      "name": "init(scnVector3: SCNVector3)",
      "desc": "Creates a value object that contains the specified three-element SceneKit vector."
    },
    {
      "name": "init(scnVector4: SCNVector4)",
      "desc": "Creates a value object that contains the specified four-element SceneKit vector."
    },
    {
      "name": "init(scnMatrix4: SCNMatrix4)",
      "desc": "Creates a value object that contains the specified SceneKit 4 x 4 matrix."
    },
    {
      "name": "var scnVector3Value: SCNVector3",
      "desc": "The three-element Scene Kit vector representation of the value."
    },
    {
      "name": "var scnVector4Value: SCNVector4",
      "desc": "The four-element Scene Kit vector representation of the value."
    },
    {
      "name": "var scnMatrix4Value: SCNMatrix4",
      "desc": "The Scene Kit 4 x 4 matrix representation of the value."
    },
    {
      "name": "func isEqual(to: NSValue) -> Bool",
      "desc": "Returns a Boolean value that indicates whether the value object and another value object are equal."
    },
    {
      "name": "init?(coder: NSCoder)"
    },
    {
      "name": "init(directionalEdgeInsets: NSDirectionalEdgeInsets)"
    },
    {
      "name": "init(edgeInsets: NSEdgeInsets)"
    },
    {
      "name": "var directionalEdgeInsetsValue: NSDirectionalEdgeInsets"
    },
    {
      "name": "var edgeInsetsValue: NSEdgeInsets"
    },
    {
      "name": "func getValue(UnsafeMutableRawPointer, size: Int)"
    },
    {
      "name": "func value<StoredType>(of: StoredType.Type) -> StoredType?"
    }
  ],
  "declaration": "class NSValue : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCopying",
    "NSSecureCoding"
  ]
}