{
  "path": "/documentation/scenekit/scnmaterialproperty",
  "type": "Class",
  "name": "SCNMaterialProperty",
  "desc": "A container for the color or texture of one of a material’s visual properties.",
  "items": [
    {
      "name": "init(contents: Any)",
      "desc": "Creates a new material property object with the specified contents."
    },
    {
      "name": "var contents: Any?",
      "desc": "The visual contents of the material property—a color, image, or source of animated content. Animatable."
    },
    {
      "name": "var intensity: CGFloat",
      "desc": "A number between 0.0 and 1.0 that modulates the effect of the material property. Animatable."
    },
    {
      "name": "var contentsTransform: SCNMatrix4",
      "desc": "The transformation applied to the material property’s visual contents. Animatable."
    },
    {
      "name": "var wrapS: SCNWrapMode",
      "desc": "The wrapping behavior for the S texture coordinate."
    },
    {
      "name": "var wrapT: SCNWrapMode",
      "desc": "The wrapping behavior for the T texture coordinate."
    },
    {
      "name": "enum SCNWrapMode",
      "desc": "Modes to apply to texture wrapping, used by the wrapT and wrapS properties."
    },
    {
      "name": "var minificationFilter: SCNFilterMode",
      "desc": "Texture filtering for rendering the material property’s image contents at a size smaller than that of the original image."
    },
    {
      "name": "var magnificationFilter: SCNFilterMode",
      "desc": "Texture filtering for rendering the material property’s image contents at a size larger than that of the original image."
    },
    {
      "name": "var mipFilter: SCNFilterMode",
      "desc": "Texture filtering for using mipmaps to render the material property’s image contents at a size smaller than that of the original image."
    },
    {
      "name": "enum SCNFilterMode",
      "desc": "Texture filtering modes, used by the minificationFilter, magnificationFilter, and mipFilter properties."
    },
    {
      "name": "var maxAnisotropy: CGFloat",
      "desc": "The amount of anisotropic texture filtering to be used when rendering the material property’s image contents."
    },
    {
      "name": "var mappingChannel: Int",
      "desc": "The source of texture coordinates for mapping the material property’s image contents."
    },
    {
      "name": "var textureComponents: SCNColorMask"
    }
  ],
  "declaration": "class SCNMaterialProperty : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSSecureCoding",
    "SCNAnimatable"
  ]
}