{
  "path": "/documentation/modelio/mdllighttype",
  "type": "Enumeration",
  "name": "MDLLightType",
  "desc": "Options for the shape and style of illumination provided by a light, used by the lightType property.",
  "items": [
    {
      "name": "case unknown",
      "desc": "The type of the light is unknown or has not been initialized."
    },
    {
      "name": "case ambient",
      "desc": "The light source should illuminate a scene evenly regardless of position or direction."
    },
    {
      "name": "case directional",
      "desc": "The light source illuminates a scene from a uniform direction regardless of its position."
    },
    {
      "name": "case spot",
      "desc": "The light source illuminates a scene from a specific position and direction."
    },
    {
      "name": "case point",
      "desc": "The light source illuminates a scene in all directions from a specific position."
    },
    {
      "name": "case linear",
      "desc": "The light source illuminates a scene in all directions from an area in the shape of a line."
    },
    {
      "name": "case discArea",
      "desc": "The light source illuminates a scene in all directions from an area in the shape of a disc."
    },
    {
      "name": "case rectangularArea",
      "desc": "The light source illuminates a scene in all directions from an area in the shape of a rectangle."
    },
    {
      "name": "case superElliptical",
      "desc": "The light source illuminates a scene in all directions from an area in the shape of a superellipse."
    },
    {
      "name": "case photometric",
      "desc": "The illumination from the light is determined by a photometric profile."
    },
    {
      "name": "case probe",
      "desc": "The illumination from the light is determined by texture images representing a sample of a scene at a specific point."
    },
    {
      "name": "case environment",
      "desc": "The illumination from the light is determined by texture images representing a sample of the surrounding environment for a scene."
    }
  ],
  "declaration": "enum MDLLightType : UInt, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}