{
  "path": "/documentation/appstoreconnectapi/appencryptiondeclaration/attributes",
  "type": "Object",
  "name": "AppEncryptionDeclaration.Attributes",
  "desc": "Attributes that describe an App Encryption Declarations resource.",
  "items": [
    {
      "name": "availableOnFrenchStore",
      "desc": "A Boolean value that indicates the intent to distribute your app on the French App Store."
    },
    {
      "name": "codeValue",
      "desc": "A unique identifier that can be added to your app to associate it with a given declaration."
    },
    {
      "name": "containsProprietaryCryptography",
      "desc": "A Boolean value that indicates your app implements any proprietary encryption algorithms."
    },
    {
      "name": "containsThirdPartyCryptography",
      "desc": "A Boolean value that indicates your app implements any standard encryption algorithms instead of, or in addition to, using or accessing the encryption in Apple’s operating systems."
    },
    {
      "name": "documentName",
      "desc": "The document name of your submitted export compliance documentation."
    },
    {
      "name": "documentType",
      "desc": "The file type of your submitted export compliance documentation."
    },
    {
      "name": "documentUrl",
      "desc": "The URL to the file of your submitted export compliance documentation."
    },
    {
      "name": "exempt",
      "desc": "A Boolean value that indicates your app is exempt based on your use of encryption and the app's availability."
    },
    {
      "name": "platform",
      "desc": "The platform of the declaration."
    },
    {
      "name": "usesEncryption",
      "desc": "A Boolean value that indicates whether your app uses, contains, or incorporates cryptography."
    },
    {
      "name": "appEncryptionDeclarationState",
      "desc": "The approval state of your export compliance documentation."
    },
    {
      "name": "uploadedDate",
      "desc": "The date and time you submitted your declaration."
    }
  ]
}