{
  "path": "/documentation/quartzcore/cavaluefunctionname",
  "type": "Structure",
  "name": "CAValueFunctionName",
  "desc": "No overview available.",
  "items": [
    {
      "name": "init(rawValue: String)"
    },
    {
      "name": "static let rotateX: CAValueFunctionName",
      "desc": "A value function that rotates by the input value, in radians, around the x-axis. This value function expects a single input value."
    },
    {
      "name": "static let rotateY: CAValueFunctionName",
      "desc": "A value function that rotates by the input value, in radians, around the y-axis. This value function expects a single input value."
    },
    {
      "name": "static let rotateZ: CAValueFunctionName",
      "desc": "A value function that rotates by the input value, in radians, around the z-axis. This value function expects a single input value."
    },
    {
      "name": "static let scale: CAValueFunctionName",
      "desc": "A value function scales by the input value along all three axis. Animations using this value transform function must provide animation values in an NSArray of three NSNumber instances that specify the (x, y, z) scale values."
    },
    {
      "name": "static let scaleX: CAValueFunctionName",
      "desc": "A value function scales by the input value along the x-axis. Animations referencing this value transform function must provide a single animation value."
    },
    {
      "name": "static let scaleY: CAValueFunctionName",
      "desc": "A value function scales by the input value along the y-axis. Animations referencing this value function must provide a single animation value."
    },
    {
      "name": "static let scaleZ: CAValueFunctionName",
      "desc": "A value function that scales by the input value along the z-axis. Animations referencing this value function must provide a single animation value."
    },
    {
      "name": "static let translate: CAValueFunctionName",
      "desc": "A value function that translates by the input values along all three axis. Animations using this value transform function must provide animation values in an NSArray of three NSNumber instances that specify the (x, y, z) translate values."
    },
    {
      "name": "static let translateX: CAValueFunctionName",
      "desc": "A value function translates by the input value along the x-axis. Animations referencing this value function must provide a single input value."
    },
    {
      "name": "static let translateY: CAValueFunctionName",
      "desc": "A value function translates by the input value along the y-axis. Animations referencing this value function must provide a single input value."
    },
    {
      "name": "static let translateZ: CAValueFunctionName",
      "desc": "A value function translates by the input value along the z-axis. Animations referencing this value function must provide a single input value."
    }
  ],
  "declaration": "struct CAValueFunctionName, @unchecked Sendable",
  "conformsTo": [
    "Equatable",
    "Hashable",
    "RawRepresentable",
    "Sendable"
  ]
}