{
  "path": "/documentation/accelerate/vimage/error",
  "type": "Enumeration",
  "name": "vImage.Error",
  "desc": "An error that occurs during a vImage operation.",
  "items": [
    {
      "name": "case bufferSizeMismatch",
      "desc": "An error indicating that the function requires the source and destination buffers to have the same size, but they don’t."
    },
    {
      "name": "case colorSyncIsAbsent",
      "desc": "An error indicating that the ColorSync framework is missing."
    },
    {
      "name": "case coreVideoIsAbsent",
      "desc": "An error indicating that the Core Video framework is missing."
    },
    {
      "name": "case internalError",
      "desc": "A serious error occurred inside vImage, which prevented vImage from continuing."
    },
    {
      "name": "case invalidCVImageFormat",
      "desc": "An error indicating that a Core Video format is invalid."
    },
    {
      "name": "case invalidEdgeStyle",
      "desc": "An error indicating that the specified edge style is invalid."
    },
    {
      "name": "case invalidImageFormat",
      "desc": "An error indicating that a specified Core Graphics or Core Video format is invalid."
    },
    {
      "name": "case invalidImageObject",
      "desc": "An error indicating that a specified Core Graphics image or Core Video pixel buffer is invalid."
    },
    {
      "name": "case invalidKernelSize",
      "desc": "An error indicating that either the kernel height, the kernel width, or both, are even."
    },
    {
      "name": "case invalidOffset_X",
      "desc": "An error indicating that the parameter that specifies the left edge of the region of interest is greater than the width of the source image."
    },
    {
      "name": "case invalidOffset_Y",
      "desc": "An error indicating that the parameter that specifies the top edge of the region of interest is greater than the height of the source image."
    },
    {
      "name": "case invalidParameter",
      "desc": "An error indicating that a function parameter has an invalid value."
    },
    {
      "name": "case invalidRowBytes",
      "desc": "An error indicating that the buffer’s row bytes field is invalid."
    },
    {
      "name": "case memoryAllocationError",
      "desc": "An error indicating that an attempt to allocate memory failed."
    },
    {
      "name": "case noError",
      "desc": "The vImage function completed without error."
    },
    {
      "name": "case nullPointerArgument",
      "desc": "An error indicating that a pointer parameter is NULL and it must not be."
    },
    {
      "name": "case outOfPlaceOperationRequired",
      "desc": "An error indicating that the source images and destination images alias the same image data, but must not."
    },
    {
      "name": "case roiLargerThanInputBuffer",
      "desc": "An error indicating that the region of interest extends beyond the bottom edge or right edge of the source buffer."
    },
    {
      "name": "case unknownFlagsBit",
      "desc": "An error indicating that a bit in the flags field isn’t supported."
    },
    {
      "name": "case unsupportedConversion",
      "desc": "An error indicating that the requested conversion isn’t supported."
    },
    {
      "name": "typealias vImage.Error.RawValue"
    },
    {
      "name": "init?(rawValue: Int)"
    },
    {
      "name": "init(vImageError: vImage_Error)"
    },
    {
      "name": "var hashValue: Int"
    },
    {
      "name": "var localizedDescription: String"
    },
    {
      "name": "var rawValue: Int"
    },
    {
      "name": "func hash(into: inout Hasher)"
    },
    {
      "name": "static func != (vImage.Error, vImage.Error) -> Bool"
    }
  ],
  "declaration": "enum Error : Int, Error",
  "conformsTo": [
    "Error"
  ]
}