{
  "path": "/documentation/photokit/phassetcollectionsubtype",
  "type": "Enumeration",
  "name": "PHAssetCollectionSubtype",
  "desc": "Minor distinctions between kinds of asset collections, used by the assetCollectionSubtype property and the fetchAssetCollections(with:subtype:options:) method.",
  "items": [
    {
      "name": "case albumRegular",
      "desc": "An album created in the Photos app."
    },
    {
      "name": "case albumSyncedEvent",
      "desc": "An Event synced to the device from iPhoto."
    },
    {
      "name": "case albumSyncedFaces",
      "desc": "A Faces group synced to the device from iPhoto."
    },
    {
      "name": "case albumSyncedAlbum",
      "desc": "An album synced to the device from iPhoto."
    },
    {
      "name": "case albumImported",
      "desc": "An album imported from a camera or external storage."
    },
    {
      "name": "case albumMyPhotoStream",
      "desc": "The user’s personal iCloud Photo Stream."
    },
    {
      "name": "case albumCloudShared",
      "desc": "An iCloud Shared Photo Stream."
    },
    {
      "name": "case smartAlbumGeneric",
      "desc": "A smart album of no more specific subtype."
    },
    {
      "name": "case smartAlbumRAW",
      "desc": "A smart album that groups all RAW assets in the photo library."
    },
    {
      "name": "case smartAlbumPanoramas",
      "desc": "A smart album that groups all panorama photos in the photo library."
    },
    {
      "name": "case smartAlbumVideos",
      "desc": "A smart album that groups all video assets in the photo library."
    },
    {
      "name": "case smartAlbumFavorites",
      "desc": "A smart album that groups all assets that the user has marked as favorites."
    },
    {
      "name": "case smartAlbumTimelapses",
      "desc": "A smart album that groups all time-lapse videos in the photo library."
    },
    {
      "name": "case smartAlbumAllHidden",
      "desc": "A smart album that groups all assets hidden from the Moments view in the Photos app."
    },
    {
      "name": "case smartAlbumRecentlyAdded",
      "desc": "A smart album that groups assets that were recently added to the photo library."
    },
    {
      "name": "case smartAlbumBursts",
      "desc": "A smart album that groups all burst photo sequences in the photo library."
    },
    {
      "name": "case smartAlbumSlomoVideos",
      "desc": "A smart album that groups all Slow-Mo videos in the photo library."
    },
    {
      "name": "case smartAlbumUserLibrary",
      "desc": "A smart album that groups all assets that originate in the user’s own library (as opposed to assets from iCloud Shared Albums)."
    },
    {
      "name": "case smartAlbumSelfPortraits",
      "desc": "A smart album that groups all photos and videos captured using the device’s front-facing camera."
    },
    {
      "name": "case smartAlbumScreenshots",
      "desc": "A smart album that groups all images captured using the device’s screenshot function."
    },
    {
      "name": "case smartAlbumDepthEffect",
      "desc": "A smart album that groups all images captured using the Depth Effect camera mode on compatible devices."
    },
    {
      "name": "case smartAlbumLivePhotos",
      "desc": "A smart album that groups all Live Photo assets."
    },
    {
      "name": "case smartAlbumAnimated",
      "desc": "A smart album that groups all image animation assets."
    },
    {
      "name": "case smartAlbumLongExposures",
      "desc": "A smart album that groups all Live Photo assets where the Long Exposure variation is enabled."
    },
    {
      "name": "case smartAlbumUnableToUpload",
      "desc": "A smart album that groups all assets that the system can’t upload to iCloud."
    },
    {
      "name": "case any",
      "desc": "A bit mask representing all possible subtypes."
    }
  ],
  "declaration": "enum PHAssetCollectionSubtype : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}