{
  "path": "/documentation/avfaudio/avaudiosession/errorcode",
  "type": "Enumeration",
  "name": "AVAudioSession.ErrorCode",
  "desc": "Codes that describe error conditions that may occur when performing audio session operations.",
  "items": [
    {
      "name": "case none",
      "desc": "An error code that indicates the operation succeeded."
    },
    {
      "name": "case mediaServicesFailed",
      "desc": "An error code that indictates an attempt to use the audio session during or after a Media Services failure."
    },
    {
      "name": "case isBusy",
      "desc": "An error code that indicates an attempt to deactivate the audio session while it’s still playing or recording."
    },
    {
      "name": "case incompatibleCategory",
      "desc": "An error code that indicates an attempt to perform an operation that the current audio session category doesn’t support."
    },
    {
      "name": "case cannotInterruptOthers",
      "desc": "An error code that indictates an attempt to make a nonmixable audio session active while the app was in the background."
    },
    {
      "name": "case missingEntitlement",
      "desc": "An error code that indicates an attempt to perform an operation for which the app doesn’t have the required entitlements."
    },
    {
      "name": "case siriIsRecording",
      "desc": "An error code that indicates an attempt to perform an operation that isn’t allowed while Siri is recording."
    },
    {
      "name": "case cannotStartPlaying",
      "desc": "An error code that indicates an attempt to start audio playback when it wasn’t allowed."
    },
    {
      "name": "case cannotStartRecording",
      "desc": "An error code that indicates an attempt to start audio recording, but the operation failed."
    },
    {
      "name": "case badParam",
      "desc": "An error code that indicates an attempt to set a property to an illegal value."
    },
    {
      "name": "case resourceNotAvailable",
      "desc": "An error code that indicates that an operation failed because the device doesn’t have sufficient hardware resources to complete the action."
    },
    {
      "name": "case unspecified",
      "desc": "An error code that indicates an unspecified error occurred."
    },
    {
      "name": "case expiredSession",
      "desc": "An error code that indicates that an operation failed because the system deallocated the associated session."
    },
    {
      "name": "case sessionNotActive",
      "desc": "An error code that indicates the operation failed because the session isn’t active."
    }
  ],
  "declaration": "enum ErrorCode, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}