{
  "path": "/documentation/uikit/uitabbar",
  "type": "Class",
  "name": "UITabBar",
  "desc": "A control that displays one or more buttons in a tab bar for selecting between different subtasks, views, or modes in an app.",
  "items": [
    {
      "name": "var delegate: UITabBarDelegate?",
      "desc": "The tab bar’s delegate object."
    },
    {
      "name": "protocol UITabBarDelegate",
      "desc": "The UITabBarDelegate protocol defines optional methods for a delegate of a UITabBar object. The UITabBar class provides the ability for the user to reorder, remove, and add items to the tab bar; this process is referred to as customizing the tab bar. The tab bar delegate receives messages when customizing occurs."
    },
    {
      "name": "var items: [UITabBarItem]?",
      "desc": "The items displayed by the tab bar."
    },
    {
      "name": "func setItems([UITabBarItem]?, animated: Bool)",
      "desc": "Sets the items on the tab bar, optionally animating any changes into position."
    },
    {
      "name": "var selectedItem: UITabBarItem?",
      "desc": "The currently selected item on the tab bar."
    },
    {
      "name": "var standardAppearance: UITabBarAppearance",
      "desc": "The appearance settings for a standard-height tab bar."
    },
    {
      "name": "var scrollEdgeAppearance: UITabBarAppearance?",
      "desc": "The appearance settings for the tab bar when the edge of scrollable content aligns with the edge of the tab bar."
    },
    {
      "name": "var leadingAccessoryView: UIView",
      "desc": "The view at the leading edge of a tab bar on tvOS."
    },
    {
      "name": "var trailingAccessoryView: UIView",
      "desc": "The view at the trailing edge of a tab bar on tvOS."
    },
    {
      "name": "var isTranslucent: Bool",
      "desc": "A Boolean value that indicates whether the tab bar is translucent."
    },
    {
      "name": "func beginCustomizingItems([UITabBarItem])",
      "desc": "Presents a standard interface that lets the user customize the contents of the tab bar."
    },
    {
      "name": "func endCustomizing(animated: Bool) -> Bool",
      "desc": "Dismisses the standard interface used to customize the tab bar."
    },
    {
      "name": "var isCustomizing: Bool",
      "desc": "A Boolean value indicating whether the user is currently customizing the tab bar."
    }
  ],
  "declaration": "@MainActor class UITabBar : UIView",
  "inheritsFrom": [
    "UIView"
  ],
  "conformsTo": [
    "UISpringLoadedInteractionSupporting"
  ]
}