{
  "path": "/documentation/applemusicapi/albums/attributes",
  "type": "Object",
  "name": "Albums.Attributes",
  "desc": "The attributes for an album resource.",
  "items": [
    {
      "name": "artistName",
      "desc": "The name of the primary artist associated with the album."
    },
    {
      "name": "artistUrl",
      "desc": "(Extended) The url of the artist for this content."
    },
    {
      "name": "artwork",
      "desc": "The artwork for the album."
    },
    {
      "name": "contentRating",
      "desc": "The Recording Industry Association of America (RIAA) rating of the content. The possible values for this rating are clean and explicit. No value means no rating."
    },
    {
      "name": "copyright",
      "desc": "The copyright text."
    },
    {
      "name": "editorialNotes",
      "desc": "The notes about the album that appear in the iTunes Store."
    },
    {
      "name": "genreNames",
      "desc": "The names of the genres associated with this album."
    },
    {
      "name": "isCompilation",
      "desc": "Indicates if the album is marked as a compilation. If true, the album is a compilation; otherwise, it is not."
    },
    {
      "name": "isComplete",
      "desc": "Indicates whether the album is complete. If true, the album is complete; otherwise, it is not. An album is complete if it contains all its tracks and songs."
    },
    {
      "name": "isMasteredForItunes",
      "desc": "Indicates whether the response delivered the album as an Apple Digital Master."
    },
    {
      "name": "isSingle",
      "desc": "Indicates whether the album contains a single song."
    },
    {
      "name": "name",
      "desc": "The localized name of the album."
    },
    {
      "name": "playParams",
      "desc": "The parameters to use to play back the tracks of the album."
    },
    {
      "name": "recordLabel",
      "desc": "The name of the record label for the album."
    },
    {
      "name": "releaseDate",
      "desc": "The release date of the album, when known, in YYYY-MM-DD or YYYY format. Pre-release content may have an expected release date in the future."
    },
    {
      "name": "trackCount",
      "desc": "The number of tracks."
    },
    {
      "name": "upc",
      "desc": "The Universal Product Code for the album."
    },
    {
      "name": "url",
      "desc": "The URL for sharing the album in Apple Music."
    }
  ]
}