{
  "path": "/documentation/foundation/nsmutablecharacterset",
  "type": "Class",
  "name": "NSMutableCharacterSet",
  "desc": "An object representing a mutable set of Unicode character values that bridges to CharacterSet; use NSMutableCharacterSet when you need reference semantics or other Foundation-specific behavior.",
  "items": [
    {
      "name": "class func alphanumeric() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Categories L*, M*, and N*."
    },
    {
      "name": "class func capitalizedLetter() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category Lt."
    },
    {
      "name": "class func control() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category Cc and Cf."
    },
    {
      "name": "class func decimalDigit() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in the category of decimal numbers."
    },
    {
      "name": "class func decomposable() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing individual Unicode characters that can also be represented as composed character sequences (such as for letters with accents), by the definition of “standard decomposition” in version 3.2 of the Unicode character encoding standard."
    },
    {
      "name": "class func illegal() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing values in the category of Non-Characters or that have not yet been defined in version 3.2 of the Unicode standard."
    },
    {
      "name": "class func letter() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category L* & M*."
    },
    {
      "name": "class func lowercaseLetter() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category Ll."
    },
    {
      "name": "class func newline() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the newline characters (U+000A ~ U+000D, U+0085, U+2028, and U+2029)."
    },
    {
      "name": "class func nonBase() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category M*."
    },
    {
      "name": "class func punctuation() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category P*."
    },
    {
      "name": "class func symbol() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category S*."
    },
    {
      "name": "class func uppercaseLetter() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category Lu and Lt."
    },
    {
      "name": "class func whitespaceAndNewline() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing characters in Unicode General Category Z*, U+000A ~ U+000D, and U+0085."
    },
    {
      "name": "class func whitespace() -> NSMutableCharacterSet",
      "desc": "Returns a character set containing the characters in Unicode General Category Zs and CHARACTER TABULATION (U+0009)."
    },
    {
      "name": "init(charactersIn: String)",
      "desc": "Returns a character set containing the characters in a given string."
    },
    {
      "name": "init(range: NSRange)",
      "desc": "Returns a character set containing characters with Unicode values in a given range."
    },
    {
      "name": "init(bitmapRepresentation: Data)",
      "desc": "Returns a character set containing characters determined by a given bitmap representation."
    },
    {
      "name": "init?(contentsOfFile: String)",
      "desc": "Returns a character set read from the bitmap representation stored in the file a given path."
    },
    {
      "name": "func addCharacters(in: NSRange)",
      "desc": "Adds to the receiver the characters whose Unicode values are in a given range."
    },
    {
      "name": "func removeCharacters(in: NSRange)",
      "desc": "Removes from the receiver the characters whose Unicode values are in a given range."
    },
    {
      "name": "func addCharacters(in: String)",
      "desc": "Adds to the receiver the characters in a given string."
    },
    {
      "name": "func removeCharacters(in: String)",
      "desc": "Removes from the receiver the characters in a given string."
    },
    {
      "name": "func formIntersection(with: CharacterSet)",
      "desc": "Modifies the receiver so it contains only characters that exist in both the receiver and another set."
    },
    {
      "name": "func formUnion(with: CharacterSet)",
      "desc": "Modifies the receiver so it contains all characters that exist in either the receiver or another set."
    },
    {
      "name": "func invert()",
      "desc": "Replaces all the characters in the receiver with all the characters it didn’t previously contain."
    }
  ],
  "declaration": "class NSMutableCharacterSet : NSCharacterSet",
  "inheritsFrom": [
    "NSCharacterSet"
  ],
  "conformsTo": [
    "NSCopying",
    "NSMutableCopying",
    "NSSecureCoding"
  ]
}