{
  "path": "/documentation/avfoundation/avcaptureresolvedphotosettings",
  "type": "Class",
  "name": "AVCaptureResolvedPhotoSettings",
  "desc": "A description of the features and settings in use for an in-progress or complete photo capture request.",
  "items": [
    {
      "name": "var uniqueID: Int64",
      "desc": "The unique identifier for the photo capture this settings object corresponds to."
    },
    {
      "name": "var expectedPhotoCount: Int",
      "desc": "The number of photo capture results in the capture request."
    },
    {
      "name": "var isFlashEnabled: Bool",
      "desc": "A Boolean value indicating whether the camera flash fires for this capture."
    },
    {
      "name": "var isRedEyeReductionEnabled: Bool",
      "desc": "A Boolean value indicating whether the camera automatically reduces red-eye when capturing photos."
    },
    {
      "name": "var isVirtualDeviceFusionEnabled: Bool",
      "desc": "A Boolean value that specifies whether the system automatically uses virtual device image fusion."
    },
    {
      "name": "var isContentAwareDistortionCorrectionEnabled: Bool",
      "desc": "A Boolean value that indicates whether the system applies content-aware distortion correction when capturing the photo."
    },
    {
      "name": "var photoDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the photo image (in a processed format, such as JPEG) that the capture delivers."
    },
    {
      "name": "var rawPhotoDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the RAW-format photo image that the capture delivers."
    },
    {
      "name": "var previewDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the preview image that the system delivers with the capture."
    },
    {
      "name": "var embeddedThumbnailDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the thumbnail image that the capture delivers."
    },
    {
      "name": "var rawEmbeddedThumbnailDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the RAW-format embedded thumbnail image that the capture delivers."
    },
    {
      "name": "var livePhotoMovieDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the Live Photo movie content that the capture delivers."
    },
    {
      "name": "var portraitEffectsMatteDimensions: CMVideoDimensions",
      "desc": "The size, in pixels, of the portrait effects matte that the capture delivers."
    },
    {
      "name": "func dimensionsForSemanticSegmentationMatte(ofType: AVSemanticSegmentationMatte.MatteType) -> CMVideoDimensions",
      "desc": "Retrieves the resolved dimensions of the semantic segmentation mattes that the photo output delivers."
    },
    {
      "name": "var photoProcessingTimeRange: CMTimeRange",
      "desc": "The time range in which to expect the system to deliver the photo to the delegate."
    }
  ],
  "declaration": "class AVCaptureResolvedPhotoSettings : NSObject",
  "inheritsFrom": [
    "NSObject"
  ]
}