{
  "path": "/documentation/corefoundation/cfsetcallbacks",
  "type": "Structure",
  "name": "CFSetCallBacks",
  "desc": "This structure contains the callbacks used to retain, release, describe, and compare the values of a CFSet object.",
  "items": [
    {
      "name": "init()"
    },
    {
      "name": "init(version: CFIndex, retain: CFSetRetainCallBack!, release: CFSetReleaseCallBack!, copyDescription: CFSetCopyDescriptionCallBack!, equal: CFSetEqualCallBack!, hash: CFSetHashCallBack!)"
    },
    {
      "name": "var copyDescription: CFSetCopyDescriptionCallBack!",
      "desc": "The callback used to create a descriptive string representation of each value in the collection. If NULL, the collection will create a simple description of each value. See CFSetCopyDescriptionCallBack for a description of this callback."
    },
    {
      "name": "var equal: CFSetEqualCallBack!",
      "desc": "The callback used to compare values in the collection for equality for some operations. If NULL, the collection will use pointer equality to compare values in the collection. See CFSetEqualCallBack for a description of this callback."
    },
    {
      "name": "var hash: CFSetHashCallBack!",
      "desc": "The callback used to compute a hash code for values in a collection. If NULL, the collection computes a hash code by converting the pointer value to an integer. See CFSetHashCallBack for a description of this callback."
    },
    {
      "name": "var release: CFSetReleaseCallBack!",
      "desc": "The callback used to release values as they are removed from the collection. If NULL, values are not released. See CFSetReleaseCallBack for a description of this callback."
    },
    {
      "name": "var retain: CFSetRetainCallBack!",
      "desc": "The callback used to retain each value as they are added to the collection. If NULL, values are not retained. See CFSetRetainCallBack for a descriptions of this function’s parameters."
    },
    {
      "name": "var version: CFIndex",
      "desc": "The version number of this structure. If not one of the defined version numbers for this opaque type, the behavior is undefined. The current version of this structure is 0."
    }
  ],
  "declaration": "struct CFSetCallBacks"
}