{
  "path": "/documentation/swiftui/commandgroupplacement",
  "type": "Structure",
  "name": "CommandGroupPlacement",
  "desc": "Identifier types for standard locations that new command groups can be placed relative to.",
  "items": [
    {
      "name": "static let appInfo: CommandGroupPlacement",
      "desc": "Standard placement for commands that provide information about the app, the terms of the user’s license agreement, etc."
    },
    {
      "name": "static let appSettings: CommandGroupPlacement",
      "desc": "Standard placement for commands that expose app settings and preferences."
    },
    {
      "name": "static let appTermination: CommandGroupPlacement",
      "desc": "Standard placement for commands that result in app termination."
    },
    {
      "name": "static let appVisibility: CommandGroupPlacement",
      "desc": "Standard placement for commands that control the visibility of running apps."
    },
    {
      "name": "static let systemServices: CommandGroupPlacement",
      "desc": "Standard placement for commands that expose services provided by other apps."
    },
    {
      "name": "static let importExport: CommandGroupPlacement",
      "desc": "Standard placement for commands that relate to importing and exporting data using formats that the app doesn’t natively support."
    },
    {
      "name": "static let newItem: CommandGroupPlacement",
      "desc": "Standard placement for commands that create and open different kinds of documents."
    },
    {
      "name": "static let printItem: CommandGroupPlacement",
      "desc": "Standard placement for commands related to printing app content."
    },
    {
      "name": "static let saveItem: CommandGroupPlacement",
      "desc": "Standard placement for commands that save open documents and close windows."
    },
    {
      "name": "static let pasteboard: CommandGroupPlacement",
      "desc": "Standard placement for commands that interact with the pasteboard and manipulate content that is currently selected in the app’s view hierarchy."
    },
    {
      "name": "static let textEditing: CommandGroupPlacement",
      "desc": "Standard placement for commands that manipulate and transform text selections."
    },
    {
      "name": "static let textFormatting: CommandGroupPlacement",
      "desc": "Standard placement for commands that manipulate and transform the styles applied to text selections."
    },
    {
      "name": "static let undoRedo: CommandGroupPlacement",
      "desc": "Standard placement for commands that control the Undo Manager."
    },
    {
      "name": "static let sidebar: CommandGroupPlacement",
      "desc": "Standard placement for commands that control the app’s sidebar and full screen modes."
    },
    {
      "name": "static let toolbar: CommandGroupPlacement",
      "desc": "Standard placement for commands that manipulate the toolbar."
    },
    {
      "name": "static let windowArrangement: CommandGroupPlacement",
      "desc": "Standard placement for commands that arrange all of an app’s windows."
    },
    {
      "name": "static let windowList: CommandGroupPlacement",
      "desc": "Standard placement for commands that describe and reveal the app’s open windows."
    },
    {
      "name": "static let windowSize: CommandGroupPlacement",
      "desc": "Standard placement for commands that control the size of the window."
    },
    {
      "name": "static let help: CommandGroupPlacement",
      "desc": "Standard placement for commands that present documentation and helpful information to the user."
    }
  ],
  "declaration": "struct CommandGroupPlacement"
}