{
  "path": "/documentation/uikit/uideviceorientation",
  "type": "Enumeration",
  "name": "UIDeviceOrientation",
  "desc": "Constants that describe the physical orientation of the device.",
  "items": [
    {
      "name": "case unknown",
      "desc": "The orientation of the device cannot be determined."
    },
    {
      "name": "case portrait",
      "desc": "The device is in portrait mode, with the device held upright and the Home button at the bottom."
    },
    {
      "name": "case portraitUpsideDown",
      "desc": "The device is in portrait mode but upside down, with the device held upright and the Home button at the top."
    },
    {
      "name": "case landscapeLeft",
      "desc": "The device is in landscape mode, with the device held upright and the Home button on the right side."
    },
    {
      "name": "case landscapeRight",
      "desc": "The device is in landscape mode, with the device held upright and the Home button on the left side."
    },
    {
      "name": "case faceUp",
      "desc": "The device is held parallel to the ground with the screen facing upwards."
    },
    {
      "name": "case faceDown",
      "desc": "The device is held parallel to the ground with the screen facing downwards."
    },
    {
      "name": "var isPortrait: Bool",
      "desc": "A Boolean value that indicates whether the device is in a portrait orientation."
    },
    {
      "name": "var isLandscape: Bool",
      "desc": "A Boolean value that indicates whether the device is in a landscape orientation."
    },
    {
      "name": "var isFlat: Bool",
      "desc": "A Boolean value that indicates whether the specified orientation is face up or face down."
    },
    {
      "name": "var isValidInterfaceOrientation: Bool",
      "desc": "A Boolean value that indicates whether the specified orientation is one of the portrait or landscape orientations."
    }
  ],
  "declaration": "enum UIDeviceOrientation : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}