{
  "path": "/documentation/swiftui/scenestorage",
  "type": "Structure",
  "name": "SceneStorage",
  "desc": "A property wrapper type that reads and writes to persisted, per-scene storage.",
  "items": [
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore a URL."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore an integer."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore a double."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore a string."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore a boolean."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore a string, transforming it to a RawRepresentable data type."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore data."
    },
    {
      "name": "init(wrappedValue: Value, String)",
      "desc": "Creates a property that can save and restore an integer, transforming it to a RawRepresentable data type."
    },
    {
      "name": "init(String)",
      "desc": "Creates a property that can save and restore an Optional string."
    },
    {
      "name": "init<R>(String)",
      "desc": "Creates a property that can save and restore an Optional integer, transforming it to an Optional RawRepresentable data type."
    },
    {
      "name": "init(String)",
      "desc": "Creates a property that can save and restore an Optional double."
    },
    {
      "name": "init(String)",
      "desc": "Creates a property that can save and restore an Optional boolean."
    },
    {
      "name": "init(String)",
      "desc": "Creates a property that can save and restore an Optional data."
    },
    {
      "name": "init(String)",
      "desc": "Creates a property that can save and restore an Optional URL."
    },
    {
      "name": "init(String)",
      "desc": "Creates a property that can save and restore an Optional integer."
    },
    {
      "name": "init<R>(String)",
      "desc": "Creates a property that can save and restore an Optional string, transforming it to an Optional RawRepresentable data type."
    },
    {
      "name": "var wrappedValue: Value",
      "desc": "The underlying value referenced by the state variable."
    },
    {
      "name": "var projectedValue: Binding<Value>",
      "desc": "A binding to the state value."
    }
  ],
  "declaration": "@frozen @propertyWrapper struct SceneStorage<Value>",
  "conformsTo": [
    "DynamicProperty"
  ]
}