{
  "path": "/documentation/realitykit/modeldebugoptionscomponent/visualizationmode",
  "type": "Enumeration",
  "name": "ModelDebugOptionsComponent.VisualizationMode",
  "desc": "A mode that specifies the portion of the rendering process to isolate and display for debugging.",
  "items": [
    {
      "name": "case none",
      "desc": "A mode that doesn’t display a visualization."
    },
    {
      "name": "case normal",
      "desc": "A mode that displays the normal vectors as a color."
    },
    {
      "name": "case tangent",
      "desc": "A mode that displays the surface tangent vectors as a color."
    },
    {
      "name": "case bitangent",
      "desc": "A mode that displays the surface bitangent vectors as a color."
    },
    {
      "name": "case baseColor",
      "desc": "A mode that displays the entity’s base color with no lighting or material properties applied."
    },
    {
      "name": "case textureCoordinates",
      "desc": "A mode that displays the texture coordinates as a color."
    },
    {
      "name": "case finalColor",
      "desc": "A mode that displays the entity’s calculated color, ignoring transparency."
    },
    {
      "name": "case finalAlpha",
      "desc": "A mode that displays the entity’s calculated transparency as its surface color."
    },
    {
      "name": "case roughness",
      "desc": "A mode that displays the shininess of a material as the surface color."
    },
    {
      "name": "case metallic",
      "desc": "A mode that displays the reflectiveness of an entity as its surface color."
    },
    {
      "name": "case ambientOcclusion",
      "desc": "A mode that displays the calculated ambient occlusion value as the surface color."
    },
    {
      "name": "case specular",
      "desc": "A mode that displays en entitiy’s shininess as its surface color."
    },
    {
      "name": "case emissive",
      "desc": "A mode that displays the emissive channel of a material as the surface color."
    },
    {
      "name": "case clearcoat",
      "desc": "A mode that displays the clearcoat channel of a material as the surface color."
    },
    {
      "name": "case clearcoatRoughness",
      "desc": "A mode that displays the clearcoat roughness channel of a material as the surface color."
    },
    {
      "name": "case lightingDiffuse",
      "desc": "A mode that displays the intensity of indirect light hitting the entity as its surface color."
    },
    {
      "name": "case lightingSpecular",
      "desc": "A mode that displays the intensity of direct light hitting the entity as its surface color."
    },
    {
      "name": "init?(rawValue: String)",
      "desc": "Initializes a visualization mode from a raw string value."
    },
    {
      "name": "var rawValue: String",
      "desc": "The corresponding value of the raw type."
    },
    {
      "name": "typealias ModelDebugOptionsComponent.VisualizationMode.RawValue",
      "desc": "The datatype used for raw values."
    },
    {
      "name": "var hashValue: Int",
      "desc": "The hash value."
    },
    {
      "name": "func hash(into: inout Hasher)",
      "desc": "Passes a visualization mode’s raw value to the specified hash function."
    },
    {
      "name": "static func != (ModelDebugOptionsComponent.VisualizationMode, ModelDebugOptionsComponent.VisualizationMode) -> Bool",
      "desc": "Compares two values to see if they aren’t equal."
    }
  ],
  "declaration": "enum ModelDebugOptionsComponent.VisualizationMode : String"
}