{
  "path": "/documentation/glkit/glkviewcontroller",
  "type": "Class",
  "name": "GLKViewController",
  "desc": "A view controller that manages an OpenGL ES rendering loop.",
  "items": [
    {
      "name": "var preferredFramesPerSecond: Int",
      "desc": "The rate you want the view controller to call the view to update the contents of the view."
    },
    {
      "name": "var framesPerSecond: Int",
      "desc": "The actual rate that the view controller attempts to call the view to update its contents."
    },
    {
      "name": "var delegate: GLKViewControllerDelegate?",
      "desc": "The view controller’s delegate."
    },
    {
      "name": "var isPaused: Bool",
      "desc": "A Boolean value that indicates whether the rendering loop is paused."
    },
    {
      "name": "var pauseOnWillResignActive: Bool",
      "desc": "A Boolean value that indicates whether the view controller automatically pauses the rendering loop when the application resigns the active state."
    },
    {
      "name": "var resumeOnDidBecomeActive: Bool",
      "desc": "A Boolean value that indicates whether the view controller automatically resumes the rendering loop when the application becomes active."
    },
    {
      "name": "var framesDisplayed: Int",
      "desc": "The number of frame updates that have been sent by the view controller since it was created."
    },
    {
      "name": "var timeSinceFirstResume: TimeInterval",
      "desc": "The amount of time that has passed since first time the view controller resumed sending update events."
    },
    {
      "name": "var timeSinceLastResume: TimeInterval",
      "desc": "The amount of time that has passed since the last time the view controller resumed sending update events."
    },
    {
      "name": "var timeSinceLastUpdate: TimeInterval",
      "desc": "The amount of time that has passed since the last time the view controller called the delegate’s glkViewControllerUpdate(_:) method."
    },
    {
      "name": "var timeSinceLastDraw: TimeInterval",
      "desc": "The amount of time that has passed since the last time the view controller called the view’s display() method."
    }
  ],
  "declaration": "class GLKViewController : UIViewController",
  "inheritsFrom": [
    "UIViewController"
  ],
  "conformsTo": [
    "GLKViewDelegate",
    "NSCoding"
  ]
}