{
  "path": "/documentation/uikit/uiimage/symbolconfiguration",
  "type": "Class",
  "name": "UIImage.SymbolConfiguration",
  "desc": "An object that contains the specific font, size, style, and weight attributes to apply to a symbol image.",
  "items": [
    {
      "name": "init(pointSize: CGFloat)",
      "desc": "Creates a configuration object with the specified point-size information."
    },
    {
      "name": "init(pointSize: CGFloat, weight: UIImage.SymbolWeight)",
      "desc": "Creates a configuration object with the specified point-size and weight information."
    },
    {
      "name": "init(pointSize: CGFloat, weight: UIImage.SymbolWeight, scale: UIImage.SymbolScale)",
      "desc": "Creates a configuration object with the specified point-size, weight, and scale information."
    },
    {
      "name": "init(scale: UIImage.SymbolScale)",
      "desc": "Creates a configuration object with the specified scale information."
    },
    {
      "name": "init(textStyle: UIFont.TextStyle)",
      "desc": "Creates a configuration object with the specified font text style information."
    },
    {
      "name": "init(textStyle: UIFont.TextStyle, scale: UIImage.SymbolScale)",
      "desc": "Creates a configuration object with the specified font text style and scale information."
    },
    {
      "name": "init(weight: UIImage.SymbolWeight)",
      "desc": "Creates a configuration object with the specified weight information."
    },
    {
      "name": "init(font: UIFont)",
      "desc": "Creates a configuration object with the specified font information."
    },
    {
      "name": "init(font: UIFont, scale: UIImage.SymbolScale)",
      "desc": "Creates a configuration object with the specified font and scale information."
    },
    {
      "name": "enum UIImage.SymbolScale",
      "desc": "Constants that indicate which scale variant of a symbol image to use."
    },
    {
      "name": "enum UIImage.SymbolWeight",
      "desc": "Constants that indicate which weight variant of a symbol image to use."
    },
    {
      "name": "init(hierarchicalColor: UIColor)",
      "desc": "Creates a color configuration with a color scheme that originates from one color."
    },
    {
      "name": "init(paletteColors: [UIColor])",
      "desc": "Creates a color configuration with a color scheme from a palette of multiple colors."
    },
    {
      "name": "class func preferringMulticolor() -> Self",
      "desc": "Creates a color configuration that specifies that the symbol image uses its multicolor variant, if one exists."
    },
    {
      "name": "class var unspecified: UIImage.SymbolConfiguration",
      "desc": "A symbol configuration object that contains unspecified values for all attributes."
    },
    {
      "name": "func configurationWithoutPointSizeAndWeight() -> Self",
      "desc": "Returns a copy of the current symbol configuration object without point-size and weight information."
    },
    {
      "name": "func configurationWithoutScale() -> Self",
      "desc": "Returns a copy of the current symbol configuration object without scale information."
    },
    {
      "name": "func configurationWithoutTextStyle() -> Self",
      "desc": "Returns a copy of the current symbol configuration object without font text style information."
    },
    {
      "name": "func configurationWithoutWeight() -> Self",
      "desc": "Returns a copy of the current symbol configuration object without weight information."
    },
    {
      "name": "func isEqual(to: UIImage.SymbolConfiguration?) -> Bool",
      "desc": "Returns a Boolean value that indicates whether the configuration objects are equivalent."
    }
  ],
  "declaration": "class SymbolConfiguration : UIImage.Configuration",
  "inheritsFrom": [
    "UIImage.Configuration"
  ]
}