{
  "path": "/documentation/uikit/uinavigationitem",
  "type": "Class",
  "name": "UINavigationItem",
  "desc": "The items that a navigation bar displays when the associated view controller is visible.",
  "items": [
    {
      "name": "init(title: String)",
      "desc": "Creates a navigation item with the specified title."
    },
    {
      "name": "init?(coder: NSCoder)",
      "desc": "Creates a navigation item from data in an unarchiver."
    },
    {
      "name": "var title: String?",
      "desc": "The navigation item’s title that displays in the navigation bar."
    },
    {
      "name": "var largeTitleDisplayMode: UINavigationItem.LargeTitleDisplayMode",
      "desc": "The mode for displaying the title of the navigation bar."
    },
    {
      "name": "enum UINavigationItem.LargeTitleDisplayMode",
      "desc": "Constants that indicate how to size the title of this item."
    },
    {
      "name": "var backBarButtonItem: UIBarButtonItem?",
      "desc": "The bar button item for adding a Back button to the navigation bar."
    },
    {
      "name": "var backButtonTitle: String?",
      "desc": "The custom title of the Back button."
    },
    {
      "name": "var backButtonDisplayMode: UINavigationItem.BackButtonDisplayMode",
      "desc": "The display mode of the Back button."
    },
    {
      "name": "enum UINavigationItem.BackButtonDisplayMode",
      "desc": "Constants that describe the display modes of the Back button."
    },
    {
      "name": "var hidesBackButton: Bool",
      "desc": "A Boolean value that determines whether the navigation item hides the Back button."
    },
    {
      "name": "func setHidesBackButton(Bool, animated: Bool)",
      "desc": "Hides or shows the Back button, optionally animating the transition."
    },
    {
      "name": "var prompt: String?",
      "desc": "A single line of text that displays at the top of the navigation bar."
    },
    {
      "name": "var leftItemsSupplementBackButton: Bool",
      "desc": "A Boolean value that indicates whether the left items display in addition to the Back button."
    },
    {
      "name": "var titleView: UIView?",
      "desc": "A custom view that displays in the center of the navigation bar when the receiver is the top item."
    },
    {
      "name": "var leftBarButtonItems: [UIBarButtonItem]?",
      "desc": "An array of custom bar button items to display on the left (or leading) side of the navigation bar when the navigation item is the top item."
    },
    {
      "name": "var leftBarButtonItem: UIBarButtonItem?",
      "desc": "A custom bar button item that displays on the left (or leading) edge of the navigation bar when the navigation item is the top item."
    },
    {
      "name": "var rightBarButtonItems: [UIBarButtonItem]?",
      "desc": "An array of custom bar button items to display on the right (or trailing) side of the navigation bar when the navigation item is the top item."
    },
    {
      "name": "var rightBarButtonItem: UIBarButtonItem?",
      "desc": "A custom bar button item that displays on the right (or trailing) edge of the navigation bar when the navigation item is the top item."
    },
    {
      "name": "func setLeftBarButtonItems([UIBarButtonItem]?, animated: Bool)",
      "desc": "Sets the left bar button items, optionally animating the transition to the new items."
    },
    {
      "name": "func setLeftBarButton(UIBarButtonItem?, animated: Bool)",
      "desc": "Sets the custom bar button item, optionally animating the transition to the new item."
    },
    {
      "name": "func setRightBarButtonItems([UIBarButtonItem]?, animated: Bool)",
      "desc": "Sets the right bar button items, optionally animating the transition to the new items."
    },
    {
      "name": "func setRightBarButton(UIBarButtonItem?, animated: Bool)",
      "desc": "Sets the custom bar button item, optionally animating the transition to the view."
    },
    {
      "name": "var standardAppearance: UINavigationBarAppearance?",
      "desc": "The appearance settings for a standard-height navigation bar."
    },
    {
      "name": "var compactAppearance: UINavigationBarAppearance?",
      "desc": "The appearance settings for a compact-height navigation bar."
    },
    {
      "name": "var scrollEdgeAppearance: UINavigationBarAppearance?",
      "desc": "The appearance settings for a standard-height navigation bar when the edge of scrollable content aligns with the edge of the navigation bar."
    },
    {
      "name": "var compactScrollEdgeAppearance: UINavigationBarAppearance?",
      "desc": "The appearance settings for a compact-height navigation bar when the edge of scrollable content aligns with the edge of the navigation bar."
    },
    {
      "name": "var searchController: UISearchController?",
      "desc": "The search controller to integrate into your navigation interface."
    },
    {
      "name": "var hidesSearchBarWhenScrolling: Bool",
      "desc": "A Boolean value that indicates whether the app hides the integrated search bar when scrolling any underlying content."
    }
  ],
  "declaration": "@MainActor class UINavigationItem : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCoding"
  ]
}