{
  "path": "/documentation/apple_search_ads/reportingcreativeset",
  "type": "Object",
  "name": "ReportingCreativeSet",
  "desc": "The response to a request to fetch Creative Set-level reports.",
  "items": [
    {
      "name": "adGroupCreativeSetId",
      "desc": "The unique identifier for the ad group Creative Set."
    },
    {
      "name": "adGroupId",
      "desc": "The unique identifier for the ad group.You can use the EQUALS and IN selector Condition operators with Get Creative Set-Level Reports and Find Ad Group Creative Sets."
    },
    {
      "name": "campaignId",
      "desc": "The unique identifier for the campaign."
    },
    {
      "name": "creationTime",
      "desc": "The creation date and time of the Creative Set."
    },
    {
      "name": "creativeSetId",
      "desc": "The unique identifier for the Creative Set that belongs to an ad group.You can use the EQUALS, IN, and STARTSWITH selector Condition operators with Get Creative Set-Level Reports."
    },
    {
      "name": "creativeSetLanguage",
      "desc": "The language of the Creative Set."
    },
    {
      "name": "creativeSetLanguageDisplayName",
      "desc": "The language that displays for the Creative Set."
    },
    {
      "name": "creativeSetName",
      "desc": "The name of the Creative Set.You can use the EQUALS, IN, STARTSWITH, CONTAINS, and ENDSWITH selector Condition operators with Get Creative Set-Level Reports."
    },
    {
      "name": "deleted",
      "desc": "An indicator of whether the Creative Set is soft-deleted.You can use the EQUALS and IN selector Condition operators with Get Creative Set-Level Reports."
    },
    {
      "name": "displayStatus",
      "desc": "An indicator of the status of the campaign. The status resolves according to servingStatus and additional criteria.You can use the EQUALS and IN selector Condition operators with Get Creative Set-Level Reports."
    },
    {
      "name": "modificationTime",
      "desc": "The date and time of the most recent modification of the object."
    },
    {
      "name": "orgId",
      "desc": "The id of your account in the Apple Search Ads UI."
    },
    {
      "name": "status",
      "desc": "The state of the operation."
    }
  ]
}