{
  "path": "/documentation/metrickit/mxbackgroundexitdata",
  "type": "Class",
  "name": "MXBackgroundExitData",
  "desc": "An object representing counts for the different types of background app exits.",
  "items": [
    {
      "name": "var cumulativeNormalAppExitCount: Int",
      "desc": "The number of times the app exited normally from the background."
    },
    {
      "name": "var cumulativeAbnormalExitCount: Int",
      "desc": "The number of times the app exited abnormally from the background."
    },
    {
      "name": "var cumulativeAppWatchdogExitCount: Int",
      "desc": "The number of times the system watchdog terminated the app from the background."
    },
    {
      "name": "var cumulativeCPUResourceLimitExitCount: Int",
      "desc": "The number of times the system terminated the app from the background for using too much CPU time."
    },
    {
      "name": "var cumulativeMemoryResourceLimitExitCount: Int",
      "desc": "The number of times the system terminated the app from the background for using too much memory."
    },
    {
      "name": "var cumulativeMemoryPressureExitCount: Int",
      "desc": "The number of times the system terminated the app from the background to free up memory."
    },
    {
      "name": "var cumulativeSuspendedWithLockedFileExitCount: Int",
      "desc": "The number of times the system terminated the app from the background while being suspended and having file locks."
    },
    {
      "name": "var cumulativeBadAccessExitCount: Int",
      "desc": "The number of times the system terminated the app from the background for attempting an invalid memory access."
    },
    {
      "name": "var cumulativeIllegalInstructionExitCount: Int",
      "desc": "The number of times the system terminated the app from the background for attempting to execute an illegal or undefined instruction."
    },
    {
      "name": "var cumulativeBackgroundTaskAssertionTimeoutExitCount: Int",
      "desc": "The number of times the system terminated the app from the background for exceeding the allocated time for a background task."
    }
  ],
  "declaration": "class MXBackgroundExitData : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSSecureCoding"
  ]
}