{
  "path": "/documentation/arkit/arerror/code",
  "type": "Enumeration",
  "name": "ARError.Code",
  "desc": "Codes that identify errors in ARKit.",
  "items": [
    {
      "name": "case requestFailed",
      "desc": "An error the framework produces when a request fails."
    },
    {
      "name": "case cameraUnauthorized",
      "desc": "An error that indicates the app lacks user permission for the camera."
    },
    {
      "name": "case fileIOFailed",
      "desc": "An error the framework produces when file access fails to read or write."
    },
    {
      "name": "case insufficientFeatures",
      "desc": "An error that indicates the framework requires more features to complete a task."
    },
    {
      "name": "case invalidCollaborationData",
      "desc": "An error that results when the framework fails to parse collaboration data the app receives over the network."
    },
    {
      "name": "case invalidConfiguration",
      "desc": "An error that indicates the configuration contains ambiguous or erroneous data."
    },
    {
      "name": "case invalidReferenceImage",
      "desc": "An error that indicates the framework failed to process a reference image."
    },
    {
      "name": "case invalidReferenceObject",
      "desc": "An error that indicates the framework failed to process a reference object."
    },
    {
      "name": "case invalidWorldMap",
      "desc": "An error that indicates the framework failed to process a world map."
    },
    {
      "name": "case microphoneUnauthorized",
      "desc": "An error that indicates the app lacks user permission for the microphone."
    },
    {
      "name": "case objectMergeFailed",
      "desc": "An error that indicates the framework failed to merge a detected object."
    },
    {
      "name": "case sensorFailed",
      "desc": "An error that indicates a sensor failed to provide required input."
    },
    {
      "name": "case sensorUnavailable",
      "desc": "An error that indicates the framework failed to access a required sensor."
    },
    {
      "name": "case unsupportedConfiguration",
      "desc": "An error that indicates the device doesn’t support the session’s configuration."
    },
    {
      "name": "case worldTrackingFailed",
      "desc": "An error the framework produces when world tracking experiences an unrecoverable problem."
    },
    {
      "name": "case geoTrackingFailed",
      "desc": "An error that indicates the framework failed to match localization imagery with the device’s camera captures."
    },
    {
      "name": "case geoTrackingNotAvailableAtLocation",
      "desc": "An error the framework produces when a location lacks geotracking support."
    },
    {
      "name": "case locationUnauthorized",
      "desc": "An error that indicates the app lacks user permission for the device’s current location."
    }
  ],
  "declaration": "enum ARError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}