{
  "path": "/documentation/appkit/nsuserdefaultscontroller",
  "type": "Class",
  "name": "NSUserDefaultsController",
  "desc": "A controller that accesses user preference information for your app from the user’s defaults database.",
  "items": [
    {
      "name": "class var shared: NSUserDefaultsController",
      "desc": "Returns the shared instance of NSUserDefaultsController, creating it if necessary."
    },
    {
      "name": "init(defaults: UserDefaults?, initialValues: [String : Any]?)",
      "desc": "Returns an initialized NSUserDefaultsController object using the NSUserDefaults instance specified in defaults and the initial default values contained in the initialValues dictionary."
    },
    {
      "name": "init?(coder: NSCoder)"
    },
    {
      "name": "var defaults: UserDefaults",
      "desc": "Returns the instance of NSUserDefaults in use by the receiver."
    },
    {
      "name": "var initialValues: [String : Any]?",
      "desc": "Returns a dictionary containing the receiver’s initial default values."
    },
    {
      "name": "var hasUnappliedChanges: Bool",
      "desc": "Returns whether the receiver has user default values that have not been saved to NSUserDefaults."
    },
    {
      "name": "var appliesImmediately: Bool",
      "desc": "Returns whether any changes made to bound user default properties are saved immediately."
    },
    {
      "name": "var values: Any",
      "desc": "Returns a key value coding compliant object that is used to access the user default properties."
    },
    {
      "name": "func revert(Any?)",
      "desc": "Causes the receiver to discard any unsaved changes to bound user default properties, restoring their previous values."
    },
    {
      "name": "func revertToInitialValues(Any?)",
      "desc": "Causes the receiver to discard all edits and replace the values of all the user default properties with any corresponding values in the initialValues dictionary."
    },
    {
      "name": "func save(Any?)",
      "desc": "Saves the values of the receiver’s user default properties."
    }
  ],
  "declaration": "class NSUserDefaultsController : NSController",
  "inheritsFrom": [
    "NSController"
  ]
}