{
  "path": "/documentation/applemusicapi/songs/attributes",
  "type": "Object",
  "name": "Songs.Attributes",
  "desc": "The attributes for a song resource.",
  "items": [
    {
      "name": "albumName",
      "desc": "The name of the album the song appears on."
    },
    {
      "name": "artistName",
      "desc": "The artist’s name."
    },
    {
      "name": "artwork",
      "desc": "The album artwork."
    },
    {
      "name": "attribution",
      "desc": "(Classical music only) The name of the artist or composer to attribute the song with."
    },
    {
      "name": "composerName",
      "desc": "The song’s composer."
    },
    {
      "name": "contentRating",
      "desc": "The Recording Industry Association of America (RIAA) rating of the content. The possible values for this rating are clean and explicit. No value means no rating."
    },
    {
      "name": "discNumber",
      "desc": "The disc number of the album the song appears on."
    },
    {
      "name": "durationInMillis",
      "desc": "The duration of the song in milliseconds."
    },
    {
      "name": "editorialNotes",
      "desc": "The notes about the song that appear in the Apple Music catalog."
    },
    {
      "name": "genreNames",
      "desc": "The genre names the song is associated with."
    },
    {
      "name": "hasLyrics",
      "desc": "Indicates if the song has lyrics available in the Apple Music catalog. If true, the song has lyrics available; otherwise, it does not."
    },
    {
      "name": "isrc",
      "desc": "The International Standard Recording Code (ISRC) for the song."
    },
    {
      "name": "movementCount",
      "desc": "(Classical music only) The movement count of this song."
    },
    {
      "name": "movementName",
      "desc": "(Classical music only) The movement name of this song."
    },
    {
      "name": "movementNumber",
      "desc": "(Classical music only) The movement number of this song."
    },
    {
      "name": "name",
      "desc": "The localized name of the song."
    },
    {
      "name": "playParams",
      "desc": "The parameters to use to playback the song."
    },
    {
      "name": "previews",
      "desc": "The preview assets for the song."
    },
    {
      "name": "releaseDate",
      "desc": "The release date of the song, when known, in YYYY-MM-DD or YYYY format. Pre-release songs may have an expected release date in the future."
    },
    {
      "name": "trackNumber",
      "desc": "The number of the song in the album’s track list."
    },
    {
      "name": "url",
      "desc": "The URL for sharing the song in Apple Music."
    },
    {
      "name": "workName",
      "desc": "(Classical music only) The name of the associated work."
    },
    {
      "name": "artistUrl",
      "desc": "The url of the artist for this content."
    }
  ]
}