{
  "path": "/documentation/coredata/nsfetchedresultscontrollerdelegate",
  "type": "Protocol",
  "name": "NSFetchedResultsControllerDelegate",
  "desc": "A delegate protocol that describes the methods that will be called by the associated fetched results controller when the fetch results have changed.",
  "items": [
    {
      "name": "func controller(NSFetchedResultsController<NSFetchRequestResult>, didChangeContentWith: NSDiffableDataSourceSnapshot)",
      "desc": "Notifies the receiver about changes to the content in the fetched results controller, by using a diffable data source snapshot."
    },
    {
      "name": "func controller(NSFetchedResultsController<NSFetchRequestResult>, didChangeContentWith: CollectionDifference<NSManagedObjectID>)",
      "desc": "Notifies the receiver about changes to the content in the fetched results controller, by using a collection difference."
    },
    {
      "name": "func controllerWillChangeContent(NSFetchedResultsController<NSFetchRequestResult>)",
      "desc": "Notifies the receiver that the fetched results controller is about to start processing of one or more changes due to an add, remove, move, or update."
    },
    {
      "name": "func controller(NSFetchedResultsController<NSFetchRequestResult>, didChange: Any, at: IndexPath?, for: NSFetchedResultsChangeType, newIndexPath: IndexPath?)",
      "desc": "Notifies the receiver that a fetched object has been changed due to an add, remove, move, or update."
    },
    {
      "name": "func controller(NSFetchedResultsController<NSFetchRequestResult>, didChange: NSFetchedResultsSectionInfo, atSectionIndex: Int, for: NSFetchedResultsChangeType)",
      "desc": "Notifies the receiver of the addition or removal of a section."
    },
    {
      "name": "func controllerDidChangeContent(NSFetchedResultsController<NSFetchRequestResult>)",
      "desc": "Notifies the receiver that the fetched results controller has completed processing of one or more changes due to an add, remove, move, or update."
    },
    {
      "name": "func controller(NSFetchedResultsController<NSFetchRequestResult>, sectionIndexTitleForSectionName: String) -> String?",
      "desc": "Returns the name for a given section."
    },
    {
      "name": "enum NSFetchedResultsChangeType",
      "desc": "Constants that specify the possible types of changes that are reported."
    }
  ],
  "declaration": "protocol NSFetchedResultsControllerDelegate",
  "inheritsFrom": [
    "NSObjectProtocol"
  ]
}