{
  "path": "/documentation/cloudkit/ckerror/code",
  "type": "Enumeration",
  "name": "CKError.Code",
  "desc": "The error codes that CloudKit returns.",
  "items": [
    {
      "name": "case accountTemporarilyUnavailable",
      "desc": "An error that occurs when the user’s iCloud account is temporarily unavailable."
    },
    {
      "name": "case alreadyShared",
      "desc": "An error that occurs when CloudKit attempts to share a record with an existing share."
    },
    {
      "name": "case assetFileModified",
      "desc": "An error that occurs when the system modifies an asset while saving it."
    },
    {
      "name": "case assetFileNotFound",
      "desc": "An error that occurs when the system can’t find the specified asset."
    },
    {
      "name": "case assetNotAvailable",
      "desc": "An error that occurs when the system can’t access the specified asset."
    },
    {
      "name": "case badContainer",
      "desc": "An error that occurs when you use an unknown or unauthorized container."
    },
    {
      "name": "case badDatabase",
      "desc": "An error that occurs when the operation can’t complete for the specified database."
    },
    {
      "name": "case batchRequestFailed",
      "desc": "An error that occurs when the system rejects the entire batch of changes."
    },
    {
      "name": "case changeTokenExpired",
      "desc": "An error that occurs when the change token expires."
    },
    {
      "name": "case constraintViolation",
      "desc": "An error that occurs when the server rejects the request because of a unique constraint violation."
    },
    {
      "name": "case incompatibleVersion",
      "desc": "An error that occurs when the current app version is older than the oldest allowed version."
    },
    {
      "name": "case internalError",
      "desc": "A nonrecoverable error that CloudKit encounters."
    },
    {
      "name": "case invalidArguments",
      "desc": "An error that occurs when the request contains invalid information."
    },
    {
      "name": "case limitExceeded",
      "desc": "An error that occurs when a request’s size exceeds the limit."
    },
    {
      "name": "case managedAccountRestricted",
      "desc": "An error that occurs when CloudKit rejects a request due to a managed-account restriction."
    },
    {
      "name": "case missingEntitlement",
      "desc": "An error that occurs when the app is missing a required entitlement."
    },
    {
      "name": "case networkFailure",
      "desc": "An error that occurs when a network is available, but CloudKit is inaccessible."
    },
    {
      "name": "case networkUnavailable",
      "desc": "An error that occurs when the network is unavailable."
    },
    {
      "name": "case notAuthenticated",
      "desc": "An error that occurs when the user is unauthenticated."
    },
    {
      "name": "case operationCancelled",
      "desc": "An error that occurs when an operation cancels."
    },
    {
      "name": "case partialFailure",
      "desc": "An error that occurs when an operation completes with partial failures."
    },
    {
      "name": "case participantMayNeedVerification",
      "desc": "An error that occurs when the user isn’t a participant of the share."
    },
    {
      "name": "case permissionFailure",
      "desc": "An error that occurs when the user doesn’t have permission to save or fetch data."
    },
    {
      "name": "case quotaExceeded",
      "desc": "An error that occurs when saving a record exceeds the user’s storage quota."
    },
    {
      "name": "case referenceViolation",
      "desc": "An error that occurs when CloudKit can’t find the target of a reference."
    },
    {
      "name": "case requestRateLimited",
      "desc": "An error that occurs when CloudKit rate-limits requests."
    },
    {
      "name": "case serverRecordChanged",
      "desc": "An error that occurs when CloudKit rejects a record because the server’s version is different."
    },
    {
      "name": "case serverRejectedRequest",
      "desc": "An error that occurs when CloudKit rejects the request."
    },
    {
      "name": "case serverResponseLost",
      "desc": "An error that occurs when CloudKit is unable to maintain the network connection and provide a response."
    },
    {
      "name": "case serviceUnavailable",
      "desc": "An error that occurs when CloudKit is unavailable."
    },
    {
      "name": "case tooManyParticipants",
      "desc": "An error that occurs when a share has too many participants."
    },
    {
      "name": "case unknownItem",
      "desc": "An error that occurs when the specified record doesn’t exist."
    },
    {
      "name": "case userDeletedZone",
      "desc": "An error that occurs when the user deletes a record zone using the Settings app."
    },
    {
      "name": "case zoneBusy",
      "desc": "An error that occurs when the server is too busy to handle the record zone operation."
    },
    {
      "name": "case zoneNotFound",
      "desc": "An error that occurs when the specified record zone doesn’t exist."
    }
  ],
  "declaration": "enum CKError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}