{
  "path": "/documentation/appstoreservernotifications/jwstransactiondecodedpayload",
  "type": "Object",
  "name": "JWSTransactionDecodedPayload",
  "desc": "A decoded payload containing transaction information.",
  "items": [
    {
      "name": "appAccountToken",
      "desc": "A UUID that associates the transaction with a user on your own service. If your app doesn’t provide an appAccountToken, this string is empty. For more information, see appAccountToken(_:)."
    },
    {
      "name": "bundleId",
      "desc": "The bundle identifier of the app."
    },
    {
      "name": "environment",
      "desc": "The server environment, either sandbox or production."
    },
    {
      "name": "expiresDate",
      "desc": "The UNIX time, in milliseconds, the subscription expires or renews."
    },
    {
      "name": "inAppOwnershipType",
      "desc": "A string that describes whether the transaction was purchased by the user, or is available to them through Family Sharing."
    },
    {
      "name": "isUpgraded",
      "desc": "A Boolean value that indicates whether the user upgraded to another subscription."
    },
    {
      "name": "offerIdentifier",
      "desc": "The identifier that contains the promo code or the promotional offer identifier."
    },
    {
      "name": "offerType",
      "desc": "A value that represents the promotional offer type."
    },
    {
      "name": "originalPurchaseDate",
      "desc": "The UNIX time, in milliseconds, that represents the purchase date of the original transaction identifier."
    },
    {
      "name": "originalTransactionId",
      "desc": "The transaction identifier of the original purchase."
    },
    {
      "name": "productId",
      "desc": "The product identifier of the in-app purchase."
    },
    {
      "name": "purchaseDate",
      "desc": "The UNIX time, in milliseconds, that the App Store charged the user’s account for a purchase, restored product, subscription, or subscription renewal after a lapse."
    },
    {
      "name": "quantity",
      "desc": "The number of consumable products the user purchased."
    },
    {
      "name": "revocationDate",
      "desc": "The UNIX time, in milliseconds, that the App Store refunded the transaction or revoked it from Family Sharing."
    },
    {
      "name": "revocationReason",
      "desc": "The reason that the App Store refunded the transaction or revoked it from Family Sharing."
    },
    {
      "name": "signedDate",
      "desc": "The UNIX time, in milliseconds, that the App Store signed the JSON Web Signature (JWS) data."
    },
    {
      "name": "subscriptionGroupIdentifier",
      "desc": "The identifier of the subscription group the subscription belongs to."
    },
    {
      "name": "transactionId",
      "desc": "The unique identifier of the transaction."
    },
    {
      "name": "type",
      "desc": "The type of the in-app purchase."
    },
    {
      "name": "webOrderLineItemId",
      "desc": "The unique identifier of subscription purchase events across devices, including subscription renewals."
    }
  ]
}