{
  "path": "/documentation/foundation/nsspecifiertest/testcomparisonoperation",
  "type": "Enumeration",
  "name": "NSSpecifierTest.TestComparisonOperation",
  "desc": "These are passed to  init(objectSpecifier:comparisonOperator:test:) to specify the comparison operator.",
  "items": [
    {
      "name": "case equal",
      "desc": "Binary comparison operator that results in true if the two objects are equal."
    },
    {
      "name": "case lessThanOrEqual",
      "desc": "Binary comparison operator that results in true if the value of the test object is equal to or less than the value of the other object."
    },
    {
      "name": "case lessThan",
      "desc": "Binary comparison operator that results in true if the value of the test object is less than the value of the other object."
    },
    {
      "name": "case greaterThanOrEqual",
      "desc": "Binary comparison operator that results in true if the value of the test object is greater than or equal to the value of the other object."
    },
    {
      "name": "case greaterThan",
      "desc": "Binary comparison operator that results in true if the value of the test object is greater than the value of the other object."
    },
    {
      "name": "case beginsWith",
      "desc": "Binary containment operator that results in true if the test object is a list or string that matches the beginning of the other object (which is also a list or string)."
    },
    {
      "name": "case endsWith",
      "desc": "Binary containment operator that results in true if the test object is a list or string that matches the end of the other object (which is also a list or string)."
    },
    {
      "name": "case contains",
      "desc": "Binary containment operator that results in true if the test object is a list or string that matches the other object (which is also a list or string) at any location."
    }
  ],
  "declaration": "enum TestComparisonOperation : UInt, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}