{
  "path": "/documentation/objectivec/1418956-nsobject",
  "type": "Protocol",
  "name": "NSObject",
  "desc": "The group of methods that are fundamental to all Objective-C objects.",
  "items": [
    {
      "name": "- class",
      "desc": "Returns the class object for the receiver’s class."
    },
    {
      "name": "- isEqual:",
      "desc": "Returns a Boolean value that indicates whether the receiver and a given object are equal."
    },
    {
      "name": "- self",
      "desc": "Returns the receiver."
    },
    {
      "name": "- isKindOfClass:",
      "desc": "Returns a Boolean value that indicates whether the receiver is an instance of given class or an instance of any class that inherits from that class."
    },
    {
      "name": "- isMemberOfClass:",
      "desc": "Returns a Boolean value that indicates whether the receiver is an instance of a given class."
    },
    {
      "name": "- respondsToSelector:",
      "desc": "Returns a Boolean value that indicates whether the receiver implements or inherits a method that can respond to a specified message."
    },
    {
      "name": "- conformsToProtocol:",
      "desc": "Returns a Boolean value that indicates whether the receiver conforms to a given protocol."
    },
    {
      "name": "- performSelector:",
      "desc": "Sends a specified message to the receiver and returns the result of the message."
    },
    {
      "name": "- performSelector:withObject:",
      "desc": "Sends a message to the receiver with an object as the argument."
    },
    {
      "name": "- performSelector:withObject:withObject:",
      "desc": "Sends a message to the receiver with two objects as arguments."
    },
    {
      "name": "- isProxy",
      "desc": "Returns a Boolean value that indicates whether the receiver does not descend from NSObject."
    },
    {
      "name": "- retain",
      "desc": "Increments the receiver’s reference count."
    },
    {
      "name": "- release",
      "desc": "Decrements the receiver’s reference count."
    },
    {
      "name": "- autorelease",
      "desc": "Decrements the receiver’s retain count at the end of the current autorelease pool block."
    },
    {
      "name": "- retainCount",
      "desc": "Do not use this method."
    },
    {
      "name": "- zone",
      "desc": "Zones are deprecated and ignored by most classes that have it as a parameter."
    }
  ],
  "declaration": "@protocol NSObject"
}