{
  "path": "/documentation/passkit/pkpaymentbuttontype",
  "type": "Enumeration",
  "name": "PKPaymentButtonType",
  "desc": "The Apple Pay button types you can display to initiate Apple Pay transactions.",
  "items": [
    {
      "name": "case plain",
      "desc": "An Apple Pay button with the Apple Pay logo only, useful when an additional call to action isn't needed."
    },
    {
      "name": "case buy",
      "desc": "An Apple Pay button useful for product purchases."
    },
    {
      "name": "case addMoney",
      "desc": "An Apple Pay button useful for adding money to a card, account, or payment system."
    },
    {
      "name": "case book",
      "desc": "An Apple Pay button useful for booking trips, flights, or other experiences."
    },
    {
      "name": "case checkout",
      "desc": "An Apple Pay button useful for purchase experiences that include other payment buttons that start with “Check out”."
    },
    {
      "name": "case `continue`",
      "desc": "An Apple Pay button useful for general purchases."
    },
    {
      "name": "case contribute",
      "desc": "An Apple Pay button useful to help people contribute money to projects, causes, organizations, and other entities."
    },
    {
      "name": "case donate",
      "desc": "An Apple Pay button used by approved nonprofit organization that lets people make donations."
    },
    {
      "name": "case inStore",
      "desc": "An Apple Pay button useful for paying bills or invoices."
    },
    {
      "name": "case order",
      "desc": "An Apple Pay button useful for placing orders for such as like meals or flowers."
    },
    {
      "name": "case reload",
      "desc": "An Apple Pay button useful for adding money to a card, account, or payment system."
    },
    {
      "name": "case rent",
      "desc": "An Apple Pay button useful for renting items such as cars or scooters."
    },
    {
      "name": "case setUp",
      "desc": "An Apple Pay button useful for prompting the user to set up a card."
    },
    {
      "name": "case subscribe",
      "desc": "An Apple Pay button useful for purchasing a subscription such as a gym membership or meal-kit delivery service."
    },
    {
      "name": "case support",
      "desc": "An Apple Pay button useful supporting people give money to projects, causes, organizations, and other entities."
    },
    {
      "name": "case tip",
      "desc": "An Apple Pay button useful useful for letting people tip for goods or services."
    },
    {
      "name": "case topUp",
      "desc": "An Apple Pay button useful for adding money to a card, account, or payment system."
    }
  ],
  "declaration": "enum PKPaymentButtonType : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}