{
  "path": "/documentation/corefoundation/cfstringinlinebuffer",
  "type": "Structure",
  "name": "CFStringInlineBuffer",
  "desc": "Defines the buffer and related fields used for in-line buffer access of characters in CFString objects.",
  "items": [
    {
      "name": "init()"
    },
    {
      "name": "init(buffer: (UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar), theString: Unmanaged<CFString>!, directUniCharBuffer: UnsafePointer<UniChar>!, directCStringBuffer: UnsafePointer<CChar>!, rangeToBuffer: CFRange, bufferedRangeStart: CFIndex, bufferedRangeEnd: CFIndex)"
    },
    {
      "name": "var buffer: (UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar, UniChar)"
    },
    {
      "name": "var bufferedRangeEnd: CFIndex"
    },
    {
      "name": "var bufferedRangeStart: CFIndex"
    },
    {
      "name": "var directCStringBuffer: UnsafePointer<CChar>!"
    },
    {
      "name": "var directUniCharBuffer: UnsafePointer<UniChar>!"
    },
    {
      "name": "var rangeToBuffer: CFRange"
    },
    {
      "name": "var theString: Unmanaged<CFString>!"
    }
  ],
  "declaration": "struct CFStringInlineBuffer"
}