{
  "path": "/documentation/xctest/xcuielement/elementtype",
  "type": "Enumeration",
  "name": "XCUIElement.ElementType",
  "desc": "The types of UI element that you find, inspect, and interact with in a UI test.",
  "items": [
    {
      "name": "case activityIndicator",
      "desc": "A constant that represents an element type for activity indicator views."
    },
    {
      "name": "case alert",
      "desc": "A constant that represents an element type for alert views."
    },
    {
      "name": "case any",
      "desc": "A constant that represents an element type for any view or control."
    },
    {
      "name": "case application",
      "desc": "A constant that represents an element type for an application."
    },
    {
      "name": "case browser",
      "desc": "A constant that represents an element type for a browser."
    },
    {
      "name": "case button",
      "desc": "A constant that represents an element type for button controls."
    },
    {
      "name": "case cell",
      "desc": "A constant that represents an element type for cells."
    },
    {
      "name": "case checkBox",
      "desc": "A constant that represents an element type for checkbox controls."
    },
    {
      "name": "case collectionView",
      "desc": "A constant that represents an element type for collection views."
    },
    {
      "name": "case colorWell",
      "desc": "A constant that represents an element type for color well controls."
    },
    {
      "name": "case comboBox",
      "desc": "A constant that represents an element type for combo box controls."
    },
    {
      "name": "case datePicker",
      "desc": "A constant that represents an element type for date picker controls."
    },
    {
      "name": "case decrementArrow",
      "desc": "A constant that represents an element type for decrement arrow controls."
    },
    {
      "name": "case dialog",
      "desc": "A constant that represents an element type for dialog views."
    },
    {
      "name": "case disclosureTriangle",
      "desc": "A constant that represents an element type for disclosure triangle controls."
    },
    {
      "name": "case dockItem",
      "desc": "A constant that represents an element type for dock item controls."
    },
    {
      "name": "case drawer",
      "desc": "A constant that represents an element type for drawers."
    },
    {
      "name": "case grid",
      "desc": "A constant that represents an element type for grid views."
    },
    {
      "name": "case group",
      "desc": "A constant that represents an element type for groups."
    },
    {
      "name": "case handle",
      "desc": "A constant that represents an element type for handle controls."
    },
    {
      "name": "case helpTag",
      "desc": "A constant that represents an element type for help tags."
    },
    {
      "name": "case icon",
      "desc": "A constant that represents an element type for icons."
    },
    {
      "name": "case image",
      "desc": "A constant that represents an element type for image views."
    },
    {
      "name": "case incrementArrow",
      "desc": "A constant that represents an element type for increment arrow controls."
    },
    {
      "name": "case key",
      "desc": "A constant that represents an element type for keys."
    },
    {
      "name": "case keyboard",
      "desc": "A constant that represents an element type for keyboards."
    },
    {
      "name": "case layoutArea",
      "desc": "A constant that represents an element type for layout areas."
    },
    {
      "name": "case layoutItem",
      "desc": "A constant that represents an element type for layout items."
    },
    {
      "name": "case levelIndicator",
      "desc": "A constant that represents an element type for level indicators."
    },
    {
      "name": "case link",
      "desc": "A constant that represents an element type for links."
    },
    {
      "name": "case map",
      "desc": "A constant that represents an element type for map views."
    },
    {
      "name": "case matte",
      "desc": "A constant that represents an element type for mattes."
    },
    {
      "name": "case menu",
      "desc": "A constant that represents an element type for menus."
    },
    {
      "name": "case menuBar",
      "desc": "A constant that represents an element type for menu bars."
    },
    {
      "name": "case menuBarItem",
      "desc": "A constant that represents an element type for menu bar items."
    },
    {
      "name": "case menuButton",
      "desc": "A constant that represents an element type for menu buttons."
    },
    {
      "name": "case menuItem",
      "desc": "A constant that represents an element type for menu items."
    },
    {
      "name": "case navigationBar",
      "desc": "A constant that represents an element type for navigation bars."
    },
    {
      "name": "case other",
      "desc": "A constant that represents an element type for other views or controls."
    },
    {
      "name": "case outline",
      "desc": "A constant that represents an element type for outline views."
    },
    {
      "name": "case outlineRow",
      "desc": "A constant that represents an element type for outline rows."
    },
    {
      "name": "case pageIndicator",
      "desc": "A constant that represents an element type for page indicator controls."
    },
    {
      "name": "case picker",
      "desc": "A constant that represents an element type for picker controls."
    },
    {
      "name": "case pickerWheel",
      "desc": "A constant that represents an element type for picker wheel controls."
    },
    {
      "name": "case popUpButton",
      "desc": "A constant that represents an element type for popup button controls."
    },
    {
      "name": "case popover",
      "desc": "A constant that represents an element type for popover views."
    },
    {
      "name": "case progressIndicator",
      "desc": "A constant that represents an element type for progress indicator controls."
    },
    {
      "name": "case radioButton",
      "desc": "A constant that represents radio button controls."
    },
    {
      "name": "case radioGroup",
      "desc": "A constant that represents an element type for radio groups."
    },
    {
      "name": "case ratingIndicator",
      "desc": "A constant that represents an element type for rating indicator views."
    },
    {
      "name": "case relevanceIndicator",
      "desc": "A constant that represents an element type for relevance indicator views."
    },
    {
      "name": "case ruler",
      "desc": "A constant that represents an element type for ruler views."
    },
    {
      "name": "case rulerMarker",
      "desc": "A constant that represents an element type for ruler markers."
    },
    {
      "name": "case scrollBar",
      "desc": "A constant that represents an element type for scroll bars."
    },
    {
      "name": "case scrollView",
      "desc": "A constant that represents an element type for scroll views."
    },
    {
      "name": "case searchField",
      "desc": "A constant that represents an element type for search fields."
    },
    {
      "name": "case secureTextField",
      "desc": "A constant that represents an element type for secure text fields."
    },
    {
      "name": "case segmentedControl",
      "desc": "A constant that represents an element type for segmented controls."
    },
    {
      "name": "case sheet",
      "desc": "A constant that represents an element type for sheets."
    },
    {
      "name": "case slider",
      "desc": "A constant that represents an element type for slider controls."
    },
    {
      "name": "case splitGroup",
      "desc": "A constant that represents an element type for split groups."
    },
    {
      "name": "case splitter",
      "desc": "A constant that represents an element type for splitters."
    },
    {
      "name": "case staticText",
      "desc": "A constant that represents an element type for static text views."
    },
    {
      "name": "case statusBar",
      "desc": "A constant that represents an element type for status bars."
    },
    {
      "name": "case statusItem",
      "desc": "A constant that represents an element type for status items."
    },
    {
      "name": "case stepper",
      "desc": "A constant that represents an element type for stepper controls."
    },
    {
      "name": "case `switch`",
      "desc": "A constant that represents an element type for switch controls."
    },
    {
      "name": "case tab",
      "desc": "A constant that represents an element type for tabs."
    },
    {
      "name": "case tabBar",
      "desc": "A constant that represents an element type for tab bars."
    },
    {
      "name": "case tabGroup",
      "desc": "A constant that represents an element type for tab groups."
    },
    {
      "name": "case table",
      "desc": "A constant that represents an element type for table views."
    },
    {
      "name": "case tableColumn",
      "desc": "A constant that represents an element type for table columns."
    },
    {
      "name": "case tableRow",
      "desc": "A constant that represents an element type for table rows."
    },
    {
      "name": "case textField",
      "desc": "A constant that represents an element type for text fields."
    },
    {
      "name": "case textView",
      "desc": "A constant that represents an element type for text views."
    },
    {
      "name": "case timeline",
      "desc": "A constant that represents an element type for timeline views."
    },
    {
      "name": "case toggle",
      "desc": "A constant that represents an element type for toggle controls."
    },
    {
      "name": "case toolbar",
      "desc": "A constant that represents an element type for toolbars."
    },
    {
      "name": "case toolbarButton",
      "desc": "A constant that represents an element type for toolbar buttons."
    },
    {
      "name": "case valueIndicator",
      "desc": "A constant that represents an element type for value indicators."
    },
    {
      "name": "case webView",
      "desc": "A constant that represents an element type for web views."
    },
    {
      "name": "case window",
      "desc": "A constant that represents an element type for windows."
    },
    {
      "name": "case touchBar",
      "desc": "A constant that represents an element type for touch bars."
    }
  ],
  "declaration": "enum ElementType : UInt, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}