{
  "path": "/documentation/apple_news/imagefill",
  "type": "Object",
  "name": "ImageFill",
  "desc": "The object for adding an image background fill to a component.",
  "items": [
    {
      "name": "URL",
      "desc": "The URL of the image file to use for filling the component.Image URLs can begin with http://, https://, or bundle://. If the image URL begins with bundle://, the referenced image file must be in the same directory as the document.Image filenames should be properly encoded as URLsSee Preparing Image, Video, Audio, Music, and ARKit Assets."
    },
    {
      "name": "attachment",
      "desc": "A string that indicates how the fill should behave when a user scrolls. Valid values:scroll (default). The fill scrolls along with its component.fixed. The fill stays at a fixed position within the viewport."
    },
    {
      "name": "fillMode",
      "desc": "Indicates how the image fill should be displayed. Valid values:fit: Scales the image by aspect ratio to fit the component. cover:(default): Scales the image by aspect ratio to completely fill the component."
    },
    {
      "name": "horizontalAlignment",
      "desc": "Sets the horizontal alignment of the image fill within its component.Valid values:left: Aligns the left edge of the fill with the left edge of the component. center (default): Aligns the horizontal center of the fill with the center of the component. right: Aligns the right edge of the fill with the right edge of the component. You can use fillMode with horizontalAlignment to achieve the effect you want. For example, set fillMode to fit and horizontalAlignment to left to fit the image based on its aspect ratio and also align the left edge of the fill with the left edge of the component. Or set fillMode to cover and horizontalAlignment to right to scale the image horizontally and also align the right edge of the fill with the right edge of the component."
    },
    {
      "name": "type",
      "desc": "The type of fill to apply. This property should always be set to image."
    },
    {
      "name": "verticalAlignment",
      "desc": "Sets the vertical alignment of the image fill within its component.Valid values:top: Aligns the top of the fill with the top edge of the component. center (default): Aligns the vertical center of the fill with the center of the component. bottom: Aligns the bottom of the fill with the bottom edge of the component. You can use fillMode with verticalAlignment to achieve the effect you want. For example, set fillMode to fit and verticalAlignment to top to fit the image based on its aspect ratio and also align the top of the fill with the top edge of the component. Or set fillMode to cover and verticalAlignment to top to scale the image vertically and also align the top of the fill with the top edge of the component."
    }
  ],
  "inheritsFrom": [
    "Fill"
  ]
}