{
  "path": "/documentation/appkit/nscolorspace",
  "type": "Class",
  "name": "NSColorSpace",
  "desc": "An object that represents a custom color space.",
  "items": [
    {
      "name": "class var deviceRGB: NSColorSpace",
      "desc": "A color space object that represents a calibrated or device-dependent RGB color space."
    },
    {
      "name": "class var genericRGB: NSColorSpace",
      "desc": "A color space object that represents a device-independent RGB color space."
    },
    {
      "name": "class var deviceCMYK: NSColorSpace",
      "desc": "A color space object that represents a calibrated or device-dependent CMYK color space."
    },
    {
      "name": "class var genericCMYK: NSColorSpace",
      "desc": "A color space object that represents a device-independent CMYK color space."
    },
    {
      "name": "class var deviceGray: NSColorSpace",
      "desc": "A color space object that represents a calibrated or device-dependent gray color space."
    },
    {
      "name": "class var genericGray: NSColorSpace",
      "desc": "A color space object that represents a device-independent gray color space."
    },
    {
      "name": "class var sRGB: NSColorSpace",
      "desc": "A color space object that represents an sRGB color space."
    },
    {
      "name": "class var extendedSRGB: NSColorSpace",
      "desc": "A color space object that represents an extended sRGB color space."
    },
    {
      "name": "class var displayP3: NSColorSpace",
      "desc": "A color space object that represents a P3 Display color space."
    },
    {
      "name": "class var genericGamma22Gray: NSColorSpace",
      "desc": "A color space object that represents a gray color space with a gamma value of 2.2."
    },
    {
      "name": "class var extendedGenericGamma22Gray: NSColorSpace",
      "desc": "A color space object that represents an extended gray color space with a gamma value of 2.2."
    },
    {
      "name": "class var adobeRGB1998: NSColorSpace",
      "desc": "A color space object that represents an Adobe RGB (1998) color space."
    },
    {
      "name": "class func availableColorSpaces(with: NSColorSpace.Model) -> [NSColorSpace]",
      "desc": "Returns the list of color spaces available on the system that are displayed in the color panel, in the order they are displayed in the color panel."
    },
    {
      "name": "init?(cgColorSpace: CGColorSpace)",
      "desc": "Initializes and returns a color space object initialized from a Core Graphics color-space object."
    },
    {
      "name": "init?(colorSyncProfile: UnsafeMutableRawPointer)",
      "desc": "Initializes and returns a color space object from the specified ColorSync profile."
    },
    {
      "name": "init?(iccProfileData: Data)",
      "desc": "Initializes and returns a color space object from the specified ICC profile."
    },
    {
      "name": "var cgColorSpace: CGColorSpace?",
      "desc": "The Core Graphics color-space object that represents a color space equivalent to the color space’s."
    },
    {
      "name": "var colorSpaceModel: NSColorSpace.Model",
      "desc": "The model on which the color space is based."
    },
    {
      "name": "enum NSColorSpace.Model",
      "desc": "Constants that describe the abstract model on which color space objects are based."
    },
    {
      "name": "var colorSyncProfile: UnsafeMutableRawPointer?",
      "desc": "The ColorSync profile from which the color space was created."
    },
    {
      "name": "var iccProfileData: Data?",
      "desc": "The ICC profile data from which the color space was created."
    },
    {
      "name": "var localizedName: String?",
      "desc": "The localized name of the color space."
    },
    {
      "name": "var numberOfColorComponents: Int",
      "desc": "The number of components, excluding alpha, the color space supports."
    }
  ],
  "declaration": "class NSColorSpace : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSSecureCoding"
  ]
}