{
  "path": "/documentation/swiftui/navigationlink",
  "type": "Structure",
  "name": "NavigationLink",
  "desc": "A view that controls a navigation presentation.",
  "items": [
    {
      "name": "init(LocalizedStringKey, destination: () -> Destination)",
      "desc": "Creates a navigation link that presents a destination view, with a text label that the link generates from a localized string key."
    },
    {
      "name": "init<S>(S, destination: () -> Destination)",
      "desc": "Creates a navigation link that presents a destination view, with a text label that the link generates from a title string."
    },
    {
      "name": "init(destination: () -> Destination, label: () -> Label)",
      "desc": "Creates a navigation link that presents the destination view."
    },
    {
      "name": "init(destinationName: String, label: () -> Label)",
      "desc": "Creates a navigation link that presents a view from a WatchKit storyboard."
    },
    {
      "name": "init(LocalizedStringKey, isActive: Binding<Bool>, destination: () -> Destination)",
      "desc": "Creates a navigation link that presents a destination view when active, with a text label that the link generates from a localized string key."
    },
    {
      "name": "init<S>(S, isActive: Binding<Bool>, destination: () -> Destination)",
      "desc": "Creates a navigation link that presents a destination view when active, with a text label that the link generates from a title string."
    },
    {
      "name": "init(isActive: Binding<Bool>, destination: () -> Destination, label: () -> Label)",
      "desc": "Creates a navigation link that presents the destination view when active."
    },
    {
      "name": "init(destinationName: String, isActive: Binding<Bool>, label: () -> Label)",
      "desc": "Creates a navigation link that presents a view from a WatchKit storyboard when active."
    },
    {
      "name": "init<V>(LocalizedStringKey, tag: V, selection: Binding<V?>, destination: () -> Destination)",
      "desc": "Creates a navigation link that presents a destination view when a bound selection variable matches a value you provide, using a text label that the link generates from a localized string key."
    },
    {
      "name": "init<S, V>(S, tag: V, selection: Binding<V?>, destination: () -> Destination)",
      "desc": "Creates a navigation link that presents a destination view when a bound selection variable matches a value you provide, using a text label that the link generates from a title string."
    },
    {
      "name": "init<V>(tag: V, selection: Binding<V?>, destination: () -> Destination, label: () -> Label)",
      "desc": "Creates a navigation link that presents the destination view when a bound selection variable equals a given tag value."
    },
    {
      "name": "init<V>(destinationName: String, tag: V, selection: Binding<V?>, label: () -> Label)",
      "desc": "Creates a navigation link that presents a view from a WatchKit storyboard when a bound selection variable matches a value you provide."
    },
    {
      "name": "func isDetailLink(Bool) -> some View",
      "desc": "Sets the navigation link to present its destination as the detail component of the containing navigation view."
    },
    {
      "name": "var body: some View",
      "desc": "The content and behavior of the view."
    },
    {
      "name": "typealias Body",
      "desc": "The type of view representing the body of this view."
    }
  ],
  "declaration": "struct NavigationLink<Label, Destination> where Label : View, Destination : View",
  "conformsTo": [
    "View"
  ]
}