{
  "path": "/documentation/coretext/ctparagraphstylespecifier",
  "type": "Enumeration",
  "name": "CTParagraphStyleSpecifier",
  "desc": "Constants used to query and modify a paragraph style object.",
  "items": [
    {
      "name": "case alignment",
      "desc": "The text alignment."
    },
    {
      "name": "case firstLineHeadIndent",
      "desc": "The distance, in points, from the leading margin of a frame to the beginning of the paragraph's first line."
    },
    {
      "name": "case headIndent",
      "desc": "The distance, in points, from the leading margin of a text container to the beginning of lines other than the first."
    },
    {
      "name": "case tailIndent",
      "desc": "The distance, in points, from the margin of a frame to the end of lines."
    },
    {
      "name": "case tabStops",
      "desc": "The text tab objects, sorted by location, that define the tab stops for the paragraph style."
    },
    {
      "name": "case defaultTabInterval",
      "desc": "The document-wide default tab interval."
    },
    {
      "name": "case lineBreakMode",
      "desc": "The mode that should be used to break lines when laying out the paragraph's text."
    },
    {
      "name": "case lineHeightMultiple",
      "desc": "The line height multiple."
    },
    {
      "name": "case maximumLineHeight",
      "desc": "The maximum height that any line in the frame will occupy, regardless of the font size or size of any attached graphic."
    },
    {
      "name": "case minimumLineHeight",
      "desc": "The minimum height that any line in the frame will occupy, regardless of the font size or size of any attached graphic."
    },
    {
      "name": "case paragraphSpacing",
      "desc": "The space added at the end of the paragraph to separate it from the following paragraph."
    },
    {
      "name": "case paragraphSpacingBefore",
      "desc": "The distance between the paragraph's top and the beginning of its text content."
    },
    {
      "name": "case baseWritingDirection",
      "desc": "The base writing direction of the lines."
    },
    {
      "name": "case maximumLineSpacing",
      "desc": "The maximum space in points between lines within the paragraph (commonly known as leading)."
    },
    {
      "name": "case minimumLineSpacing",
      "desc": "The minimum space in points between lines within the paragraph (commonly known as leading)."
    },
    {
      "name": "case lineSpacingAdjustment",
      "desc": "The space in points added between lines within the paragraph (commonly known as leading)."
    },
    {
      "name": "case count",
      "desc": "The number of style specifiers."
    },
    {
      "name": "case lineBoundsOptions",
      "desc": "Options that control the alignment of the line edges with the leading and trailing margins."
    }
  ],
  "declaration": "enum CTParagraphStyleSpecifier : UInt32, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}