{
  "path": "/documentation/systemextensions/ossystemextensionerror/code",
  "type": "Enumeration",
  "name": "OSSystemExtensionError.Code",
  "desc": "Error codes for system extensions.",
  "items": [
    {
      "name": "case unknown",
      "desc": "An error code that indicates an unknown error occurred."
    },
    {
      "name": "case missingEntitlement",
      "desc": "An error code that indicates the system extension lacks a required entitlement."
    },
    {
      "name": "case unsupportedParentBundleLocation",
      "desc": "An error code that indicates the extension’s parent app isn’t in a valid location for activation."
    },
    {
      "name": "case extensionNotFound",
      "desc": "An error code that indicates the manager can’t find the system extension."
    },
    {
      "name": "case extensionMissingIdentifier",
      "desc": "An error code that indicates the extension identifier is missing."
    },
    {
      "name": "case duplicateExtensionIdentifer",
      "desc": "An error code that indicates the extension identifier duplicates an existing identifier."
    },
    {
      "name": "case unknownExtensionCategory",
      "desc": "An error code that indicates the extension manager can’t recognize the extension’s category identifier."
    },
    {
      "name": "case codeSignatureInvalid",
      "desc": "An error code that indicates the extension’s signature is invalid."
    },
    {
      "name": "case validationFailed",
      "desc": "An error code that indicates the manager can’t validate the extension."
    },
    {
      "name": "case forbiddenBySystemPolicy",
      "desc": "An error code that indicates the system policy prohibits activating the system extension."
    },
    {
      "name": "case requestCanceled",
      "desc": "An error code that indicates the system extension manager request was canceled."
    },
    {
      "name": "case requestSuperseded",
      "desc": "An error code that indicates the system extension request failed because the system already has a pending request for the same identifier."
    },
    {
      "name": "case authorizationRequired",
      "desc": "An error code that indicates the system was unable to obtain the proper authorization."
    }
  ],
  "declaration": "enum OSSystemExtensionError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}