{
  "path": "/documentation/serialdriverkit/iouserserial",
  "type": "Class",
  "name": "IOUserSerial",
  "desc": "The class for building a service that communicates using a serial connection.",
  "items": [
    {
      "name": "- init",
      "desc": "Handles the basic initialization of the service."
    },
    {
      "name": "- Start",
      "desc": "Starts the current service and associates it with the specified provider."
    },
    {
      "name": "- Stop",
      "desc": "Stops the service associated with the specified provider."
    },
    {
      "name": "- free",
      "desc": "Performs any final cleanup for the service."
    },
    {
      "name": "- initWith",
      "desc": "Initializes the private data structures associated with this class."
    },
    {
      "name": "- HwActivate",
      "desc": "Opens the communication channel to the device."
    },
    {
      "name": "- HwDeactivate",
      "desc": "Closes the communication channel to the device."
    },
    {
      "name": "- ConnectQueues",
      "desc": "Creates and configures the buffers that store the data moving to and from the device."
    },
    {
      "name": "- DisconnectQueues",
      "desc": "Releases the buffers that manage data moving to and from the device."
    },
    {
      "name": "- HwGetModemStatus",
      "desc": "Gets the current status of the modem from the hardware."
    },
    {
      "name": "- SetModemStatus",
      "desc": "Sets the modem status to the specified values."
    },
    {
      "name": "- HwResetFIFO",
      "desc": "Sends a command to reset the specified device queues."
    },
    {
      "name": "- HwSendBreak",
      "desc": "Sends a linebreak command to the device."
    },
    {
      "name": "- HwProgramBaudRate",
      "desc": "Sets the communication baud rate to the specified value."
    },
    {
      "name": "- HwProgramLatencyTimer",
      "desc": "Sets the amount of time to wait before sending the current buffer to the device."
    },
    {
      "name": "- HwProgramMCR",
      "desc": "Configure the setings for the device's modem control register (MCR)."
    },
    {
      "name": "- HwProgramUART",
      "desc": "Configure the settings for the device's universal asynchronous receiver/transmitter (UART)."
    },
    {
      "name": "- RxDataAvailable",
      "desc": "Notifies the system that data from the device is now available."
    },
    {
      "name": "- RxFreeSpaceAvailable",
      "desc": "Notifies your driver that buffer space is available for your device's data."
    },
    {
      "name": "- TxDataAvailable",
      "desc": "Notifies your driver that the system has data for you to transmit to the device."
    },
    {
      "name": "- TxFreeSpaceAvailable",
      "desc": "Notifies the system that the device is ready to accept more data."
    },
    {
      "name": "- RxError",
      "desc": "Reports errors that occurred when receiving data from the device."
    },
    {
      "name": "- HwProgramFlowControl"
    }
  ],
  "declaration": "class IOUserSerial : IOService",
  "inheritsFrom": [
    "IOService"
  ]
}