{
  "path": "/documentation/foundation/nsunarchiver",
  "type": "Class",
  "name": "NSUnarchiver",
  "desc": "A decoder that restores data from an archive.",
  "items": [
    {
      "name": "init?(forReadingWith: Data)",
      "desc": "Returns an NSUnarchiver object initialized to read an archive from a given data object."
    },
    {
      "name": "class func unarchiveObject(with: Data) -> Any?",
      "desc": "Decodes and returns the object archived in a given NSData object."
    },
    {
      "name": "class func unarchiveObject(withFile: String) -> Any?",
      "desc": "Decodes and returns the object archived in the file path."
    },
    {
      "name": "var isAtEnd: Bool",
      "desc": "A Boolean value that indicates whether the receiver has reached the end of the encoded data while decoding."
    },
    {
      "name": "var systemVersion: UInt32",
      "desc": "The system version number in effect when the archive was created."
    },
    {
      "name": "class func classNameDecoded(forArchiveClassName: String) -> String",
      "desc": "Returns the name of the class used when instantiating objects whose ostensible class, according to the archived data, is a given name."
    },
    {
      "name": "class func decodeClassName(String, asClassName: String)",
      "desc": "Instructs instances of NSUnarchiver to use the class with a given name when instantiating objects whose ostensible class, according to the archived data, is another given name."
    },
    {
      "name": "func classNameDecoded(forArchiveClassName: String) -> String",
      "desc": "Returns the name of the class that will be used when instantiating objects whose ostensible class, according to the archived data, is a given name."
    },
    {
      "name": "func decodeClassName(String, asClassName: String)",
      "desc": "Instructs the receiver to use the class with a given name when instantiating objects whose ostensible class, according to the archived data, is another given name."
    },
    {
      "name": "func replace(Any, with: Any)",
      "desc": "Causes the receiver to substitute one given object for another whenever the latter is extracted from the archive."
    }
  ],
  "declaration": "class NSUnarchiver : NSCoder",
  "inheritsFrom": [
    "NSCoder"
  ]
}