{
  "path": "/documentation/modelio/mdlphysicallyplausiblescatteringfunction",
  "type": "Class",
  "name": "MDLPhysicallyPlausibleScatteringFunction",
  "desc": "A set of material properties that describes a physically realistic shading model for materials.",
  "items": [
    {
      "name": "var subsurface: MDLMaterialProperty",
      "desc": "The degree to which light scatters under the surface of the material."
    },
    {
      "name": "var metallic: MDLMaterialProperty",
      "desc": "The degree to which the material appears as a dielectric surface (lower values) or as a metal (higher values)."
    },
    {
      "name": "var specularAmount: MDLMaterialProperty",
      "desc": "The tendency of the material to generate specular highlights."
    },
    {
      "name": "var specularTint: MDLMaterialProperty",
      "desc": "The balance of color for specular highlights, between the light color (lower values) and the material’s base color (at higher values)."
    },
    {
      "name": "var roughness: MDLMaterialProperty",
      "desc": "The degree to which a material appears smooth, affecting both diffuse and specular response."
    },
    {
      "name": "var anisotropic: MDLMaterialProperty",
      "desc": "The degree to which specular highlights elongate in the direction of the local tangent basis."
    },
    {
      "name": "var anisotropicRotation: MDLMaterialProperty",
      "desc": "The angle at which anisotropic effects are rotated relative to the local tangent basis."
    },
    {
      "name": "var sheen: MDLMaterialProperty",
      "desc": "The intensity of highlights that appear only at glancing angles on a material’s surface."
    },
    {
      "name": "var sheenTint: MDLMaterialProperty",
      "desc": "The balance of color for highlights that appear only at glancing angles, between the light color (lower values) and the material’s base color (at higher values)."
    },
    {
      "name": "var clearcoat: MDLMaterialProperty",
      "desc": "The intensity of a second specular highlight, similar to the gloss that results from a clear coat on an automotive finish."
    },
    {
      "name": "var clearcoatGloss: MDLMaterialProperty",
      "desc": "The sharpness of a second specular highlight, similar to the gloss that results from a clear coat on an automotive finish."
    },
    {
      "name": "var version: Int"
    }
  ],
  "declaration": "class MDLPhysicallyPlausibleScatteringFunction : MDLScatteringFunction",
  "inheritsFrom": [
    "MDLScatteringFunction"
  ]
}