{
  "path": "/documentation/apple_news/text",
  "type": "Object",
  "name": "Text",
  "desc": "Properties shared by all text component types.",
  "items": [
    {
      "name": "role",
      "desc": "The role of a text component depends on the type of content it contains. For example, a PullQuote should have a role of pullquote, and for text in the article body, the role should be body. See Component."
    },
    {
      "name": "text",
      "desc": "The text to display in the article, including any formatting tags depending on the format property. You can also use a subset of HTML tags or Markdown syntax by setting format to html or markdown, respectively. See Using HTML with Apple News Format. Alternatively, you can style ranges of text individually using the InlineTextStyle object."
    },
    {
      "name": "additions",
      "desc": "An array of all the additions that should be applied to ranges of the component's text.Additions are ignored when format is set to html or markdown."
    },
    {
      "name": "anchor",
      "desc": "An object that defines vertical alignment with another component."
    },
    {
      "name": "animation",
      "desc": "An object that defines an animation to be applied to the component.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "behavior",
      "desc": "An object that defines behavior for a component, like Parallax or Springy.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "conditional",
      "desc": "An instance or array of text component properties that can be applied conditionally, and the conditions that cause them to be applied."
    },
    {
      "name": "format",
      "desc": "The formatting or markup method applied to the text. If format is set to html or markdown, neither Additions nor InlineTextStyles are supported."
    },
    {
      "name": "hidden",
      "desc": "A Boolean value that determines whether the component is hidden."
    },
    {
      "name": "identifier",
      "desc": "An optional unique identifier for this component. If used, this identifier must be unique across the entire document. You will need an identifier for your component if you want to anchor other components to it."
    },
    {
      "name": "inlineTextStyles",
      "desc": "An array of InlineTextStyle objects you can use to apply different text styles to ranges of text. For each InlineTextStyle, you should supply a rangeStart, rangeLength, and either a text style or the identifier of a text style that is defined at the top level of the document.InlineTextStyles are ignored when format is set to html or markdown.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "layout",
      "desc": "An inline ComponentLayout object that contains layout information, or a string reference to a ComponentLayout that is defined at the top level of the document. If layout is not defined, size and position are based on various factors, such as the device type, the length of the content, and the role of this component."
    },
    {
      "name": "style",
      "desc": "An inline ComponentStyle object that defines the appearance of this component, or a string reference to a ComponentStyle object that is defined at the top level of the document.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "textStyle",
      "desc": "An inline ComponentTextStyle object that contains styling information, or a string reference to a ComponentTextStyle object that is defined at the top level of the document."
    }
  ],
  "inheritsFrom": [
    "Component"
  ]
}