{
  "path": "/documentation/apple_search_ads/campaign",
  "type": "Object",
  "name": "Campaign",
  "desc": "The response to a request to create and fetch campaigns.",
  "items": [
    {
      "name": "adamId",
      "desc": "Your unique App Store app identifier. You can obtain your app adamId through Search for iOS Apps.You can use the EQUALS and IN selector Condition operators with Find Campaigns."
    },
    {
      "name": "adChannelType",
      "desc": "The channel type of ad in a campaign. See AdChannelType for value descriptions.See also the supplySources parameter description.You can use the EQUALS selector Condition operator with Find Campaigns and Get Campaign-Level Reports."
    },
    {
      "name": "billingEvent",
      "desc": "The type of billing event for a campaign.See BillingEventType for value descriptions.See also the supplySources parameter description."
    },
    {
      "name": "budgetAmount",
      "desc": "The total budget amount available to the campaign. You can’t reduce a budgetAmount after you start a campaign.When you set a budget, your campaign runs until you exhaust your budget, pause your campaign, or reach the scheduled end date.You can use the EQUALS, LESS_THAN, and GREATER_THAN selector Condition operators with Find Campaigns.This field is updatable."
    },
    {
      "name": "budgetOrders",
      "desc": "The budget orders that you assign to the campaign. This applies only to campaigns with a line-of-credit payment model. You can also use budget orders to manage how to spend your budget across multiple campaigns. This field is updatable."
    },
    {
      "name": "countriesOrRegions",
      "desc": "The App Store geoterritories where you’re promoting your app. The default value is US. This field requires an alpha-2 country code value, such as US, for the locations you’re promoting to.The EQUALS, CONTAINS_ANY, and CONTAINS_ALL selector Condition operators are available to use with Find Campaigns.This field is updatable."
    },
    {
      "name": "countryOrRegionServingStateReasons",
      "desc": "The map of reasons that returns when a campaign isn’t running.See CampaignCountryOrRegionsServingStateReasons for value descriptions."
    },
    {
      "name": "dailyBudgetAmount",
      "desc": "Your daily spend cap. If you reach the daily spend cap, a campaign pauses for the remainder of the day.You can use the EQUALS, LESS_THAN, and GREATER_THAN selector Condition operators with Find Campaigns.This field is updatable."
    },
    {
      "name": "deleted",
      "desc": "The indicator of whether the campaign is soft-deleted.You can use the EQUALS and IN selector Condition operators with Find Campaigns."
    },
    {
      "name": "displayStatus",
      "desc": "The status of the campaign. The status resolves according to servingStatus and additional criteria."
    },
    {
      "name": "endTime",
      "desc": "The scheduled end date and time for the ad group, which the system determines from the ad group with the latest end time in the campaign. If a campaign doesn’t have an ad group, the response is null."
    },
    {
      "name": "id",
      "desc": "A unique identifier for the campaign that you can use as a campaignid in endpoint resources.You can use the EQUALS and IN selector Condition operators with Find Campaigns."
    },
    {
      "name": "locInvoiceDetails",
      "desc": "The standard invoice details that you can set and edit using the LOCInvoiceDetails object.This field is updatable."
    },
    {
      "name": "modificationTime",
      "desc": "The date and time of the most recent modification of the object.You can use the EQUALS, LESS_THAN, and GREATER_THAN selector Condition operators with Find Campaigns."
    },
    {
      "name": "name",
      "desc": "The name of the campaign, which is unique within an organization.You can use the EQUALS, IN, and STARTSWITH selector Condition operators with Find Campaigns.This field is updatable."
    },
    {
      "name": "orgId",
      "desc": "The identifier of the organization that owns the campaign. Your orgId is the same as your account in the Apple Search Ads UI."
    },
    {
      "name": "paymentModel",
      "desc": "The payment model that you set through the Search Ads UI. If you don’t set a payment model, campaigns can’t run.See PaymentModel for value descriptions.If you don’t select a payment model, you can still create campaigns. You must select a payment model before a campaign is eligible to run.See BudgetOrder for details about setting a payment model.You can use the EQUALS and IN selector Condition operators with Find Campaigns."
    },
    {
      "name": "servingStateReasons",
      "desc": "A list of reasons that displays when a campaign can’t run.See CampaignServingStateReasons for value descriptions."
    },
    {
      "name": "servingStatus",
      "desc": "The status of the campaign.You can use the EQUALS and IN selector Condition operators with Find Campaigns."
    },
    {
      "name": "startTime",
      "desc": "The scheduled start date and time for the campaign, which the system determines from the ad group with the earliest start time in the campaign. If a campaign doesn’t have an ad group, the response is null.You can use the EQUALS, LESS_THAN, and GREATER_THAN selector Condition operators with Find Campaigns."
    },
    {
      "name": "status",
      "desc": "The user-controlled status to enable or pause the campaign.You can use the EQUALS and IN selector Condition operators with Find Campaigns.This field is updatable."
    },
    {
      "name": "supplySources",
      "desc": "The location that an ad is shown in a campaign. See SupplySource for value descriptions.You can use the  EQUALS , CONTAINS_ANY, CONTAINS_ALL selector Condition operators with Find Campaigns."
    }
  ]
}