{
  "path": "/documentation/phase/phasereverbpreset",
  "type": "Enumeration",
  "name": "PHASEReverbPreset",
  "desc": "The manner in which PHASE diffuses resonating sound.",
  "items": [
    {
      "name": "case cathedral",
      "desc": "A resonation that simulates the experience of hearing a sound in a cathedral."
    },
    {
      "name": "case largeChamber",
      "desc": "A resonation that simulates the experience of hearing a sound in a large chamber with specific dimensions."
    },
    {
      "name": "case largeHall",
      "desc": "A resonation that simulates the experience of hearing a sound in a large hall with specific dimensions."
    },
    {
      "name": "case largeHall2",
      "desc": "A resonation that simulates the experience of hearing a sound in one kind of large hall with specific dimensions."
    },
    {
      "name": "case largeRoom",
      "desc": "A resonation that simulates the experience of hearing a sound in a large room with specific dimensions."
    },
    {
      "name": "case largeRoom2",
      "desc": "A resonation that simulates the experience of hearing a sound in one kind of large room with specific dimensions."
    },
    {
      "name": "case mediumChamber",
      "desc": "A resonation that simulates the experience of hearing a sound in a medium-size chamber with specific dimensions."
    },
    {
      "name": "case mediumHall",
      "desc": "A resonation that simulates the experience of hearing a sound in a medium-size hall with specific dimensions."
    },
    {
      "name": "case mediumHall2",
      "desc": "A resonation that simulates the experience of hearing a sound in one kind of medium-size hall with specific dimensions."
    },
    {
      "name": "case mediumHall3",
      "desc": "A resonation that simulates the experience of hearing a sound in another kind of medium-size hall with specific dimensions."
    },
    {
      "name": "case mediumRoom",
      "desc": "A resonation that simulates the experience of hearing a sound in a medium-size room with specific dimensions."
    },
    {
      "name": "case none",
      "desc": "An option that adds no reverberation to a sound."
    },
    {
      "name": "case smallRoom",
      "desc": "A resonation that simulates the experience of hearing a sound in a small room with specific dimensions."
    }
  ],
  "declaration": "enum PHASEReverbPreset : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}