{
  "path": "/documentation/gameplaykit/gkgoal",
  "type": "Class",
  "name": "GKGoal",
  "desc": "An influence that motivates the movement of one or more agents.",
  "items": [
    {
      "name": "init(toSeekAgent: GKAgent)",
      "desc": "Creates a goal whose effect is to move an agent toward the current position of the specified other agent."
    },
    {
      "name": "init(toFleeAgent: GKAgent)",
      "desc": "Creates a goal whose effect is to move an agent away from the current position of the specified other agent."
    },
    {
      "name": "init(toReachTargetSpeed: Float)",
      "desc": "Creates a goal whose effect is to accelerate or decelerate an agent until it reaches the specified speed."
    },
    {
      "name": "init(toWander: Float)",
      "desc": "Creates a goal whose effect is to make an agent wander aimlessly, moving forward and turning at random."
    },
    {
      "name": "init(toAvoid: [GKAgent], maxPredictionTime: TimeInterval)",
      "desc": "Creates a goal whose effect is to make an agent avoid colliding with the specified other agents, taking into account the other agents’ movement."
    },
    {
      "name": "init(toAvoid: [GKObstacle], maxPredictionTime: TimeInterval)",
      "desc": "Creates a goal whose effect is to make an agent avoid colliding with the specified static obstacles."
    },
    {
      "name": "init(toInterceptAgent: GKAgent, maxPredictionTime: TimeInterval)",
      "desc": "Creates a goal whose effect is to make an agent pursue the specified other agent, taking into account the target’s movement."
    },
    {
      "name": "init(toSeparateFrom: [GKAgent], maxDistance: Float, maxAngle: Float)",
      "desc": "Creates a goal whose effect is to make an agent maintain the specified distance from other agents in a specified group."
    },
    {
      "name": "init(toAlignWith: [GKAgent], maxDistance: Float, maxAngle: Float)",
      "desc": "Creates a goal whose effect is to make an agent align its orientation with that of other agents in a specified group."
    },
    {
      "name": "init(toCohereWith: [GKAgent], maxDistance: Float, maxAngle: Float)",
      "desc": "Creates a goal whose effect is to make an agent stay near the other agents in a specified group."
    },
    {
      "name": "init(toStayOn: GKPath, maxPredictionTime: TimeInterval)",
      "desc": "Creates a goal whose effect is to maintain an agent’s position within the specified path."
    },
    {
      "name": "init(toFollow: GKPath, maxPredictionTime: TimeInterval, forward: Bool)",
      "desc": "Creates a goal whose effect is to both maintain position on and traverse the specified path."
    }
  ],
  "declaration": "class GKGoal : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCopying"
  ]
}