{
  "path": "/documentation/foundation/fileattributekey",
  "type": "Structure",
  "name": "FileAttributeKey",
  "desc": "Keys in dictionaries used to get and set file attributes.",
  "items": [
    {
      "name": "init(String)",
      "desc": "Creates a file attribute key from a string."
    },
    {
      "name": "init(rawValue: String)",
      "desc": "Creates a file attribute key from a raw value string."
    },
    {
      "name": "static let appendOnly: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates whether the file is read-only."
    },
    {
      "name": "static let busy: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates whether the file is busy."
    },
    {
      "name": "static let creationDate: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file's creation date."
    },
    {
      "name": "static let deviceIdentifier: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the identifier for the device on which the file resides."
    },
    {
      "name": "static let extensionHidden: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates whether the file’s extension is hidden."
    },
    {
      "name": "static let groupOwnerAccountID: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s group ID."
    },
    {
      "name": "static let groupOwnerAccountName: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the group name of the file’s owner."
    },
    {
      "name": "static let hfsCreatorCode: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s HFS creator code."
    },
    {
      "name": "static let hfsTypeCode: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s HFS type code."
    },
    {
      "name": "static let immutable: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates whether the file is mutable."
    },
    {
      "name": "static let modificationDate: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s last modified date."
    },
    {
      "name": "static let ownerAccountID: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s owner's account ID."
    },
    {
      "name": "static let ownerAccountName: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the name of the file’s owner."
    },
    {
      "name": "static let posixPermissions: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s Posix permissions."
    },
    {
      "name": "static let protectionKey: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value identifies the protection level for this file."
    },
    {
      "name": "static let referenceCount: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s reference count."
    },
    {
      "name": "static let size: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s size in bytes."
    },
    {
      "name": "static let systemFileNumber: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s filesystem file number."
    },
    {
      "name": "static let systemFreeNodes: FileAttributeKey",
      "desc": "The key in a file system attribute dictionary whose value indicates the number of free nodes in the file system."
    },
    {
      "name": "static let systemFreeSize: FileAttributeKey",
      "desc": "The key in a file system attribute dictionary whose value indicates the amount of free space on the file system."
    },
    {
      "name": "static let systemNodes: FileAttributeKey",
      "desc": "The key in a file system attribute dictionary whose value indicates the number of nodes in the file system."
    },
    {
      "name": "static let systemNumber: FileAttributeKey",
      "desc": "The key in a file system attribute dictionary whose value indicates the filesystem number of the file system."
    },
    {
      "name": "static let systemSize: FileAttributeKey",
      "desc": "The key in a file system attribute dictionary whose value indicates the size of the file system."
    },
    {
      "name": "static let type: FileAttributeKey",
      "desc": "The key in a file attribute dictionary whose value indicates the file’s type."
    }
  ],
  "declaration": "struct FileAttributeKey, @unchecked Sendable",
  "conformsTo": [
    "Equatable",
    "Hashable",
    "RawRepresentable",
    "Sendable"
  ]
}