{
  "path": "/documentation/uikit/uiblureffect/style",
  "type": "Enumeration",
  "name": "UIBlurEffect.Style",
  "desc": "Blur styles available for blur effect objects.",
  "items": [
    {
      "name": "case systemUltraThinMaterial",
      "desc": "An adaptable blur effect that creates the appearance of an ultra-thin material."
    },
    {
      "name": "case systemThinMaterial",
      "desc": "An adaptable blur effect that creates the appearance of a thin material."
    },
    {
      "name": "case systemMaterial",
      "desc": "An adaptable blur effect that creates the appearance of a material with normal thickness."
    },
    {
      "name": "case systemThickMaterial",
      "desc": "An adaptable blur effect that creates the appearance of a material that’s thicker than normal."
    },
    {
      "name": "case systemChromeMaterial",
      "desc": "An adaptable blur effect that creates the appearance of the system chrome."
    },
    {
      "name": "case systemUltraThinMaterialLight",
      "desc": "A blur effect that creates the appearance of an ultra-thin material and is always light."
    },
    {
      "name": "case systemThinMaterialLight",
      "desc": "A blur effect that creates the appearance of a thin material and is always light."
    },
    {
      "name": "case systemMaterialLight",
      "desc": "A blur effect that creates the appearance of a material with normal thickness and is always light."
    },
    {
      "name": "case systemThickMaterialLight",
      "desc": "A blur effect that creates the appearance of a material that’s thicker than normal and is always light."
    },
    {
      "name": "case systemChromeMaterialLight",
      "desc": "A blur effect that creates the appearance of the system chrome and is always light."
    },
    {
      "name": "case systemUltraThinMaterialDark",
      "desc": "A blur effect that creates the appearance of an ultra-thin material and is always dark."
    },
    {
      "name": "case systemThinMaterialDark",
      "desc": "A blur effect that creates the appearance of a thin material and is always dark."
    },
    {
      "name": "case systemMaterialDark",
      "desc": "A blur effect that creates the appearance of a material with normal thickness and is always dark."
    },
    {
      "name": "case systemThickMaterialDark",
      "desc": "A blur effect that creates the appearance of a material that’s thicker than normal and is always dark."
    },
    {
      "name": "case systemChromeMaterialDark",
      "desc": "A blur effect that creates the appearance of the system chrome and is always dark."
    },
    {
      "name": "case extraLight",
      "desc": "The area of the view is lighter than the underlying view."
    },
    {
      "name": "case light",
      "desc": "The area of the view is the same approximate lightness of the underlying view."
    },
    {
      "name": "case dark",
      "desc": "The area of the view is darker than the underlying view."
    },
    {
      "name": "case extraDark",
      "desc": "The area of the view is even more dark than the underlying view."
    },
    {
      "name": "case regular",
      "desc": "A regular blur style that adapts to the user interface style."
    },
    {
      "name": "case prominent",
      "desc": "A blur style for making content more prominent that adapts to the user interface style."
    }
  ],
  "declaration": "enum Style : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}