{
  "path": "/documentation/uikit/uiattachmentbehavior",
  "type": "Class",
  "name": "UIAttachmentBehavior",
  "desc": "A relationship between two dynamic items, or between a dynamic item and an anchor point.",
  "items": [
    {
      "name": "class func slidingAttachment(with: UIDynamicItem, attachmentAnchor: CGPoint, axisOfTranslation: CGVector) -> Self",
      "desc": "Creates and returns an attachment behavior where one item slides along the specified axis."
    },
    {
      "name": "class func slidingAttachment(with: UIDynamicItem, attachedTo: UIDynamicItem, attachmentAnchor: CGPoint, axisOfTranslation: CGVector) -> Self",
      "desc": "Creates and returns an attachment behavior where two items are fixed to points that slide along the specified axis."
    },
    {
      "name": "class func fixedAttachment(with: UIDynamicItem, attachedTo: UIDynamicItem, attachmentAnchor: CGPoint) -> Self",
      "desc": "Creates and returns an attachment behavior where the two items are fixed together through the specified anchor point."
    },
    {
      "name": "class func limitAttachment(with: UIDynamicItem, offsetFromCenter: UIOffset, attachedTo: UIDynamicItem, offsetFromCenter: UIOffset) -> Self",
      "desc": "Creates and returns an attachment behavior object where two items are constrained by a maximum distance from one another."
    },
    {
      "name": "class func pinAttachment(with: UIDynamicItem, attachedTo: UIDynamicItem, attachmentAnchor: CGPoint) -> Self",
      "desc": "Creates and returns an attachment behavior where the two items are pinned to, and move around, an anchor point"
    },
    {
      "name": "init(item: UIDynamicItem, attachedToAnchor: CGPoint)",
      "desc": "Initializes a behavior where the center of a dynamic item is attached to the specified anchor point."
    },
    {
      "name": "init(item: UIDynamicItem, attachedTo: UIDynamicItem)",
      "desc": "Initializes a behavior where the centers of two dynamic items are attached to each other."
    },
    {
      "name": "init(item: UIDynamicItem, offsetFromCenter: UIOffset, attachedToAnchor: CGPoint)",
      "desc": "Initializes a behavior where the specified point in a dynamic item is attached to an anchor point."
    },
    {
      "name": "init(item: UIDynamicItem, offsetFromCenter: UIOffset, attachedTo: UIDynamicItem, offsetFromCenter: UIOffset)",
      "desc": "Initializes an attachment behavior that connects a specified point in one dynamic item to a specified point in another dynamic item."
    },
    {
      "name": "var items: [UIDynamicItem]",
      "desc": "The dynamic items connected by the attachment behavior."
    },
    {
      "name": "var anchorPoint: CGPoint",
      "desc": "The anchor point for the attachment behavior, if any."
    },
    {
      "name": "var attachedBehaviorType: UIAttachmentBehavior.AttachmentType",
      "desc": "The type of the attachment behavior."
    },
    {
      "name": "var damping: CGFloat",
      "desc": "The amount of damping to apply to the attachment behavior."
    },
    {
      "name": "var frequency: CGFloat",
      "desc": "The frequency of oscillation for the attachment behavior."
    },
    {
      "name": "var length: CGFloat",
      "desc": "The distance, in points, between the two attachment points of the attachment behavior."
    },
    {
      "name": "var frictionTorque: CGFloat",
      "desc": "The amount of force needed to overcome rotational forces around an anchor point."
    },
    {
      "name": "var attachmentRange: UIFloatRange",
      "desc": "The range of motion for the attachment behavior."
    },
    {
      "name": "enum UIAttachmentBehavior.AttachmentType",
      "desc": "Constants indicating the type of the attachment behavior object."
    },
    {
      "name": "struct UIFloatRange",
      "desc": "The range of motion for attached objects."
    },
    {
      "name": "struct UIOffset",
      "desc": "A structure that specifies an amount to offset a position."
    }
  ],
  "declaration": "@MainActor class UIAttachmentBehavior : UIDynamicBehavior",
  "inheritsFrom": [
    "UIDynamicBehavior"
  ]
}