{
  "path": "/documentation/appstoreconnectapi/buildbundle/attributes",
  "type": "Object",
  "name": "BuildBundle.Attributes",
  "desc": "The attributes that describe a Build Bundles resource.",
  "items": [
    {
      "name": "bundleId",
      "desc": "The bundle ID of the build bundle."
    },
    {
      "name": "bundleType",
      "desc": "The type of the build bundle."
    },
    {
      "name": "deviceProtocols",
      "desc": "The protocols that the app uses to communicate with external accessory hardware. For more information, see UISupportedExternalAccessoryProtocols."
    },
    {
      "name": "dSYMUrl",
      "desc": "The URL to the symbolication file for the app or App Clip."
    },
    {
      "name": "entitlements",
      "desc": "Entitlement information for your app or App Clip."
    },
    {
      "name": "fileName",
      "desc": "The name of the build bundle."
    },
    {
      "name": "hasOnDemandResources",
      "desc": "A Boolean value that indicates whether the build bundle contains on-demand resources."
    },
    {
      "name": "hasPrerenderedIcon",
      "desc": "A Boolean value that indicates whether the build bundle contains a pre-rendered app icon."
    },
    {
      "name": "hasSirikit",
      "desc": "A Boolean value that indicates whether the build bundle contains an app or App Clip that allows users to interact with it through voice, intelligent suggestions, and personalized workflows."
    },
    {
      "name": "includesSymbols",
      "desc": "A Boolean value that indicates whether the build bundle includes symbol information for debugging and crash reports."
    },
    {
      "name": "isIosBuildMacAppStoreCompatible",
      "desc": "A Boolean value that indicates whether an iOS app included in the build bundle is included on the Mac App Store."
    },
    {
      "name": "locales",
      "desc": "The specified locale. Refer to BetaAppLocalizationCreateRequest.Data.Attributes for possible values."
    },
    {
      "name": "platformBuild",
      "desc": "The build number of the OS you used to build the app or App Clip."
    },
    {
      "name": "requiredCapabilities",
      "desc": "An array of capabilities that your app or App Clip requires."
    },
    {
      "name": "sdkBuild",
      "desc": "A string that identifies the SDK you used to build your app or App Clip."
    },
    {
      "name": "supportedArchitectures",
      "desc": "An array of supported CPU architectures that your app or App Clip supports."
    },
    {
      "name": "usesLocationServices",
      "desc": "A Boolean value that indicates whether the app or App Clip included in the build bundle uses location services."
    }
  ]
}