{
  "path": "/documentation/accessibility/axchartdescriptor",
  "type": "Class",
  "name": "AXChartDescriptor",
  "desc": "An object that contains all the semantic information about an accessible chart.",
  "items": [
    {
      "name": "init(title: String?, summary: String?, xAxis: AXDataAxisDescriptor, yAxis: AXNumericDataAxisDescriptor?, additionalAxes: [AXDataAxisDescriptor], series: [AXDataSeriesDescriptor])",
      "desc": "Creates a chart descriptor with the specified title, summary, X-axis descriptor, Y-axis descriptor, descriptors for additional axes, and array of data series."
    },
    {
      "name": "init(attributedTitle: NSAttributedString?, summary: String?, xAxis: AXDataAxisDescriptor, yAxis: AXNumericDataAxisDescriptor?, additionalAxes: [AXDataAxisDescriptor], series: [AXDataSeriesDescriptor])",
      "desc": "Creates a chart descriptor with the specified attributed title, summary, X-axis descriptor, Y-axis descriptor, descriptors for additional axes, and array of data series."
    },
    {
      "name": "var title: String?",
      "desc": "The title of the chart."
    },
    {
      "name": "var attributedTitle: NSAttributedString?",
      "desc": "An attributed version of the chart title."
    },
    {
      "name": "var summary: String?",
      "desc": "A description of the key takeaways or features of the chart."
    },
    {
      "name": "var xAxis: AXDataAxisDescriptor",
      "desc": "The axis descriptor for the chart’s X-axis."
    },
    {
      "name": "var yAxis: AXNumericDataAxisDescriptor?",
      "desc": "The axis descriptor for the chart’s Y-axis."
    },
    {
      "name": "var additionalAxes: [AXDataAxisDescriptor]",
      "desc": "The descriptors for additional categorical or numerical axes beyond the X-axis and Y-axis."
    },
    {
      "name": "protocol AXDataAxisDescriptor",
      "desc": "The basic interface for a data axis in a chart."
    },
    {
      "name": "var series: [AXDataSeriesDescriptor]",
      "desc": "The descriptors for each data series in the chart."
    },
    {
      "name": "class AXDataSeriesDescriptor",
      "desc": "An object that represents a series of data points."
    },
    {
      "name": "var contentFrame: CGRect",
      "desc": "The bounds of the view, in screen coordinates, for visually rendering data values."
    },
    {
      "name": "var contentDirection: AXChartDescriptor.ContentDirection",
      "desc": "The direction of the content in the chart."
    },
    {
      "name": "enum AXChartDescriptor.ContentDirection",
      "desc": "A constant that describes the content direction of the chart."
    }
  ],
  "declaration": "class AXChartDescriptor : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCopying"
  ]
}