{
  "path": "/documentation/apple_search_ads/adgroup",
  "type": "Object",
  "name": "AdGroup",
  "desc": "The response to ad group requests.",
  "items": [
    {
      "name": "automatedKeywordsOptIn",
      "desc": "The parameter for enabling and disabling Search Match. If true, the system automatically adds optimized keywords in addition to those you explicitly add to the ad group.See the Enable and Disable Search Match section of Ad Groups.You can use the EQUALS selector Condition operator with Find Ad Groups."
    },
    {
      "name": "campaignId",
      "desc": "The unique identifier for a campaign.You can use the EQUALS, IN, and STARTSWITH selector Condition operators with Find Ad Groups."
    },
    {
      "name": "cpaGoal",
      "desc": "An optional limit for the cost-per-acquisition goal.NoteYou can’t set the cpaGoal parameter when the pricingModel has a value of CPM."
    },
    {
      "name": "defaultBidAmount",
      "desc": "The default maximum cost per tap/impression bid for the ad group."
    },
    {
      "name": "deleted",
      "desc": "The indicator of whether the ad group is soft-deleted. This includes keywords that belong to an ad group.You can use the EQUALS and IN selector Condition operators with Find Ad Groups."
    },
    {
      "name": "displayStatus",
      "desc": "The status of the ad group. The status resolves according to servingStatus and additional criteria."
    },
    {
      "name": "endTime",
      "desc": "The scheduled end date and time for the ad group, which the system determines from the ad group with the latest end time."
    },
    {
      "name": "id",
      "desc": "The unique identifier for the ad group that you can use as adGroupId in endpoint resources.You can use the EQUALS, IN, and STARTSWITH selector Condition operators with Find Ad Groups."
    },
    {
      "name": "modificationTime",
      "desc": "The date and time of the most recent modification of the object."
    },
    {
      "name": "name",
      "desc": "The unique name of the ad group. Responses don’t include deleted ad groups.You can use the EQUALS, IN, and STARTSWITH selector Condition operators with Find Ad Groups."
    },
    {
      "name": "orgId",
      "desc": "The identifier of the organization that owns the campaign. Your orgId is the same as your account in the Apple Search Ads UI."
    },
    {
      "name": "paymentModel",
      "desc": "The payment model that you set through the Search Ads UI. If you don’t set a payment model, campaigns can’t run.See PaymentModel for value descriptions.If you don’t select a payment model, you can still create campaigns. You must select a payment model before a campaign is eligible to run.See BudgetOrder for details about setting a payment model."
    },
    {
      "name": "pricingModel",
      "desc": "The type of bid that is set. See PricingModel for value descriptions."
    },
    {
      "name": "servingStateReasons",
      "desc": "A list of reasons that displays when an ad group isn’t running."
    },
    {
      "name": "servingStatus",
      "desc": "The status of whether the ad group is serving."
    },
    {
      "name": "startTime",
      "desc": "The scheduled start date and time for the ad group with the earliest start time in the campaign."
    },
    {
      "name": "status",
      "desc": "The user-controlled status to enable or pause the ad group.This field is updatable.You can use the EQUALS selector Condition operator with Find Ad Groups."
    },
    {
      "name": "targetingDimensions",
      "desc": "The targeting criteria to narrow the audience. Targeting options include age, gender, geolocation, daypart, device, and app downloaders."
    }
  ]
}