{
  "path": "/documentation/mlcompute/mlcoptimizerdescriptor",
  "type": "Class",
  "name": "MLCOptimizerDescriptor",
  "desc": "A configuration object you use to create an optimizer.",
  "items": [
    {
      "name": "init(learningRate: Float, gradientRescale: Float, regularizationType: MLCRegularizationType, regularizationScale: Float)",
      "desc": "Creates an optimizer descriptor with the learning rate, gradient rescale, regularization type, and regulation scale that you specify."
    },
    {
      "name": "init(learningRate: Float, gradientRescale: Float, appliesGradientClipping: Bool, gradientClipMax: Float, gradientClipMin: Float, regularizationType: MLCRegularizationType, regularizationScale: Float)",
      "desc": "Creates a descriptor with the learning rate, gradient rescale, clipping option and values, and regularization type and scale that you specify."
    },
    {
      "name": "init(learningRate: Float, gradientRescale: Float, appliesGradientClipping: Bool, gradientClippingType: MLCGradientClippingType, gradientClipMax: Float, gradientClipMin: Float, maximumClippingNorm: Float, customGlobalNorm: Float, regularizationType: MLCRegularizationType, regularizationScale: Float)",
      "desc": "Creates a descriptor with the learning rate, gradient rescale, clipping option and values, and regularization type and scale that you specify."
    },
    {
      "name": "var learningRate: Float",
      "desc": "The learning rate."
    },
    {
      "name": "var gradientRescale: Float",
      "desc": "The rescale value the optimizer applies to gradients during updates."
    },
    {
      "name": "var appliesGradientClipping: Bool",
      "desc": "A Boolean that indicates whether you apply gradient clipping."
    },
    {
      "name": "var gradientClipMax: Float",
      "desc": "The maximum gradient value before the optimizer rescales the gradient, if you enabled gradient clipping."
    },
    {
      "name": "var gradientClipMin: Float",
      "desc": "The minimum gradient value before the optimizer rescales the gradient, if you enabled gradient clipping."
    },
    {
      "name": "var regularizationScale: Float",
      "desc": "The regularization scale."
    },
    {
      "name": "var regularizationType: MLCRegularizationType",
      "desc": "The regularization type."
    },
    {
      "name": "var gradientClippingType: MLCGradientClippingType",
      "desc": "The type of clipping the system applies to the gradient."
    },
    {
      "name": "enum MLCGradientClippingType",
      "desc": "A clipping type the system applies to a gradient."
    },
    {
      "name": "var maximumClippingNorm: Float",
      "desc": "The maximum clipping value."
    },
    {
      "name": "var customGlobalNorm: Float",
      "desc": "A custom norm the system uses in place of the global norm."
    }
  ],
  "declaration": "class MLCOptimizerDescriptor : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCopying"
  ]
}