{
  "path": "/documentation/appkit/nsprintpanel",
  "type": "Class",
  "name": "NSPrintPanel",
  "desc": "The Print panel that queries the user for information about a print job.",
  "items": [
    {
      "name": "var jobStyleHint: NSPrintPanel.JobStyleHint?",
      "desc": "The type of settings that the print panel displays."
    },
    {
      "name": "struct NSPrintPanel.JobStyleHint",
      "desc": "Constants that specify job style hints for activating the simplified Print panel interface and setting the options to display."
    },
    {
      "name": "var options: NSPrintPanel.Options",
      "desc": "The current configuration options for the Print panel."
    },
    {
      "name": "struct NSPrintPanel.Options",
      "desc": "Constants that specify options for configuring the contents of the main Print panel."
    },
    {
      "name": "func defaultButtonTitle() -> String?",
      "desc": "Returns the title of the Print panel’s default button."
    },
    {
      "name": "func setDefaultButtonTitle(String?)",
      "desc": "Sets the title of the Print panel’s default button."
    },
    {
      "name": "var helpAnchor: NSHelpManager.AnchorName?",
      "desc": "The HTML help anchor associated with the Print panel."
    },
    {
      "name": "func addAccessoryController(NSViewController & NSPrintPanelAccessorizing)",
      "desc": "Adds a custom controller to the Print panel to manage an accessory view."
    },
    {
      "name": "func removeAccessoryController(NSViewController & NSPrintPanelAccessorizing)",
      "desc": "Removes the specified controller and accessory view from the Print panel."
    },
    {
      "name": "protocol NSPrintPanelAccessorizing",
      "desc": "A set of methods that a Print panel object can use to get information from a printing accessory controller."
    },
    {
      "name": "var accessoryControllers: [NSViewController]",
      "desc": "The array of controller objects that manage the Print panel’s accessory views."
    },
    {
      "name": "func beginSheet(with: NSPrintInfo, modalFor: NSWindow, delegate: Any?, didEnd: Selector?, contextInfo: UnsafeMutableRawPointer?)",
      "desc": "Displays a Print panel sheet and runs it modally for the specified window."
    },
    {
      "name": "func runModal() -> Int",
      "desc": "Displays the Print panel and begins the modal loop."
    },
    {
      "name": "func runModal(with: NSPrintInfo) -> Int",
      "desc": "Displays the Print panel and runs the modal loop using the specified printing information."
    },
    {
      "name": "var printInfo: NSPrintInfo",
      "desc": "The information associated with the running Print panel."
    },
    {
      "name": "class NSPrintInfo",
      "desc": "An object that stores information that’s used to generate printed output."
    }
  ],
  "declaration": "@MainActor class NSPrintPanel : NSObject",
  "inheritsFrom": [
    "NSObject"
  ]
}