{
  "path": "/documentation/pencilkit/pktoolpicker",
  "type": "Class",
  "name": "PKToolPicker",
  "desc": "A tool palette that displays a selection of drawing tools and colors for tools and colors that a user can choose from.",
  "items": [
    {
      "name": "init()",
      "desc": "Returns a new instance of a tool picker."
    },
    {
      "name": "func addObserver(PKToolPickerObserver)",
      "desc": "Adds the specified object to the list of objects to notify when the picker configuration changes."
    },
    {
      "name": "func removeObserver(PKToolPickerObserver)",
      "desc": "Removes the specified object from the list of objects to notify when the picker configuration changes."
    },
    {
      "name": "protocol PKToolPickerObserver",
      "desc": "An interface you use to detect when the user changes the selected tools and drawing characteristics of a tool picker object."
    },
    {
      "name": "func setVisible(Bool, forFirstResponder: UIResponder)",
      "desc": "Sets the visibility for the tool picker, based on when the specified responder object becomes active."
    },
    {
      "name": "var isVisible: Bool",
      "desc": "A Boolean value that indicates whether the tool picker is currently visible."
    },
    {
      "name": "func frameObscured(in: UIView) -> CGRect",
      "desc": "Returns the portion of the specified view that the tool picker obscures."
    },
    {
      "name": "var selectedTool: PKTool",
      "desc": "The currently selected tool in this tool picker."
    },
    {
      "name": "var colorUserInterfaceStyle: UIUserInterfaceStyle",
      "desc": "The user interface style for this tool picker."
    },
    {
      "name": "var isRulerActive: Bool",
      "desc": "A Boolean value that indicates whether the ruler is visible on the canvas."
    },
    {
      "name": "var overrideUserInterfaceStyle: UIUserInterfaceStyle",
      "desc": "The specific user interface style to apply to this tool picker."
    },
    {
      "name": "var showsDrawingPolicyControls: Bool",
      "desc": "A Boolean value that indicates whether the default drawing policy UI is visible."
    },
    {
      "name": "var stateAutosaveName: String?",
      "desc": "The name used to automatically save the tool picker’s state in the defaults system."
    }
  ],
  "declaration": "class PKToolPicker : NSObject",
  "inheritsFrom": [
    "NSObject"
  ]
}