{
  "path": "/documentation/uikit/uiapplicationshortcuticon/icontype",
  "type": "Enumeration",
  "name": "UIApplicationShortcutIcon.IconType",
  "desc": "Constants for system-provided icons.",
  "items": [
    {
      "name": "case compose",
      "desc": "An icon for a quick action that lets a user compose new content."
    },
    {
      "name": "case play",
      "desc": "An icon for a quick action that plays media."
    },
    {
      "name": "case pause",
      "desc": "An icon for a quick action that pauses media playback."
    },
    {
      "name": "case add",
      "desc": "An icon for a quick action that adds an item."
    },
    {
      "name": "case location",
      "desc": "An icon for a quick action that accesses the user’s current location."
    },
    {
      "name": "case search",
      "desc": "An icon a quick action that offers search."
    },
    {
      "name": "case share",
      "desc": "An icon for a quick action that offers content sharing."
    },
    {
      "name": "case prohibit",
      "desc": "An icon for a quick action that disallows something."
    },
    {
      "name": "case contact",
      "desc": "An icon for a quick action that chooses a generic contact."
    },
    {
      "name": "case home",
      "desc": "An icon for a quick action that indicates home."
    },
    {
      "name": "case markLocation",
      "desc": "An icon for a quick action that lets a user mark a location."
    },
    {
      "name": "case favorite",
      "desc": "An icon for a quick action that lets a user designate a favorite item."
    },
    {
      "name": "case love",
      "desc": "An icon for a quick action that lets a user designate a loved item."
    },
    {
      "name": "case cloud",
      "desc": "An icon for a quick action that offers cloud access."
    },
    {
      "name": "case invitation",
      "desc": "An icon for a quick action that indicates an invitation."
    },
    {
      "name": "case confirmation",
      "desc": "An icon for a quick action that indicates confirmation."
    },
    {
      "name": "case mail",
      "desc": "An icon for a quick action that offers use of mail."
    },
    {
      "name": "case message",
      "desc": "An icon for a quick action that offers use of messaging."
    },
    {
      "name": "case date",
      "desc": "An icon for a quick action that offers use of a calendar."
    },
    {
      "name": "case time",
      "desc": "An icon for a quick action that offers use of a clock or timer."
    },
    {
      "name": "case capturePhoto",
      "desc": "An icon for a quick action that offers photo capture."
    },
    {
      "name": "case captureVideo",
      "desc": "An icon for a quick action that offers video capture."
    },
    {
      "name": "case task",
      "desc": "An icon for a quick action that offers task creation."
    },
    {
      "name": "case taskCompleted",
      "desc": "An icon for a quick action that offers task completion."
    },
    {
      "name": "case alarm",
      "desc": "An icon for a quick action that offers creation of an alarm."
    },
    {
      "name": "case bookmark",
      "desc": "An icon for a quick action that offers creation of a bookmark."
    },
    {
      "name": "case shuffle",
      "desc": "An icon for a quick action that offers shuffle mode."
    },
    {
      "name": "case audio",
      "desc": "An icon for a quick action that offers use of audio."
    },
    {
      "name": "case update",
      "desc": "An icon for a quick action that offers updating."
    }
  ],
  "declaration": "enum IconType : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}