{
  "path": "/documentation/coremedia/cmtextdisplayflags",
  "type": "Type Alias",
  "name": "CMTextDisplayFlags",
  "desc": "An integer value that describes the display mode flags for text media.",
  "items": [
    {
      "name": "var kCMTextDisplayFlag_scrollIn: CMTextDisplayFlags",
      "desc": "A flag that describes the text scrolls into the display region."
    },
    {
      "name": "var kCMTextDisplayFlag_scrollOut: CMTextDisplayFlags",
      "desc": "A flag that describes the text scrolls out of the display region."
    },
    {
      "name": "var kCMTextDisplayFlag_scrollDirectionMask: CMTextDisplayFlags",
      "desc": "A flag that describes the scrolling direction is set by a two-bit field, obtained from displayFlags using kCMTextDisplayFlag_scrollDirectionMask."
    },
    {
      "name": "var kCMTextDisplayFlag_scrollDirection_bottomToTop: CMTextDisplayFlags",
      "desc": "A flag that describes the text is vertically scrolled up (“credits style”), entering from the bottom and leaving towards the top."
    },
    {
      "name": "var kCMTextDisplayFlag_scrollDirection_rightToLeft: CMTextDisplayFlags",
      "desc": "A flag that describes the text is horizontally scrolled (“marquee style”), entering from the right and leaving towards the left."
    },
    {
      "name": "var kCMTextDisplayFlag_scrollDirection_topToBottom: CMTextDisplayFlags",
      "desc": "A flag that describes the text is vertically scrolled down, entering from the top and leaving towards the bottom."
    },
    {
      "name": "var kCMTextDisplayFlag_scrollDirection_leftToRight: CMTextDisplayFlags",
      "desc": "A flag that describes the text is horizontally scrolled, entering from the left and leaving towards the right."
    },
    {
      "name": "var kCMTextDisplayFlag_continuousKaraoke: CMTextDisplayFlags",
      "desc": "A flag that describes enabling the continuous karaoke mode where the range of karaoke highlighting extends to include additional ranges rather than the highlighting moves onto the next range."
    },
    {
      "name": "var kCMTextDisplayFlag_writeTextVertically: CMTextDisplayFlags",
      "desc": "A flag that describes the text renders vertically."
    },
    {
      "name": "var kCMTextDisplayFlag_fillTextRegion: CMTextDisplayFlags",
      "desc": "A flag that describes the subtitle display bounds are to be filled with the color specified by kCMTextFormatDescriptionExtension_BackgroundColor."
    },
    {
      "name": "var kCMTextDisplayFlag_forcedSubtitlesPresent: CMTextDisplayFlags",
      "desc": "A flag that describes forcing subtitles are present, for example, a subtitle which only displays during foreign language sections of the video. Check individual samples to determine what type of subtitle is contained."
    },
    {
      "name": "var kCMTextDisplayFlag_allSubtitlesForced: CMTextDisplayFlags",
      "desc": "A flag that describes treating all subtitle samples as if they contain forced subtitles."
    }
  ],
  "declaration": "typealias CMTextDisplayFlags = UInt32"
}