{
  "path": "/documentation/uikit/uitextviewdelegate",
  "type": "Protocol",
  "name": "UITextViewDelegate",
  "desc": "The methods for receiving editing-related messages for text view objects.",
  "items": [
    {
      "name": "func textViewShouldBeginEditing(UITextView) -> Bool",
      "desc": "Asks the delegate whether to begin editing in the specified text view."
    },
    {
      "name": "func textViewDidBeginEditing(UITextView)",
      "desc": "Tells the delegate when editing of the specified text view begins."
    },
    {
      "name": "func textViewShouldEndEditing(UITextView) -> Bool",
      "desc": "Asks the delegate whether to stop editing in the specified text view."
    },
    {
      "name": "func textViewDidEndEditing(UITextView)",
      "desc": "Tells the delegate when editing of the specified text view ends."
    },
    {
      "name": "func textView(UITextView, shouldChangeTextIn: NSRange, replacementText: String) -> Bool",
      "desc": "Asks the delegate whether to replace the specified text in the text view."
    },
    {
      "name": "func textViewDidChange(UITextView)",
      "desc": "Tells the delegate when the user changes the text or attributes in the specified text view."
    },
    {
      "name": "func textViewDidChangeSelection(UITextView)",
      "desc": "Tells the delegate when the text selection changes in the specified text view."
    },
    {
      "name": "func textView(UITextView, shouldInteractWith: NSTextAttachment, in: NSRange, interaction: UITextItemInteraction) -> Bool",
      "desc": "Asks the delegate whether the specified text view allows the specified type of user interaction with the provided text attachment in the specified range of text."
    },
    {
      "name": "func textView(UITextView, shouldInteractWith: URL, in: NSRange, interaction: UITextItemInteraction) -> Bool",
      "desc": "Asks the delegate whether the specified text view allows the specified type of user interaction with the specified URL in the specified range of text."
    },
    {
      "name": "enum UITextItemInteraction",
      "desc": "Constants that indicate the type of interaction the user expects to have with a URL or text attachment."
    }
  ],
  "declaration": "@MainActor protocol UITextViewDelegate",
  "inheritsFrom": [
    "NSObjectProtocol",
    "UIScrollViewDelegate"
  ]
}