{
  "path": "/documentation/uikit/uistackview/alignment",
  "type": "Enumeration",
  "name": "UIStackView.Alignment",
  "desc": "The layout of arranged views perpendicular to the stack view’s axis.",
  "items": [
    {
      "name": "case fill",
      "desc": "A layout where the stack view resizes its arranged views so that they fill the available space perpendicular to the stack view’s axis."
    },
    {
      "name": "case leading",
      "desc": "A layout for vertical stacks where the stack view aligns the leading edge of its arranged views along its leading edge. This is equivalent to the top alignment for horizontal stacks."
    },
    {
      "name": "static var top: UIStackView.Alignment",
      "desc": "A layout for horizontal stacks where the stack view aligns the top edge of its arranged views along its top edge. This is equivalent to the UIStackView.Alignment.leading alignment for vertical stacks."
    },
    {
      "name": "case firstBaseline",
      "desc": "A layout where the stack view aligns its arranged views based on their first baseline. This alignment is only valid for horizontal stacks."
    },
    {
      "name": "case center",
      "desc": "A layout where the stack view aligns the center of its arranged views with its center along its axis."
    },
    {
      "name": "case trailing",
      "desc": "A layout for vertical stacks where the stack view aligns the trailing edge of its arranged views along its trailing edge. This is equivalent to the bottom alignment for horizontal stacks."
    },
    {
      "name": "static var bottom: UIStackView.Alignment",
      "desc": "A layout for horizontal stacks where the stack view aligns the bottom edge of its arranged views along its bottom edge. This is equivalent to the UIStackView.Alignment.trailing alignment for vertical stacks."
    },
    {
      "name": "case lastBaseline",
      "desc": "A layout where the stack view aligns its arranged views based on their last baseline. This alignment is only valid for horizontal stacks."
    }
  ],
  "declaration": "enum Alignment : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}