{
  "path": "/documentation/gamekit/gkerror/code",
  "type": "Enumeration",
  "name": "GKError.Code",
  "desc": "Error codes for the GameKit error domain.",
  "items": [
    {
      "name": "case gameUnrecognized",
      "desc": "The system can’t complete the requested operation because Game Center doesn’t recognize the app."
    },
    {
      "name": "case notSupported",
      "desc": "The app doesn’t have Game Center enabled."
    },
    {
      "name": "case unknown",
      "desc": "The system can’t complete the requested operation due to an unknown error."
    },
    {
      "name": "case cancelled",
      "desc": "The system canceled the requested operation or the user disabled it."
    },
    {
      "name": "case communicationsFailure",
      "desc": "The system can’t complete the requested operation due to an error communicating with the server."
    },
    {
      "name": "case invalidPlayer",
      "desc": "The system can’t complete the requested operation because the player is invalid."
    },
    {
      "name": "case invalidParameter",
      "desc": "The system can’t complete the requested operation because one or more parameters are invalid."
    },
    {
      "name": "case gameSessionRequestInvalid",
      "desc": "The properties of the game session request are impossible to fulfill."
    },
    {
      "name": "case apiNotAvailable",
      "desc": "The system can’t complete the requested operation because the API isn’t available."
    },
    {
      "name": "case connectionTimeout",
      "desc": "The system can’t complete the requested operation because the connection timed out."
    },
    {
      "name": "case apiObsolete",
      "desc": "The system can’t complete the requested operation because Apple deprecated the API."
    },
    {
      "name": "case userDenied",
      "desc": "The system can’t complete the requested operation because the user denied it."
    },
    {
      "name": "case invalidCredentials",
      "desc": "The system can’t complete the requested operation because the user name or password are incorrect."
    },
    {
      "name": "case notAuthenticated",
      "desc": "The system can’t complete the requested operation because the system hasn’t authorized the player."
    },
    {
      "name": "case authenticationInProgress",
      "desc": "The system can’t complete the requested operation because the local player is already authenticating."
    },
    {
      "name": "case parentalControlsBlocked",
      "desc": "The system can’t complete the requested operation because the user disabled this feature in Restrictions."
    },
    {
      "name": "case playerStatusExceedsMaximumLength",
      "desc": "The player’s status exceeds the maximum length."
    },
    {
      "name": "case playerStatusInvalid",
      "desc": "The player’s status is invalid."
    },
    {
      "name": "case underage",
      "desc": "The system can’t complete the requested operation because this feature isn’t available to underage players."
    },
    {
      "name": "case playerPhotoFailure",
      "desc": "The system can’t complete the requested operation to retrieve a player’s photo."
    },
    {
      "name": "case ubiquityContainerUnavailable",
      "desc": "The system can’t complete the requested operation because the user hasn’t signed in to iCloud or hasn’t enabled iCloud Drive."
    },
    {
      "name": "case notAuthorized",
      "desc": "The system can’t complete the requested operation because the system hasn’t authorized the player."
    },
    {
      "name": "case friendListDescriptionMissing",
      "desc": "Access to the local player’s list of friends denied for lack of a reason."
    },
    {
      "name": "case friendListRestricted",
      "desc": "Access to the local player’s list of friends restricted."
    },
    {
      "name": "case friendListDenied",
      "desc": "Access to the local player’s list of friends denied."
    },
    {
      "name": "case friendRequestNotAvailable",
      "desc": "The player can’t send a friend request at this time from this device."
    },
    {
      "name": "case matchRequestInvalid",
      "desc": "The system can’t complete the requested operation because the match request is invalid."
    },
    {
      "name": "case unexpectedConnection",
      "desc": "An unexpected player has connected to a match."
    },
    {
      "name": "case invitationsDisabled",
      "desc": "The system can’t complete the requested operation because the receiving player has disabled invitations."
    },
    {
      "name": "case matchNotConnected",
      "desc": "The system can’t complete the requested operation because the match isn’t connected to other players."
    },
    {
      "name": "case restrictedToAutomatch",
      "desc": "The system can’t complete the requested operation because the player is using automatch."
    },
    {
      "name": "case turnBasedMatchDataTooLarge",
      "desc": "The system can’t complete the requested operation because the match data is too large."
    },
    {
      "name": "case turnBasedTooManySessions",
      "desc": "The system can’t complete the requested operation because it exceeds the maximum number of sessions."
    },
    {
      "name": "case turnBasedInvalidParticipant",
      "desc": "The system can’t complete the requested operation because the specified participant is invalid."
    },
    {
      "name": "case turnBasedInvalidTurn",
      "desc": "The system can’t complete the requested operation because the participant doesn’t have the required turn state."
    },
    {
      "name": "case turnBasedInvalidState",
      "desc": "The system can’t complete the requested operation because the session is in an invalid state."
    },
    {
      "name": "case scoreNotSet",
      "desc": "The system can’t complete the requested operation because the system hasn’t set the score."
    },
    {
      "name": "case challengeInvalid",
      "desc": "The challenge request failed due to invalid challenge data."
    }
  ],
  "declaration": "enum GKError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}