{
  "path": "/documentation/swift/unicode/scalar/properties",
  "type": "Structure",
  "name": "Unicode.Scalar.Properties",
  "desc": "A value that provides access to properties of a Unicode scalar that are defined by the Unicode standard.",
  "items": [
    {
      "name": "var age: Unicode.Version?",
      "desc": "The earliest version of the Unicode Standard in which the scalar was assigned."
    },
    {
      "name": "var canonicalCombiningClass: Unicode.CanonicalCombiningClass",
      "desc": "The canonical combining class of the scalar."
    },
    {
      "name": "var changesWhenCaseFolded: Bool",
      "desc": "A Boolean value indicating whether the scalar’s normalized form differs from the case-fold mapping of each constituent scalar."
    },
    {
      "name": "var changesWhenCaseMapped: Bool",
      "desc": "A Boolean value indicating whether the scalar may change when it undergoes case mapping."
    },
    {
      "name": "var changesWhenLowercased: Bool",
      "desc": "A Boolean value indicating whether the scalar’s normalized form differs from the lowercaseMapping of each constituent scalar."
    },
    {
      "name": "var changesWhenNFKCCaseFolded: Bool",
      "desc": "A Boolean value indicating whether the scalar is one that is not identical to its NFKC case-fold mapping."
    },
    {
      "name": "var changesWhenTitlecased: Bool",
      "desc": "A Boolean value indicating whether the scalar’s normalized form differs from the titlecaseMapping of each constituent scalar."
    },
    {
      "name": "var changesWhenUppercased: Bool",
      "desc": "A Boolean value indicating whether the scalar’s normalized form differs from the uppercaseMapping of each constituent scalar."
    },
    {
      "name": "var generalCategory: Unicode.GeneralCategory",
      "desc": "The general category (most usual classification) of the scalar."
    },
    {
      "name": "var isASCIIHexDigit: Bool",
      "desc": "A Boolean value indicating whether the scalar is an ASCII character commonly used for the representation of hexadecimal numbers."
    },
    {
      "name": "var isAlphabetic: Bool",
      "desc": "A Boolean value indicating whether the scalar is alphabetic."
    },
    {
      "name": "var isBidiControl: Bool",
      "desc": "A Boolean value indicating whether the scalar is a format control character that has a specific function in the Unicode Bidrectional Algorithm."
    },
    {
      "name": "var isBidiMirrored: Bool",
      "desc": "A Boolean value indicating whether the scalar is mirrored in bidirectional text."
    },
    {
      "name": "var isCaseIgnorable: Bool",
      "desc": "A Boolean value indicating whether the scalar is ignored for casing purposes."
    },
    {
      "name": "var isCased: Bool",
      "desc": "A Boolean value indicating whether the scalar is considered to be either lowercase, uppercase, or titlecase."
    },
    {
      "name": "var isDash: Bool",
      "desc": "A Boolean value indicating whether the scalar is a punctuation symbol explicitly called out as a dash in the Unicode Standard or a compatibility equivalent."
    },
    {
      "name": "var isDefaultIgnorableCodePoint: Bool",
      "desc": "A Boolean value indicating whether the scalar is a default-ignorable code point."
    },
    {
      "name": "var isDeprecated: Bool",
      "desc": "A Boolean value indicating whether the scalar is deprecated."
    },
    {
      "name": "var isDiacritic: Bool",
      "desc": "A Boolean value indicating whether the scalar is a diacritic."
    },
    {
      "name": "var isEmoji: Bool",
      "desc": "A Boolean value indicating whether the scalar has an emoji presentation, whether or not it is the default."
    },
    {
      "name": "var isEmojiModifier: Bool",
      "desc": "A Boolean value indicating whether the scalar is one that can modify a base emoji that precedes it."
    },
    {
      "name": "var isEmojiModifierBase: Bool",
      "desc": "A Boolean value indicating whether the scalar is one whose appearance can be changed by an emoji modifier that follows it."
    },
    {
      "name": "var isEmojiPresentation: Bool",
      "desc": "A Boolean value indicating whether the scalar is one that should be rendered with an emoji presentation, rather than a text presentation, by default."
    },
    {
      "name": "var isExtender: Bool",
      "desc": "A Boolean value indicating whether the scalar’s principal function is to extend the value or shape of a preceding alphabetic scalar."
    },
    {
      "name": "var isFullCompositionExclusion: Bool",
      "desc": "A Boolean value indicating whether the scalar is excluded from composition when performing Unicode normalization."
    },
    {
      "name": "var isGraphemeBase: Bool",
      "desc": "A Boolean value indicating whether the scalar is a grapheme base."
    },
    {
      "name": "var isGraphemeExtend: Bool",
      "desc": "A Boolean value indicating whether the scalar is a grapheme extender."
    },
    {
      "name": "var isHexDigit: Bool",
      "desc": "A Boolean value indicating whether the scalar is one that is commonly used for the representation of hexadecimal numbers or a compatibility equivalent."
    },
    {
      "name": "var isIDContinue: Bool",
      "desc": "A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a non-starting position in a programming language identifier."
    },
    {
      "name": "var isIDSBinaryOperator: Bool",
      "desc": "A Boolean value indicating whether the scalar is an ideographic description character that determines how the two ideographic characters or ideographic description sequences that follow it are to be combined to form a single character."
    },
    {
      "name": "var isIDSTrinaryOperator: Bool",
      "desc": "A Boolean value indicating whether the scalar is an ideographic description character that determines how the three ideographic characters or ideographic description sequences that follow it are to be combined to form a single character."
    },
    {
      "name": "var isIDStart: Bool",
      "desc": "A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a starting position in a programming language identifier."
    },
    {
      "name": "var isIdeographic: Bool",
      "desc": "A Boolean value indicating whether the scalar is considered to be a CJKV (Chinese, Japanese, Korean, and Vietnamese) or other siniform (Chinese writing-related) ideograph."
    },
    {
      "name": "var isJoinControl: Bool",
      "desc": "A Boolean value indicating whether the scalar is a format control character that has a specific function in controlling cursive joining and ligation."
    },
    {
      "name": "var isLogicalOrderException: Bool",
      "desc": "A Boolean value indicating whether the scalar requires special handling for operations involving ordering, such as sorting and searching."
    },
    {
      "name": "var isLowercase: Bool",
      "desc": "A Boolean value indicating whether the scalar’s letterform is considered lowercase."
    },
    {
      "name": "var isMath: Bool",
      "desc": "A Boolean value indicating whether the scalar is one that naturally appears in mathematical contexts."
    },
    {
      "name": "var isNoncharacterCodePoint: Bool",
      "desc": "A Boolean value indicating whether the scalar is permanently reserved for internal use."
    },
    {
      "name": "var isPatternSyntax: Bool",
      "desc": "A Boolean value indicating whether the scalar is recommended to have syntactic usage in patterns represented in source code."
    },
    {
      "name": "var isPatternWhitespace: Bool",
      "desc": "A Boolean value indicating whether the scalar is recommended to be treated as whitespace when parsing patterns represented in source code."
    },
    {
      "name": "var isQuotationMark: Bool",
      "desc": "A Boolean value indicating whether the scalar is one that is used in writing to surround quoted text."
    },
    {
      "name": "var isRadical: Bool",
      "desc": "A Boolean value indicating whether the scalar is a radical component of CJK characters, Tangut characters, or Yi syllables."
    },
    {
      "name": "var isSentenceTerminal: Bool",
      "desc": "A Boolean value indicating whether the scalar is a punctuation mark that generally marks the end of a sentence."
    },
    {
      "name": "var isSoftDotted: Bool",
      "desc": "A Boolean value indicating whether the scalar has a “soft dot” that disappears when a diacritic is placed over the scalar."
    },
    {
      "name": "var isTerminalPunctuation: Bool",
      "desc": "A Boolean value indicating whether the scalar is a punctuation symbol that typically marks the end of a textual unit."
    },
    {
      "name": "var isUnifiedIdeograph: Bool",
      "desc": "A Boolean value indicating whether the scalar is one of the unified CJK ideographs in the Unicode Standard."
    },
    {
      "name": "var isUppercase: Bool",
      "desc": "A Boolean value indicating whether the scalar’s letterform is considered uppercase."
    },
    {
      "name": "var isVariationSelector: Bool",
      "desc": "A Boolean value indicating whether the scalar is a variation selector."
    },
    {
      "name": "var isWhitespace: Bool",
      "desc": "A Boolean value indicating whether the scalar is a whitespace character."
    },
    {
      "name": "var isXIDContinue: Bool",
      "desc": "A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a non-starting position in a programming language identifier, with adjustments made for NFKC normalized form."
    },
    {
      "name": "var isXIDStart: Bool",
      "desc": "A Boolean value indicating whether the scalar is one which is recommended to be allowed to appear in a starting position in a programming language identifier, with adjustments made for NFKC normalized form."
    },
    {
      "name": "var lowercaseMapping: String",
      "desc": "The lowercase mapping of the scalar."
    },
    {
      "name": "var name: String?",
      "desc": "The published name of the scalar."
    },
    {
      "name": "var nameAlias: String?",
      "desc": "The normative formal alias of the scalar."
    },
    {
      "name": "var numericType: Unicode.NumericType?",
      "desc": "The numeric type of the scalar."
    },
    {
      "name": "var numericValue: Double?",
      "desc": "The numeric value of the scalar."
    },
    {
      "name": "var titlecaseMapping: String",
      "desc": "The titlecase mapping of the scalar."
    },
    {
      "name": "var uppercaseMapping: String",
      "desc": "The uppercase mapping of the scalar."
    }
  ],
  "declaration": "struct Properties",
  "conformsTo": [
    "Sendable"
  ]
}