{
  "path": "/documentation/avfaudio/avaudiounitreverbpreset",
  "type": "Enumeration",
  "name": "AVAudioUnitReverbPreset",
  "desc": "Constants that represent preset reverbs.",
  "items": [
    {
      "name": "case smallRoom",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a small-sized room environment."
    },
    {
      "name": "case mediumRoom",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a medium-sized room environment."
    },
    {
      "name": "case largeRoom",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a large-sized room environment."
    },
    {
      "name": "case mediumHall",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a medium-sized hall environment."
    },
    {
      "name": "case largeHall",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a large-sized hall environment."
    },
    {
      "name": "case plate",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a plate environment."
    },
    {
      "name": "case mediumChamber",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a medium-sized chamber environment."
    },
    {
      "name": "case largeChamber",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a large-sized chamber environment."
    },
    {
      "name": "case cathedral",
      "desc": "A preset that represents a reverb with the acoustic characteristics of a cathedral environment."
    },
    {
      "name": "case largeRoom2",
      "desc": "A preset that represents a reverb with the acoustic characteristics of an alternative large-sized room environment."
    },
    {
      "name": "case mediumHall2",
      "desc": "A preset that represents a reverb with the acoustic characteristics of an alternative medium-sized hall environment."
    },
    {
      "name": "case mediumHall3",
      "desc": "A preset that represents a reverb with the acoustic characteristics of an alternative medium-sized hall environment."
    },
    {
      "name": "case largeHall2",
      "desc": "A preset that represents a reverb with the acoustic characteristics of an alternative large-sized hall environment."
    }
  ],
  "declaration": "enum AVAudioUnitReverbPreset : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}