{
  "path": "/documentation/apple_search_ads/extendedspendrow",
  "type": "Object",
  "name": "ExtendedSpendRow",
  "desc": "The descriptions of metrics with dates.",
  "items": [
    {
      "name": "avgCPA",
      "desc": "The average cost-per-acquisition (CPA) is the total spend divided by the number of installs within the same time period."
    },
    {
      "name": "avgCPM",
      "desc": "The average CPM is the average amount you pay per one thousand ad impressions."
    },
    {
      "name": "avgCPT",
      "desc": "The average cost-per-tap (CPT) is the ratio of spend over taps."
    },
    {
      "name": "conversionRate",
      "desc": "The total number of conversions divided by the total number of taps within the same time period."
    },
    {
      "name": "date",
      "desc": "The date range of the report. The format is MM-DD-YYYY HH."
    },
    {
      "name": "impressions",
      "desc": "The number of times your ad appears in App Store search results within the reporting period."
    },
    {
      "name": "installs",
      "desc": "The total number of newDownloads or redownloads resulting from an ad within the reporting period. The API attributes Apple Search Ads installs within a 30‑day tap-through window."
    },
    {
      "name": "latOffInstalls",
      "desc": "The installs from users who don’t have Limit Ad Tracking (LAT) in an enabled state on their devices."
    },
    {
      "name": "latOnInstalls",
      "desc": "The installs from users who have Limit Ad Tracking (LAT) in an enabled state on their devices."
    },
    {
      "name": "localSpend",
      "desc": "The total spend of a campaign in the currency the organization uses."
    },
    {
      "name": "newDownloads",
      "desc": "The enumerated app downloads from new users without previous installs of your app."
    },
    {
      "name": "redownloads",
      "desc": "The enumerated reinstalls of your app from users with previous installs."
    },
    {
      "name": "taps",
      "desc": "The number of times users tap your ad within the reporting period."
    },
    {
      "name": "ttr",
      "desc": "The tap-through rate (TTR) is the number of times users tap your ad divided by the total impressions your ad receives."
    }
  ]
}