{
  "path": "/documentation/appstoreserverapi/consumptionrequest",
  "type": "Object",
  "name": "ConsumptionRequest",
  "desc": "The request body containing consumption information.",
  "items": [
    {
      "name": "accountTenure",
      "desc": "(Required) The age of the customer’s account."
    },
    {
      "name": "appAccountToken",
      "desc": "(Required) The UUID of the in-app user account that completed the consumable in-app purchase transaction."
    },
    {
      "name": "consumptionStatus",
      "desc": "(Required) A value that indicates the extent to which the customer consumed the in-app purchase."
    },
    {
      "name": "customerConsented",
      "desc": "(Required) A Boolean value of true or false that indicates whether the customer consented to provide consumption data."
    },
    {
      "name": "deliveryStatus",
      "desc": "(Required) A value that indicates whether the app successfully delivered an in-app purchase that works properly."
    },
    {
      "name": "lifetimeDollarsPurchased",
      "desc": "(Required) A value that indicates the total amount, in USD, of in-app purchases the customer has made in your app, across all platforms."
    },
    {
      "name": "lifetimeDollarsRefunded",
      "desc": "(Required) A value that indicates the total amount, in USD, of refunds the customer has received, in your app, across all platforms."
    },
    {
      "name": "platform",
      "desc": "(Required) A value that indicates the platform on which the customer consumed the in-app purchase."
    },
    {
      "name": "playTime",
      "desc": "(Required) A value that indicates the amount of time that the customer used the app."
    },
    {
      "name": "sampleContentProvided",
      "desc": "(Required) A Boolean value of true or false that indicates whether you provided, prior to its purchase, a free sample or trial of the content, or information about its functionality."
    },
    {
      "name": "userStatus",
      "desc": "(Required) The status of the customer’s account."
    }
  ]
}