{
  "path": "/documentation/apple_news/instagram",
  "type": "Object",
  "name": "Instagram",
  "desc": "The component for adding an Instagram post.",
  "items": [
    {
      "name": "role",
      "desc": "Always instagram for this component."
    },
    {
      "name": "URL",
      "desc": "The URL of the Instagram post you want to embed.Apple News supports the following URL formats for Instagram posts: https://www.instagram.com/p/{media-shortcode}https://www.instagram.com/tv/{media-shortcode}"
    },
    {
      "name": "anchor",
      "desc": "An object that defines vertical alignment with another component."
    },
    {
      "name": "animation",
      "desc": "An object that defines an animation to be applied to the component.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "behavior",
      "desc": "An object that defines behavior for a component, like Parallax or Springy.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "conditional",
      "desc": "An instance or array of component properties that can be applied conditionally, and the conditions that cause them to be applied."
    },
    {
      "name": "hidden",
      "desc": "A Boolean value that determines whether the component is hidden."
    },
    {
      "name": "identifier",
      "desc": "An optional unique identifier for this component. If used, this identifier must be unique across the entire document. You will need an identifier for your component if you want to anchor other components to it."
    },
    {
      "name": "layout",
      "desc": "An inline ComponentLayout object that contains layout information, or a string reference to a ComponentLayout object that is defined at the top level of the document. If layout is not defined, size and position will be based on various factors, such as the device type, the length of the content, and the role of this component."
    },
    {
      "name": "style",
      "desc": "An inline ComponentStyle object that defines the appearance of this component, or a string reference to a ComponentStyle object that is defined at the top level of the document.The none value is used for conditional design elements. Adding it here has no effect."
    }
  ],
  "inheritsFrom": [
    "Component"
  ]
}