{
  "path": "/documentation/appkit/nscompositingoperation",
  "type": "Enumeration",
  "name": "NSCompositingOperation",
  "desc": "Constants that describe compositing operators in terms of source and destination images, each having an opaque and transparent region.",
  "items": [
    {
      "name": "case clear",
      "desc": "Transparency everywhere."
    },
    {
      "name": "case copy",
      "desc": "The source image."
    },
    {
      "name": "case sourceOver",
      "desc": "The source image wherever it is opaque, and the destination image elsewhere."
    },
    {
      "name": "case sourceIn",
      "desc": "The source image wherever both images are opaque, and transparent elsewhere."
    },
    {
      "name": "case sourceOut",
      "desc": "The source image wherever it is opaque and the destination image is transparent, and transparent elsewhere."
    },
    {
      "name": "case sourceAtop",
      "desc": "The source image wherever both images are opaque, the destination image wherever it is opaque but the source image is transparent, and transparent elsewhere"
    },
    {
      "name": "case destinationOver",
      "desc": "The destination image wherever it is opaque, and the source image elsewhere."
    },
    {
      "name": "case destinationIn",
      "desc": "The destination image wherever both images are opaque, and transparent elsewhere."
    },
    {
      "name": "case destinationOut",
      "desc": "The destination image wherever it is opaque and the source image is transparent, and transparent elsewhere."
    },
    {
      "name": "case destinationAtop",
      "desc": "The destination image wherever both images are opaque, the source image wherever it is opaque and the destination image is transparent, and transparent elsehwere."
    },
    {
      "name": "case xor",
      "desc": "Exclusive OR of the source and destination images."
    },
    {
      "name": "case plusDarker",
      "desc": "The sum of the source and destination images, with color values approach 0 as a limit."
    },
    {
      "name": "case plusLighter",
      "desc": "The sum of the source and destination images, with color values approach 1 as a limit."
    },
    {
      "name": "case multiply",
      "desc": "The source color is multiplied by the destination color."
    },
    {
      "name": "case screen",
      "desc": "Multiplies the complement of the destination and source color values, and then complements the result."
    },
    {
      "name": "case overlay",
      "desc": "Source colors overlay the destination."
    },
    {
      "name": "case darken",
      "desc": "Use the darker of the source and destination colors."
    },
    {
      "name": "case lighten",
      "desc": "Use the lighter of the source and destination colors."
    },
    {
      "name": "case colorDodge",
      "desc": "Brightens the destination to reflect the source."
    },
    {
      "name": "case colorBurn",
      "desc": "Darkens the destination color to reflect the source."
    },
    {
      "name": "case softLight",
      "desc": "Darkens or lightens colors, with the effect of shining a diffused spotlight on the destination."
    },
    {
      "name": "case hardLight",
      "desc": "Multiplies or screens colors, with the effect of shining a spotlight on the destination."
    },
    {
      "name": "case difference",
      "desc": "Subtracts the darker value from the lighter value."
    },
    {
      "name": "case exclusion",
      "desc": "Subtracts the darker value from the lighter value, except lower in contrast."
    },
    {
      "name": "case hue",
      "desc": "Uses the hue of the source and the saturation and luminosity of the destination."
    },
    {
      "name": "case saturation",
      "desc": "Uses the saturation value of the source and the hue and luminosity of the destination."
    },
    {
      "name": "case color",
      "desc": "Uses the hue and saturation of the source and the luminosity of the destination."
    },
    {
      "name": "case luminosity",
      "desc": "Uses the luminosity of the source and the hue and saturation of the destination."
    }
  ],
  "declaration": "enum NSCompositingOperation : UInt, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}