{
  "path": "/documentation/apple_search_ads/keyword",
  "type": "Object",
  "name": "Keyword",
  "desc": "Targeting keyword parameters to use in requests and responses.",
  "items": [
    {
      "name": "adGroupId",
      "desc": "The unique identifier for the ad group that the targeting keyword belongs to. You can use the EQUALS and IN selector Condition operators with Find Targeting Keywords in a Campaign."
    },
    {
      "name": "bidAmount",
      "desc": "The maximum cost-per-tap/impression bid amount. This is the offer price for a keyword in a bidding auction. If the bidAmount field is null, the bidAmount uses the defaultBidAmount of the corresponding ad group.If you set automatedKeywordsOptIn=true in Update an Ad Group, the bid uses optimized keywords with the defaultBidAmount."
    },
    {
      "name": "deleted",
      "desc": "An indicator of whether the keyword is soft-deleted.You can use the EQUALS and IN selector Condition operators with Find Targeting Keywords in a Campaign."
    },
    {
      "name": "id",
      "desc": "A unique identifier for the targeting keyword in the payload to update keyword bids or statuses. This keywordId is specific to a particular ad group and match type that you use to update bid amounts.You can use the EQUALS and IN selector Condition operators with Find Targeting Keywords in a Campaign."
    },
    {
      "name": "matchType",
      "desc": "An automated keyword and bidding strategy. Match type can be either Broad or Exact. See Ad Groups for Search Match use cases.ValueDescriptionBroadUse this value to ensure your ads don’t run on relevant, close variants of a keyword, such as singulars, plurals, misspellings, synonyms, related searches, and phrases that include that term (fully or partially). ExactUse this value for the most control over searches  your ad may appear in. You can target a specific term and its close variants, such as common misspellings and plurals. Your ad may receive fewer impressions as a result, but your tap-through rates (TTRs) and conversions on those impressions may be higher because you’re reaching users most interested in your app."
    },
    {
      "name": "modificationTime",
      "desc": "The date and time of the most recent modification of the object."
    },
    {
      "name": "status",
      "desc": "The user-controlled status to enable or pause the keyword."
    },
    {
      "name": "text",
      "desc": "The word or phrase to match in App Store user searches to show your ad."
    }
  ]
}