{
  "path": "/documentation/mlcompute/mlcarithmeticoperation",
  "type": "Enumeration",
  "name": "MLCArithmeticOperation",
  "desc": "Constants that describe an arithmetic operation.",
  "items": [
    {
      "name": "case add",
      "desc": "Calculates the element-wise sum of the inputs."
    },
    {
      "name": "case subtract",
      "desc": "Calculates the element-wise difference between the inputs."
    },
    {
      "name": "case multiply",
      "desc": "Calculates the element-wise product of the inputs."
    },
    {
      "name": "case multiplyNoNaN",
      "desc": "Calculates the element-wise product of the inputs, and returns 0 when the result isn’t a number or infinity."
    },
    {
      "name": "case divide",
      "desc": "Calculates the element-wise division of the inputs."
    },
    {
      "name": "case divideNoNaN",
      "desc": "Calculates the element-wise division of the inputs, and returns 0 if the denominator is 0."
    },
    {
      "name": "case min",
      "desc": "Calculates the element-wise minimum of the inputs."
    },
    {
      "name": "case max",
      "desc": "Calculates the element-wise maximum the inputs."
    },
    {
      "name": "case floor",
      "desc": "Calculates the element-wise floor of the inputs."
    },
    {
      "name": "case round",
      "desc": "Calculates the element-wise rounding of the inputs."
    },
    {
      "name": "case ceil",
      "desc": "Calculates the element-wise ceiling of the inputs."
    },
    {
      "name": "case sin",
      "desc": "Calculates the element-wise sine of the input."
    },
    {
      "name": "case cos",
      "desc": "Calculates the element-wise cosine of the input."
    },
    {
      "name": "case tan",
      "desc": "Calculates the element-wise tangent of the input."
    },
    {
      "name": "case asin",
      "desc": "Calculates the element-wise inverse sine of the input."
    },
    {
      "name": "case acos",
      "desc": "Calculates the element-wise inverse cosine of the input."
    },
    {
      "name": "case atan",
      "desc": "Calculates the element-wise inverse tangent of the input."
    },
    {
      "name": "case sinh",
      "desc": "Calculates the element-wise hyperbolic sine of the input."
    },
    {
      "name": "case cosh",
      "desc": "Calculates the element-wise hyperbolic cosine of the input."
    },
    {
      "name": "case tanh",
      "desc": "Calculates the element-wise hyperbolic tangent of the input."
    },
    {
      "name": "case asinh",
      "desc": "Calculates the element-wise inverse hyperbolic sine of the input."
    },
    {
      "name": "case acosh",
      "desc": "Calculates the element-wise inverse hyperbolic cosine of the input."
    },
    {
      "name": "case atanh",
      "desc": "Calculates the element-wise inverse hyperbolic tangent of the input."
    },
    {
      "name": "case sqrt",
      "desc": "Calculates the element-wise square root of the input."
    },
    {
      "name": "case rsqrt",
      "desc": "Calculates the element-wise reciprocal of the square root of the input."
    },
    {
      "name": "case pow",
      "desc": "Calculates the element-wise first input raised to the power of the second input."
    },
    {
      "name": "case exp",
      "desc": "Calculates the element-wise result of the exponent raised to the power of the input."
    },
    {
      "name": "case exp2",
      "desc": "Calculates the element-wise result of the number 2 raised to the power of the input."
    },
    {
      "name": "case log",
      "desc": "Calculates the element-wise natural logarithm of the input."
    },
    {
      "name": "case log2",
      "desc": "Calculates the element-wise base 2 logarithm of the input."
    },
    {
      "name": "var debugDescription: String",
      "desc": "A textual description of the arithmetic operation you use for debugging."
    }
  ],
  "declaration": "enum MLCArithmeticOperation : Int32, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}