{
  "path": "/documentation/apple_news/image",
  "type": "Object",
  "name": "Image",
  "desc": "The component for displaying JPEG, PNG, or GIF images.",
  "items": [
    {
      "name": "role",
      "desc": "Always image for this component."
    },
    {
      "name": "URL",
      "desc": "The URL of an image file.Image URLs can begin with http://, https://, or bundle://. If the image URL begins with bundle://, the image file must be in the same directory as the document.Image filenames should be properly encoded as URLs.See Preparing Image, Video, Audio, Music, and ARKit Assets."
    },
    {
      "name": "accessibilityCaption",
      "desc": "A caption that describes the image. The text is used for VoiceOver for iOS and VoiceOver for macOS. If accessibilityCaption is not provided, the caption value is used for VoiceOver for iOS and VoiceOver for macOS."
    },
    {
      "name": "additions",
      "desc": "An array of ComponentLink objects. This can be used to create a ComponentLink, allowing a link to anywhere in News."
    },
    {
      "name": "anchor",
      "desc": "An object that defines vertical alignment with another component."
    },
    {
      "name": "animation",
      "desc": "An object that defines an animation to be applied to the component.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "behavior",
      "desc": "An object that defines behavior for a component, like Parallax or Springy.The none value is used for conditional design elements. Adding it here has no effect."
    },
    {
      "name": "caption",
      "desc": "A caption that describes the image. The text is seen when the image is in full screen. This text is also used by VoiceOver for iOS and VoiceOver for macOS, if accessibilityCaption text is not provided. The caption text does not appear in the main article view. To display a caption in the main article view, use the Caption component."
    },
    {
      "name": "conditional",
      "desc": "An instance or array of component properties that can be applied conditionally, and the conditions that cause them to be applied."
    },
    {
      "name": "explicitContent",
      "desc": "A Boolean value that indicates the image may contain explicit content."
    },
    {
      "name": "hidden",
      "desc": "A Boolean value that determines whether the component is hidden."
    },
    {
      "name": "identifier",
      "desc": "An optional unique identifier for this component. If used, this identifier must be unique across the entire document. You will need an identifier for your component if you want to anchor other components to it."
    },
    {
      "name": "layout",
      "desc": "An inline ComponentLayout object that contains layout information, or a string reference to a ComponentLayout object that is defined at the top level of the document. If layout is not defined, size and position are based on various factors, such as the device type, the length of the content, and the role of this component."
    },
    {
      "name": "style",
      "desc": "An inline ComponentStyle object that defines the appearance of this component, or a string reference to a ComponentStyle object that is defined at the top level of the document.The none value is used for conditional design elements. Adding it here has no effect."
    }
  ],
  "inheritsFrom": [
    "Component"
  ]
}