{
  "path": "/documentation/mlcompute/mlcactivationtype",
  "type": "Enumeration",
  "name": "MLCActivationType",
  "desc": "An activation type that you specify for an activation descriptor.",
  "items": [
    {
      "name": "case absolute",
      "desc": "An activation type that implements the absolute activation function."
    },
    {
      "name": "case celu",
      "desc": "An activation type that implements the CELU activation function."
    },
    {
      "name": "case clamp",
      "desc": "An activation type that implements the clamp activation function."
    },
    {
      "name": "case elu",
      "desc": "An activation type that implements the exponential linear unit activation function."
    },
    {
      "name": "case gelu",
      "desc": "An activation type that implements the gaussian error linear unit activation function."
    },
    {
      "name": "case hardShrink",
      "desc": "An activation type that implements the hard shrink activation function."
    },
    {
      "name": "case hardSigmoid",
      "desc": "An activation type that implements the hard sigmoid activation function."
    },
    {
      "name": "case hardSwish",
      "desc": "An activation type that implements the hard swish activation function."
    },
    {
      "name": "case linear",
      "desc": "An activation type that implements the linear activation function."
    },
    {
      "name": "case logSigmoid",
      "desc": "An activation type that implements the log sigmoid activation function."
    },
    {
      "name": "case none",
      "desc": "An activation type that implements the identity function."
    },
    {
      "name": "case relu",
      "desc": "An activation type that implements the rectified linear unit activation function."
    },
    {
      "name": "case relun",
      "desc": "An activation type that implements the ReLUN activation function."
    },
    {
      "name": "case selu",
      "desc": "An activation type that implements the scaled exponential linear unit activation function."
    },
    {
      "name": "case sigmoid",
      "desc": "An activation type that implements the sigmoid activation function."
    },
    {
      "name": "case softPlus",
      "desc": "An activation type that implements the soft plus activation function."
    },
    {
      "name": "case softShrink",
      "desc": "An activation type that implements the soft shrink activation function."
    },
    {
      "name": "case softSign",
      "desc": "An activation type that implements the parametric soft sign activation function."
    },
    {
      "name": "case tanh",
      "desc": "An activation type that implements the hyperbolic tangent activation function."
    },
    {
      "name": "case tanhShrink",
      "desc": "An activation type that implements the hyperbolic tangent shrink activation function."
    },
    {
      "name": "case threshold",
      "desc": "An activation type that implements the threshold activation function."
    },
    {
      "name": "var debugDescription: String",
      "desc": "A textual description of the activation type, suitable for debugging."
    }
  ],
  "declaration": "enum MLCActivationType : Int32, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}