{
  "path": "/documentation/avfaudio/avspeechutterance",
  "type": "Class",
  "name": "AVSpeechUtterance",
  "desc": "An object that encapsulates the text for speech synthesis and parameters that affect the speech.",
  "items": [
    {
      "name": "init(string: String)",
      "desc": "Creates an utterance with the text string that you specify for the speech synthesizer to speak."
    },
    {
      "name": "init(attributedString: NSAttributedString)",
      "desc": "Creates an utterance with the attributed text string that you specify for the speech synthesizer to speak."
    },
    {
      "name": "let AVSpeechSynthesisIPANotationAttribute: String",
      "desc": "A string that contains International Phonetic Alphabet (IPA) symbols the speech synthesizer uses to control pronunciation of certain words or phrases."
    },
    {
      "name": "var voice: AVSpeechSynthesisVoice?",
      "desc": "The voice the speech synthesizer uses when speaking the utterance."
    },
    {
      "name": "var pitchMultiplier: Float",
      "desc": "The baseline pitch the speech synthesizer uses when speaking the utterance."
    },
    {
      "name": "var volume: Float",
      "desc": "The volume the speech synthesizer uses when speaking the utterance."
    },
    {
      "name": "var prefersAssistiveTechnologySettings: Bool",
      "desc": "A Boolean that specifies whether assistive technology settings take precedence over the property values of this utterance."
    },
    {
      "name": "var rate: Float",
      "desc": "The rate the speech synthesizer uses when speaking the utterance."
    },
    {
      "name": "let AVSpeechUtteranceMinimumSpeechRate: Float",
      "desc": "The minimum rate the speech synthesizer uses when speaking an utterance."
    },
    {
      "name": "let AVSpeechUtteranceMaximumSpeechRate: Float",
      "desc": "The maximum rate the speech synthesizer uses when speaking an utterance."
    },
    {
      "name": "let AVSpeechUtteranceDefaultSpeechRate: Float",
      "desc": "The default rate the speech synthesizer uses when speaking an utterance."
    },
    {
      "name": "var preUtteranceDelay: TimeInterval",
      "desc": "The amount of time the speech synthesizer pauses before speaking the utterance."
    },
    {
      "name": "var postUtteranceDelay: TimeInterval",
      "desc": "The amount of time the speech synthesizer pauses after speaking an utterance before handling the next utterance in the queue."
    },
    {
      "name": "var speechString: String",
      "desc": "A string that contains the text for speech synthesis."
    },
    {
      "name": "var attributedSpeechString: NSAttributedString",
      "desc": "An attributed string that contains the text for speech synthesis."
    }
  ],
  "declaration": "class AVSpeechUtterance : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCopying",
    "NSSecureCoding"
  ]
}