{
  "path": "/documentation/appstoreconnectapi/app/relationships",
  "type": "Object",
  "name": "App.Relationships",
  "desc": "The relationships you included in the request and those on which you can operate.",
  "items": [
    {
      "name": "betaLicenseAgreement",
      "desc": "The data and links that describe the relationship between the Apps and the Beta License Agreements resources."
    },
    {
      "name": "preReleaseVersions",
      "desc": "The data and links that describe the relationship between the Apps and the Pre-Release Versions resources."
    },
    {
      "name": "betaAppLocalizations",
      "desc": "The data and links that describe the relationship between the Apps and the Beta App Localizations resources."
    },
    {
      "name": "betaGroups",
      "desc": "The data and links that describe the relationship between the Apps and the Beta Groups resources."
    },
    {
      "name": "builds",
      "desc": "The data and links that describe the relationship between the Apps and the Builds resources."
    },
    {
      "name": "betaAppReviewDetail",
      "desc": "The data and links that describe the relationship between the Apps and the Beta App Review Details resources."
    },
    {
      "name": "appInfos",
      "desc": "The data and links that describe the relationship between the Apps and the App Infos resources."
    },
    {
      "name": "appStoreVersions",
      "desc": "The data and links that describe the relationship between the Apps and the App Store Versions resources."
    },
    {
      "name": "availableTerritories",
      "desc": "The data and links that describe the relationship between the Apps and the Available Territories resources."
    },
    {
      "name": "endUserLicenseAgreement",
      "desc": "The data and links that describe the relationship between the Apps and the End User License Agreements (EULA) resources."
    },
    {
      "name": "preOrder",
      "desc": "The data and links that describe the relationship between the Apps and the Pre-Orders resources."
    },
    {
      "name": "prices",
      "desc": "The data and links that describe the relationship between the Apps and the Prices resources."
    },
    {
      "name": "gameCenterEnabledVersions",
      "desc": "The data and links that describe the relationship between the Apps and the Game Center Enabled Versions resources."
    },
    {
      "name": "inAppPurchases",
      "desc": "The data and links that describe the relationship between the Apps and the In App Purchases resources."
    },
    {
      "name": "ciProduct",
      "desc": "The data and links that describe the relationship between the Apps and the Products resources."
    },
    {
      "name": "appClips",
      "desc": "The data and links that describe the relationship between the Apps and the App Clips resources."
    },
    {
      "name": "appCustomProductPages"
    },
    {
      "name": "appEvents"
    },
    {
      "name": "reviewSubmissions"
    }
  ]
}