{
  "path": "/documentation/webkit/webbackforwardlist",
  "type": "Class",
  "name": "WebBackForwardList",
  "desc": "A WebBackForwardList object maintains a list of visited pages used to go back and forward to the most recent page. A WebBackForwardList object maintains only the list data—it does not perform actual page loads (in other words, it does not make any client requests). If you need to perform a page load, see the load(_:) method in WebFrame to find out how to do this.",
  "items": [
    {
      "name": "func add(WebHistoryItem!)",
      "desc": "Inserts an item into the back-forward list, immediately after the current item."
    },
    {
      "name": "func goBack()",
      "desc": "Moves backward one item in the back-forward list."
    },
    {
      "name": "func goForward()",
      "desc": "Moves forward one item in the back-forward list."
    },
    {
      "name": "func go(to: WebHistoryItem!)",
      "desc": "Makes the specified item in the back-forward list the current item."
    },
    {
      "name": "var backItem: WebHistoryItem!",
      "desc": "The item that precedes the current item in the back-forward list."
    },
    {
      "name": "var backListCount: Int32",
      "desc": "The number of items that precede the current item in the back-forward list."
    },
    {
      "name": "func back(withLimit: Int32) -> [Any]!",
      "desc": "Returns the items that precede the current item in the back-forward list, up to the specified number of items."
    },
    {
      "name": "func contains(WebHistoryItem!) -> Bool",
      "desc": "Returns a Boolean value indicating whether the back-forward list contains the specified item."
    },
    {
      "name": "var currentItem: WebHistoryItem!",
      "desc": "The current item in the back-forward list."
    },
    {
      "name": "func item(at: Int32) -> WebHistoryItem!",
      "desc": "Returns the item at the specified index in the back-forward list."
    },
    {
      "name": "var forwardItem: WebHistoryItem!",
      "desc": "The item that follows the current item in the back-forward list."
    },
    {
      "name": "var forwardListCount: Int32",
      "desc": "The number of items that follow the current item in the back-forward list."
    },
    {
      "name": "func forwardList(withLimit: Int32) -> [Any]!",
      "desc": "Returns the items that follow the current item in the back-forward list, up to the specified number of items."
    },
    {
      "name": "func pageCacheSize() -> Int",
      "desc": "Returns the maximum number of pages that the receiver can cache."
    },
    {
      "name": "func setPageCacheSize(Int)",
      "desc": "Sets the maximum number of pages the receiver can cache."
    },
    {
      "name": "var capacity: Int32",
      "desc": "The maximum number of items that the back-forward list can contain."
    }
  ],
  "declaration": "class WebBackForwardList : NSObject",
  "inheritsFrom": [
    "NSObject"
  ]
}