{
  "path": "/documentation/appkit/nsworkspace/openconfiguration",
  "type": "Class",
  "name": "NSWorkspace.OpenConfiguration",
  "desc": "The configuration options for opening URLs or launching apps.",
  "items": [
    {
      "name": "var requiresUniversalLinks: Bool",
      "desc": "A Boolean value indicating whether you require the URL to have an associated universal link."
    },
    {
      "name": "var isForPrinting: Bool",
      "desc": "A Boolean value indicating whether you want to print the contents of documents and URLs instead of opening them."
    },
    {
      "name": "var activates: Bool",
      "desc": "A Boolean value indicating whether the system activates the app and brings it to the foreground."
    },
    {
      "name": "var addsToRecentItems: Bool",
      "desc": "A Boolean value indicating whether to add the app or documents to the Recent Items menu."
    },
    {
      "name": "var allowsRunningApplicationSubstitution: Bool",
      "desc": "A Boolean value that indicates whether to use a running instance of an application even if it’s at a different URL."
    },
    {
      "name": "var createsNewApplicationInstance: Bool",
      "desc": "A Boolean value indicating whether you want the system to launch a new instance of the app."
    },
    {
      "name": "var hides: Bool",
      "desc": "A Boolean value indicating whether you want the app to hide itself after it launches."
    },
    {
      "name": "var hidesOthers: Bool",
      "desc": "A Boolean value indicating whether you want to hide all apps except the one that launched."
    },
    {
      "name": "var promptsUserIfNeeded: Bool",
      "desc": "A Boolean value indicating whether to display errors, authentication requests, or other UI elements to the user."
    },
    {
      "name": "var appleEvent: NSAppleEventDescriptor?",
      "desc": "The first Apple event to send to the new app."
    },
    {
      "name": "var arguments: [String]",
      "desc": "The set of command-line arguments to pass to a new app instance at launch time."
    },
    {
      "name": "var environment: [String : String]",
      "desc": "The set of environment variables to set in a new app instance."
    },
    {
      "name": "var architecture: cpu_type_t",
      "desc": "The architecture version of the app to launch."
    }
  ],
  "declaration": "class OpenConfiguration : NSObject",
  "inheritsFrom": [
    "NSObject"
  ],
  "conformsTo": [
    "NSCopying"
  ]
}