{
  "path": "/documentation/avfoundation/avmediacharacteristic",
  "type": "Structure",
  "name": "AVMediaCharacteristic",
  "desc": "A structure that defines media data characteristics.",
  "items": [
    {
      "name": "static let audible: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option includes audible content."
    },
    {
      "name": "static let containsAlphaChannel: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track contains an alpha channel."
    },
    {
      "name": "static let containsHDRVideo: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track contains HDR video."
    },
    {
      "name": "static let containsOnlyForcedSubtitles: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option presents only forced subtitles."
    },
    {
      "name": "static let describesMusicAndSoundForAccessibility: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option includes legible content in the language of its specified locale."
    },
    {
      "name": "static let describesVideoForAccessibility: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates the media includes audible content that describes the visual portion of the presentation."
    },
    {
      "name": "static let dubbedTranslation: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option contains audio language or dialect translation of the original content."
    },
    {
      "name": "static let easyToRead: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates a track or media selection option provides legible content that’s edited for easy reading."
    },
    {
      "name": "static let frameBased: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option includes frame-based content."
    },
    {
      "name": "static let isAuxiliaryContent: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates a track or media selection option includes content its author indicates is auxiliary to the asset’s presentation."
    },
    {
      "name": "static let isMainProgramContent: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates a track or media selection option includes content its author indicates is essential to the asset’s presentation."
    },
    {
      "name": "static let isOriginalContent: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option contains original content."
    },
    {
      "name": "static let languageTranslation: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option contains a language or dialect translation of the original content."
    },
    {
      "name": "static let legible: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option includes legible content."
    },
    {
      "name": "static let transcribesSpokenDialogForAccessibility: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a media selection option includes legible content that transcribes spoken dialog."
    },
    {
      "name": "static let usesWideGamutColorSpace: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track uses a wide-gamut color space."
    },
    {
      "name": "static let visual: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option includes visual content."
    },
    {
      "name": "static let voiceOverTranslation: AVMediaCharacteristic",
      "desc": "A media characteristic that indicates that a track or media selection option contains a language translation and verbal interpretation of spoken dialog."
    },
    {
      "name": "init(String)",
      "desc": "Creates a media characteristic."
    },
    {
      "name": "init(rawValue: String)",
      "desc": "Creates a media characteristic with a string value."
    }
  ],
  "declaration": "struct AVMediaCharacteristic, @unchecked Sendable",
  "conformsTo": [
    "Equatable",
    "Hashable",
    "RawRepresentable",
    "Sendable"
  ]
}