{
  "path": "/documentation/watchconnectivity/wcerror/code",
  "type": "Enumeration",
  "name": "WCError.Code",
  "desc": "Constants for errors during a session.",
  "items": [
    {
      "name": "case genericError",
      "desc": "An error that occurs when there is an unknown problem."
    },
    {
      "name": "case sessionNotSupported",
      "desc": "An error indicating that the current device doesn’t support the use of session objects."
    },
    {
      "name": "case sessionMissingDelegate",
      "desc": "An error indicating that the WatchKit extension doesn’t have a valid extension delegate to process events."
    },
    {
      "name": "case sessionNotActivated",
      "desc": "An error indicating that the other device doesn’t have an active session."
    },
    {
      "name": "case deviceNotPaired",
      "desc": "An error indicating that the current device doesn’t have a paired counterpart."
    },
    {
      "name": "case watchAppNotInstalled",
      "desc": "An error indicating that the Watch app isn’t an installed app on the user’s Apple Watch."
    },
    {
      "name": "case notReachable",
      "desc": "An error indicating that the counterpart app isn’t reachable."
    },
    {
      "name": "case invalidParameter",
      "desc": "An error indicating that a parameter is invalid."
    },
    {
      "name": "case payloadTooLarge",
      "desc": "An error indicating an attempt to send an item that exceeds the maximum size limit."
    },
    {
      "name": "case payloadUnsupportedTypes",
      "desc": "An error indicating that a dictionary contains nonproperty list types."
    },
    {
      "name": "case messageReplyFailed",
      "desc": "An error that occurs when the system can’t return the reply."
    },
    {
      "name": "case messageReplyTimedOut",
      "desc": "An error that occurs when the counterpart app doesn’t return a reply in time."
    },
    {
      "name": "case fileAccessDenied",
      "desc": "An error indicating that the system can’t transfer a file because it is inaccessible."
    },
    {
      "name": "case deliveryFailed",
      "desc": "An error that occurs when the system can’t deliver the payload."
    },
    {
      "name": "case insufficientSpace",
      "desc": "An error indicating that there isn’t enough space on the receiving side to store the data."
    },
    {
      "name": "case sessionInactive",
      "desc": "An error indicating that the session is inactive."
    },
    {
      "name": "case transferTimedOut",
      "desc": "An error that occurs when the transfer reaches the timeout limit before it completes."
    },
    {
      "name": "case companionAppNotInstalled",
      "desc": "An error indicating that the companion hasn’t installed the app."
    },
    {
      "name": "case watchOnlyApp",
      "desc": "An error indicating that the app is a watch-only app."
    }
  ],
  "declaration": "enum WCError.Code : Int, _ErrorCodeProtocol, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}