{
  "path": "/documentation/coregraphics/cgblendmode",
  "type": "Enumeration",
  "name": "CGBlendMode",
  "desc": "Compositing operations for images.",
  "items": [
    {
      "name": "case normal",
      "desc": "Paints the source image samples over the background image samples."
    },
    {
      "name": "case multiply",
      "desc": "Multiplies the source image samples with the background image samples. This results in colors that are at least as dark as either of the two contributing sample colors."
    },
    {
      "name": "case screen",
      "desc": "Multiplies the inverse of the source image samples with the inverse of the background image samples, resulting in colors that are at least as light as either of the two contributing sample colors."
    },
    {
      "name": "case overlay"
    },
    {
      "name": "case darken"
    },
    {
      "name": "case lighten"
    },
    {
      "name": "case colorDodge",
      "desc": "Brightens the background image samples to reflect the source image samples. Source image sample values that specify black do not produce a change."
    },
    {
      "name": "case colorBurn",
      "desc": "Darkens the background image samples to reflect the source image samples. Source image sample values that specify white do not produce a change."
    },
    {
      "name": "case softLight"
    },
    {
      "name": "case hardLight"
    },
    {
      "name": "case difference"
    },
    {
      "name": "case exclusion",
      "desc": "Produces an effect similar to that produced by CGBlendMode.difference, but with lower contrast. Source image sample values that are black don’t produce a change; white inverts the background color values."
    },
    {
      "name": "case hue",
      "desc": "Uses the luminance and saturation values of the background with the hue of the source image."
    },
    {
      "name": "case saturation",
      "desc": "Uses the luminance and hue values of the background with the saturation of the source image. Areas of the background that have no saturation (that is, pure gray areas) don’t produce a change."
    },
    {
      "name": "case color",
      "desc": "Uses the luminance values of the background with the hue and saturation values of the source image. This mode preserves the gray levels in the image. You can use this mode to color monochrome images or to tint color images."
    },
    {
      "name": "case luminosity",
      "desc": "Uses the hue and saturation of the background with the luminance of the source image. This mode creates an effect that is inverse to the effect created by CGBlendMode.color."
    },
    {
      "name": "case clear",
      "desc": "R = 0"
    },
    {
      "name": "case copy",
      "desc": "R = S"
    },
    {
      "name": "case sourceIn",
      "desc": "R = S*Da"
    },
    {
      "name": "case sourceOut",
      "desc": "R = S*(1 - Da)"
    },
    {
      "name": "case sourceAtop",
      "desc": "R = S*Da + D*(1 - Sa)"
    },
    {
      "name": "case destinationOver",
      "desc": "R = S*(1 - Da) + D"
    },
    {
      "name": "case destinationIn",
      "desc": "R = D*Sa"
    },
    {
      "name": "case destinationOut",
      "desc": "R = D*(1 - Sa)"
    },
    {
      "name": "case destinationAtop",
      "desc": "R = S*(1 - Da) + D*Sa"
    },
    {
      "name": "case xor",
      "desc": "R = S*(1 - Da) + D*(1 - Sa). This XOR mode is only nominally related to the classical bitmap XOR operation, which is not supported by Core Graphics"
    },
    {
      "name": "case plusDarker",
      "desc": "R = MAX(0, 1 - ((1 - D) + (1 - S)))"
    },
    {
      "name": "case plusLighter",
      "desc": "R = MIN(1, S + D)"
    }
  ],
  "declaration": "enum CGBlendMode : Int32, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}