{
  "path": "/documentation/uikit/nslayoutconstraint/attribute",
  "type": "Enumeration",
  "name": "NSLayoutConstraint.Attribute",
  "desc": "The part of the object’s visual representation that should be used to get the value for the constraint.",
  "items": [
    {
      "name": "case left",
      "desc": "The left side of the object’s alignment rectangle."
    },
    {
      "name": "case right",
      "desc": "The right side of the object’s alignment rectangle."
    },
    {
      "name": "case top",
      "desc": "The top of the object’s alignment rectangle."
    },
    {
      "name": "case bottom",
      "desc": "The bottom of the object’s alignment rectangle."
    },
    {
      "name": "case leading",
      "desc": "The leading edge of the object’s alignment rectangle."
    },
    {
      "name": "case trailing",
      "desc": "The trailing edge of the object’s alignment rectangle."
    },
    {
      "name": "case width",
      "desc": "The width of the object’s alignment rectangle."
    },
    {
      "name": "case height",
      "desc": "The height of the object’s alignment rectangle."
    },
    {
      "name": "case centerX",
      "desc": "The center along the x-axis of the object’s alignment rectangle."
    },
    {
      "name": "case centerY",
      "desc": "The center along the y-axis of the object’s alignment rectangle."
    },
    {
      "name": "case lastBaseline",
      "desc": "The object’s baseline. For objects with more than one line of text, this is the baseline for the bottommost line of text."
    },
    {
      "name": "case firstBaseline",
      "desc": "The object’s baseline. For objects with more than one line of text, this is the baseline for the topmost line of text."
    },
    {
      "name": "case leftMargin",
      "desc": "The object’s left margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case rightMargin",
      "desc": "The object’s right margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case topMargin",
      "desc": "The object’s top margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case bottomMargin",
      "desc": "The object’s bottom margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case leadingMargin",
      "desc": "The object’s leading margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case trailingMargin",
      "desc": "The object’s trailing margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case centerXWithinMargins",
      "desc": "The center along the x-axis between the object’s left and right margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case centerYWithinMargins",
      "desc": "The center along the y-axis between the object’s top and bottom margin. For UIView objects, the margins are defined by their layoutMargins property."
    },
    {
      "name": "case notAnAttribute",
      "desc": "A placeholder value that is used to indicate that the constraint’s second item and second attribute are not used in any calculations. Use this value when creating a constraint that assigns a constant to an attribute. For example, item1.height >= 40. If a constraint only has one item, set the second item to nil, and set the second attribute to NSLayoutAttributeNotAnAttribute."
    }
  ],
  "declaration": "enum Attribute : Int, @unchecked Sendable",
  "conformsTo": [
    "Sendable"
  ]
}